/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize);
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {

pub const MAPSEC_ALTERING_CAVE_FRLG: u32 = 183;
pub const MAPSEC_TANOBY_CHAMBERS: u32 = 184;
pub const MAPSEC_THREE_ISLE_PATH: u32 = 185;
pub const MAPSEC_TANOBY_KEY: u32 = 186;
pub const MAPSEC_BIRTH_ISLAND_FRLG: u32 = 187;
pub const MAPSEC_MONEAN_CHAMBER: u32 = 188;
pub const MAPSEC_LIPTOO_CHAMBER: u32 = 189;
pub const MAPSEC_WEEPTH_CHAMBER: u32 = 190;
pub const MAPSEC_DILFORD_CHAMBER: u32 = 191;
pub const MAPSEC_SCUFIB_CHAMBER: u32 = 192;
pub const MAPSEC_RIXY_CHAMBER: u32 = 193;
pub const MAPSEC_VIAPOIS_CHAMBER: u32 = 194;
pub const MAPSEC_EMBER_SPA: u32 = 195;
pub const MAPSEC_SPECIAL_AREA: u32 = 196;
pub const MAPSEC_AQUA_HIDEOUT: u32 = 197;
pub const MAPSEC_MAGMA_HIDEOUT: u32 = 198;
pub const MAPSEC_MIRAGE_TOWER: u32 = 199;
pub const MAPSEC_BIRTH_ISLAND: u32 = 200;
pub const MAPSEC_FARAWAY_ISLAND: u32 = 201;
pub const MAPSEC_ARTISAN_CAVE: u32 = 202;
pub const MAPSEC_MARINE_CAVE: u32 = 203;
pub const MAPSEC_UNDERWATER_MARINE_CAVE: u32 = 204;
pub const MAPSEC_TERRA_CAVE: u32 = 205;
pub const MAPSEC_UNDERWATER_105: u32 = 206;
pub const MAPSEC_UNDERWATER_125: u32 = 207;
pub const MAPSEC_UNDERWATER_129: u32 = 208;
pub const MAPSEC_DESERT_UNDERPASS: u32 = 209;
pub const MAPSEC_ALTERING_CAVE: u32 = 210;
pub const MAPSEC_NAVEL_ROCK: u32 = 211;
pub const MAPSEC_TRAINER_HILL: u32 = 212;
pub const MAPSEC_NONE: u32 = 213;
pub const METLOC_SPECIAL_EGG: u32 = 253;
pub const METLOC_IN_GAME_TRADE: u32 = 254;
pub const METLOC_FATEFUL_ENCOUNTER: u32 = 255;
pub const KANTO_MAPSEC_START: u32 = 88;
pub const KANTO_MAPSEC_END: u32 = 196;
pub const KANTO_MAPSEC_COUNT: u32 = 109;
pub const MAX_COMBO_MOVES: u32 = 5;
pub const FORM_SPECIES_END: u32 = 65535;
pub const ANIM_HARDY: u32 = 0;
pub const ANIM_LONELY: u32 = 3;
pub const ANIM_BRAVE: u32 = 4;
pub const ANIM_ADAMANT: u32 = 5;
pub const ANIM_NAUGHTY: u32 = 10;
pub const ANIM_BOLD: u32 = 13;
pub const ANIM_DOCILE: u32 = 15;
pub const ANIM_RELAXED: u32 = 16;
pub const ANIM_IMPISH: u32 = 18;
pub const ANIM_LAX: u32 = 19;
pub const ANIM_TIMID: u32 = 20;
pub const ANIM_HASTY: u32 = 25;
pub const ANIM_SERIOUS: u32 = 27;
pub const ANIM_JOLLY: u32 = 28;
pub const ANIM_NAIVE: u32 = 29;
pub const ANIM_MODEST: u32 = 33;
pub const ANIM_MILD: u32 = 36;
pub const ANIM_QUIET: u32 = 37;
pub const ANIM_BASHFUL: u32 = 39;
pub const ANIM_RASH: u32 = 42;
pub const ANIM_CALM: u32 = 45;
pub const ANIM_GENTLE: u32 = 46;
pub const ANIM_SASSY: u32 = 47;
pub const ANIM_CAREFUL: u32 = 48;
pub const ANIM_QUIRKY: u32 = 53;
pub const PALACE_TARGET_STRONGER: u32 = 0;
pub const PALACE_TARGET_WEAKER: u32 = 1;
pub const PALACE_TARGET_RANDOM: u32 = 2;
pub const SPINDA_SPOT_WIDTH: u32 = 16;
pub const SPINDA_SPOT_HEIGHT: u32 = 16;
pub const NUM_UNOWN_FORMS: u32 = 28;
pub const LINK_B_RECORDS_COUNT: u32 = 5;
pub type wchar_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::core::ffi::c_longlong,
    pub __clang_max_align_nonce2: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::core::mem::size_of::<max_align_t>() - 16usize];
    ["Alignment of max_align_t"][::core::mem::align_of::<max_align_t>() - 8usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::core::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::core::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 8usize];
};
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_longlong;
pub type __uint64_t = ::core::ffi::c_ulonglong;
pub type __int_least8_t = ::core::ffi::c_schar;
pub type __uint_least8_t = ::core::ffi::c_uchar;
pub type __int_least16_t = ::core::ffi::c_short;
pub type __uint_least16_t = ::core::ffi::c_ushort;
pub type __int_least32_t = ::core::ffi::c_int;
pub type __uint_least32_t = ::core::ffi::c_uint;
pub type __int_least64_t = ::core::ffi::c_longlong;
pub type __uint_least64_t = ::core::ffi::c_ulonglong;
pub type __intmax_t = ::core::ffi::c_longlong;
pub type __uintmax_t = ::core::ffi::c_ulonglong;
pub type __intptr_t = ::core::ffi::c_int;
pub type __uintptr_t = ::core::ffi::c_uint;
pub type wint_t = ::core::ffi::c_int;
pub type __blkcnt_t = ::core::ffi::c_long;
pub type __blksize_t = ::core::ffi::c_long;
pub type __fsblkcnt_t = __uint64_t;
pub type __fsfilcnt_t = __uint32_t;
pub type _off_t = ::core::ffi::c_long;
pub type __pid_t = ::core::ffi::c_int;
pub type __dev_t = ::core::ffi::c_short;
pub type __uid_t = ::core::ffi::c_ushort;
pub type __gid_t = ::core::ffi::c_ushort;
pub type __id_t = __uint32_t;
pub type __ino_t = ::core::ffi::c_ushort;
pub type __mode_t = __uint32_t;
pub type _off64_t = ::core::ffi::c_longlong;
pub type __off_t = _off_t;
pub type __loff_t = _off64_t;
pub type __key_t = ::core::ffi::c_long;
pub type _fpos_t = ::core::ffi::c_long;
pub type __size_t = ::core::ffi::c_uint;
pub type _ssize_t = ::core::ffi::c_int;
pub type __ssize_t = _ssize_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _mbstate_t {
    pub __count: ::core::ffi::c_int,
    pub __value: _mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _mbstate_t__bindgen_ty_1 {
    pub __wch: wint_t,
    pub __wchb: [::core::ffi::c_uchar; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _mbstate_t__bindgen_ty_1"]
        [::core::mem::size_of::<_mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of _mbstate_t__bindgen_ty_1"]
        [::core::mem::align_of::<_mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: _mbstate_t__bindgen_ty_1::__wch"]
        [::core::mem::offset_of!(_mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: _mbstate_t__bindgen_ty_1::__wchb"]
        [::core::mem::offset_of!(_mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _mbstate_t"][::core::mem::size_of::<_mbstate_t>() - 8usize];
    ["Alignment of _mbstate_t"][::core::mem::align_of::<_mbstate_t>() - 4usize];
    ["Offset of field: _mbstate_t::__count"][::core::mem::offset_of!(_mbstate_t, __count) - 0usize];
    ["Offset of field: _mbstate_t::__value"][::core::mem::offset_of!(_mbstate_t, __value) - 4usize];
};
pub type _iconv_t = *mut ::core::ffi::c_void;
pub type __clock_t = ::core::ffi::c_ulong;
pub type __time_t = __int_least64_t;
pub type __clockid_t = ::core::ffi::c_ulong;
pub type __daddr_t = ::core::ffi::c_long;
pub type __timer_t = ::core::ffi::c_ulong;
pub type __sa_family_t = __uint8_t;
pub type __socklen_t = __uint32_t;
pub type __nl_item = ::core::ffi::c_int;
pub type __nlink_t = ::core::ffi::c_ushort;
pub type __suseconds_t = ::core::ffi::c_long;
pub type __useconds_t = ::core::ffi::c_ulong;
pub type __va_list = u32;
pub type __ULong = ::core::ffi::c_ulong;
pub type _LOCK_T = ::core::ffi::c_int;
pub type _LOCK_RECURSIVE_T = ::core::ffi::c_int;
pub type _flock_t = _LOCK_RECURSIVE_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Bigint {
    pub _next: *mut _Bigint,
    pub _k: ::core::ffi::c_int,
    pub _maxwds: ::core::ffi::c_int,
    pub _sign: ::core::ffi::c_int,
    pub _wds: ::core::ffi::c_int,
    pub _x: [__ULong; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Bigint"][::core::mem::size_of::<_Bigint>() - 24usize];
    ["Alignment of _Bigint"][::core::mem::align_of::<_Bigint>() - 4usize];
    ["Offset of field: _Bigint::_next"][::core::mem::offset_of!(_Bigint, _next) - 0usize];
    ["Offset of field: _Bigint::_k"][::core::mem::offset_of!(_Bigint, _k) - 4usize];
    ["Offset of field: _Bigint::_maxwds"][::core::mem::offset_of!(_Bigint, _maxwds) - 8usize];
    ["Offset of field: _Bigint::_sign"][::core::mem::offset_of!(_Bigint, _sign) - 12usize];
    ["Offset of field: _Bigint::_wds"][::core::mem::offset_of!(_Bigint, _wds) - 16usize];
    ["Offset of field: _Bigint::_x"][::core::mem::offset_of!(_Bigint, _x) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __tm {
    pub __tm_sec: ::core::ffi::c_int,
    pub __tm_min: ::core::ffi::c_int,
    pub __tm_hour: ::core::ffi::c_int,
    pub __tm_mday: ::core::ffi::c_int,
    pub __tm_mon: ::core::ffi::c_int,
    pub __tm_year: ::core::ffi::c_int,
    pub __tm_wday: ::core::ffi::c_int,
    pub __tm_yday: ::core::ffi::c_int,
    pub __tm_isdst: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __tm"][::core::mem::size_of::<__tm>() - 36usize];
    ["Alignment of __tm"][::core::mem::align_of::<__tm>() - 4usize];
    ["Offset of field: __tm::__tm_sec"][::core::mem::offset_of!(__tm, __tm_sec) - 0usize];
    ["Offset of field: __tm::__tm_min"][::core::mem::offset_of!(__tm, __tm_min) - 4usize];
    ["Offset of field: __tm::__tm_hour"][::core::mem::offset_of!(__tm, __tm_hour) - 8usize];
    ["Offset of field: __tm::__tm_mday"][::core::mem::offset_of!(__tm, __tm_mday) - 12usize];
    ["Offset of field: __tm::__tm_mon"][::core::mem::offset_of!(__tm, __tm_mon) - 16usize];
    ["Offset of field: __tm::__tm_year"][::core::mem::offset_of!(__tm, __tm_year) - 20usize];
    ["Offset of field: __tm::__tm_wday"][::core::mem::offset_of!(__tm, __tm_wday) - 24usize];
    ["Offset of field: __tm::__tm_yday"][::core::mem::offset_of!(__tm, __tm_yday) - 28usize];
    ["Offset of field: __tm::__tm_isdst"][::core::mem::offset_of!(__tm, __tm_isdst) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _on_exit_args {
    pub _fnargs: [*mut ::core::ffi::c_void; 32usize],
    pub _dso_handle: [*mut ::core::ffi::c_void; 32usize],
    pub _fntypes: __ULong,
    pub _is_cxa: __ULong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _on_exit_args"][::core::mem::size_of::<_on_exit_args>() - 264usize];
    ["Alignment of _on_exit_args"][::core::mem::align_of::<_on_exit_args>() - 4usize];
    ["Offset of field: _on_exit_args::_fnargs"]
        [::core::mem::offset_of!(_on_exit_args, _fnargs) - 0usize];
    ["Offset of field: _on_exit_args::_dso_handle"]
        [::core::mem::offset_of!(_on_exit_args, _dso_handle) - 128usize];
    ["Offset of field: _on_exit_args::_fntypes"]
        [::core::mem::offset_of!(_on_exit_args, _fntypes) - 256usize];
    ["Offset of field: _on_exit_args::_is_cxa"]
        [::core::mem::offset_of!(_on_exit_args, _is_cxa) - 260usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _atexit {
    pub _next: *mut _atexit,
    pub _ind: ::core::ffi::c_int,
    pub _fns: [::core::option::Option<unsafe extern "C" fn()>; 32usize],
    pub _on_exit_args: _on_exit_args,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _atexit"][::core::mem::size_of::<_atexit>() - 400usize];
    ["Alignment of _atexit"][::core::mem::align_of::<_atexit>() - 4usize];
    ["Offset of field: _atexit::_next"][::core::mem::offset_of!(_atexit, _next) - 0usize];
    ["Offset of field: _atexit::_ind"][::core::mem::offset_of!(_atexit, _ind) - 4usize];
    ["Offset of field: _atexit::_fns"][::core::mem::offset_of!(_atexit, _fns) - 8usize];
    ["Offset of field: _atexit::_on_exit_args"]
        [::core::mem::offset_of!(_atexit, _on_exit_args) - 136usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sbuf {
    pub _base: *mut ::core::ffi::c_uchar,
    pub _size: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sbuf"][::core::mem::size_of::<__sbuf>() - 8usize];
    ["Alignment of __sbuf"][::core::mem::align_of::<__sbuf>() - 4usize];
    ["Offset of field: __sbuf::_base"][::core::mem::offset_of!(__sbuf, _base) - 0usize];
    ["Offset of field: __sbuf::_size"][::core::mem::offset_of!(__sbuf, _size) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __sFILE {
    pub _p: *mut ::core::ffi::c_uchar,
    pub _r: ::core::ffi::c_int,
    pub _w: ::core::ffi::c_int,
    pub _flags: ::core::ffi::c_short,
    pub _file: ::core::ffi::c_short,
    pub _bf: __sbuf,
    pub _lbfsize: ::core::ffi::c_int,
    pub _cookie: *mut ::core::ffi::c_void,
    pub _read: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::core::ffi::c_void,
            arg3: *mut ::core::ffi::c_char,
            arg4: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _write: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::core::ffi::c_void,
            arg3: *const ::core::ffi::c_char,
            arg4: ::core::ffi::c_int,
        ) -> ::core::ffi::c_int,
    >,
    pub _seek: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::core::ffi::c_void,
            arg3: _fpos_t,
            arg4: ::core::ffi::c_int,
        ) -> _fpos_t,
    >,
    pub _close: ::core::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _reent,
            arg2: *mut ::core::ffi::c_void,
        ) -> ::core::ffi::c_int,
    >,
    pub _ub: __sbuf,
    pub _up: *mut ::core::ffi::c_uchar,
    pub _ur: ::core::ffi::c_int,
    pub _ubuf: [::core::ffi::c_uchar; 3usize],
    pub _nbuf: [::core::ffi::c_uchar; 1usize],
    pub _lb: __sbuf,
    pub _blksize: ::core::ffi::c_int,
    pub _offset: _off_t,
    pub _data: *mut _reent,
    pub _lock: _flock_t,
    pub _mbstate: _mbstate_t,
    pub _flags2: ::core::ffi::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sFILE"][::core::mem::size_of::<__sFILE>() - 104usize];
    ["Alignment of __sFILE"][::core::mem::align_of::<__sFILE>() - 4usize];
    ["Offset of field: __sFILE::_p"][::core::mem::offset_of!(__sFILE, _p) - 0usize];
    ["Offset of field: __sFILE::_r"][::core::mem::offset_of!(__sFILE, _r) - 4usize];
    ["Offset of field: __sFILE::_w"][::core::mem::offset_of!(__sFILE, _w) - 8usize];
    ["Offset of field: __sFILE::_flags"][::core::mem::offset_of!(__sFILE, _flags) - 12usize];
    ["Offset of field: __sFILE::_file"][::core::mem::offset_of!(__sFILE, _file) - 14usize];
    ["Offset of field: __sFILE::_bf"][::core::mem::offset_of!(__sFILE, _bf) - 16usize];
    ["Offset of field: __sFILE::_lbfsize"][::core::mem::offset_of!(__sFILE, _lbfsize) - 24usize];
    ["Offset of field: __sFILE::_cookie"][::core::mem::offset_of!(__sFILE, _cookie) - 28usize];
    ["Offset of field: __sFILE::_read"][::core::mem::offset_of!(__sFILE, _read) - 32usize];
    ["Offset of field: __sFILE::_write"][::core::mem::offset_of!(__sFILE, _write) - 36usize];
    ["Offset of field: __sFILE::_seek"][::core::mem::offset_of!(__sFILE, _seek) - 40usize];
    ["Offset of field: __sFILE::_close"][::core::mem::offset_of!(__sFILE, _close) - 44usize];
    ["Offset of field: __sFILE::_ub"][::core::mem::offset_of!(__sFILE, _ub) - 48usize];
    ["Offset of field: __sFILE::_up"][::core::mem::offset_of!(__sFILE, _up) - 56usize];
    ["Offset of field: __sFILE::_ur"][::core::mem::offset_of!(__sFILE, _ur) - 60usize];
    ["Offset of field: __sFILE::_ubuf"][::core::mem::offset_of!(__sFILE, _ubuf) - 64usize];
    ["Offset of field: __sFILE::_nbuf"][::core::mem::offset_of!(__sFILE, _nbuf) - 67usize];
    ["Offset of field: __sFILE::_lb"][::core::mem::offset_of!(__sFILE, _lb) - 68usize];
    ["Offset of field: __sFILE::_blksize"][::core::mem::offset_of!(__sFILE, _blksize) - 76usize];
    ["Offset of field: __sFILE::_offset"][::core::mem::offset_of!(__sFILE, _offset) - 80usize];
    ["Offset of field: __sFILE::_data"][::core::mem::offset_of!(__sFILE, _data) - 84usize];
    ["Offset of field: __sFILE::_lock"][::core::mem::offset_of!(__sFILE, _lock) - 88usize];
    ["Offset of field: __sFILE::_mbstate"][::core::mem::offset_of!(__sFILE, _mbstate) - 92usize];
    ["Offset of field: __sFILE::_flags2"][::core::mem::offset_of!(__sFILE, _flags2) - 100usize];
};
pub type __FILE = __sFILE;
unsafe extern "C" {
    pub static mut __sf: [__FILE; 3usize];
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _glue {
    pub _next: *mut _glue,
    pub _niobs: ::core::ffi::c_int,
    pub _iobs: *mut __FILE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _glue"][::core::mem::size_of::<_glue>() - 12usize];
    ["Alignment of _glue"][::core::mem::align_of::<_glue>() - 4usize];
    ["Offset of field: _glue::_next"][::core::mem::offset_of!(_glue, _next) - 0usize];
    ["Offset of field: _glue::_niobs"][::core::mem::offset_of!(_glue, _niobs) - 4usize];
    ["Offset of field: _glue::_iobs"][::core::mem::offset_of!(_glue, _iobs) - 8usize];
};
unsafe extern "C" {
    pub static mut __sglue: _glue;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _rand48 {
    pub _seed: [::core::ffi::c_ushort; 3usize],
    pub _mult: [::core::ffi::c_ushort; 3usize],
    pub _add: ::core::ffi::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _rand48"][::core::mem::size_of::<_rand48>() - 14usize];
    ["Alignment of _rand48"][::core::mem::align_of::<_rand48>() - 2usize];
    ["Offset of field: _rand48::_seed"][::core::mem::offset_of!(_rand48, _seed) - 0usize];
    ["Offset of field: _rand48::_mult"][::core::mem::offset_of!(_rand48, _mult) - 6usize];
    ["Offset of field: _rand48::_add"][::core::mem::offset_of!(_rand48, _add) - 12usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _reent {
    pub _errno: ::core::ffi::c_int,
    pub _stdin: *mut __FILE,
    pub _stdout: *mut __FILE,
    pub _stderr: *mut __FILE,
    pub _inc: ::core::ffi::c_int,
    pub _emergency: [::core::ffi::c_char; 25usize],
    pub _locale: *mut __locale_t,
    pub __cleanup: ::core::option::Option<unsafe extern "C" fn(arg1: *mut _reent)>,
    pub _result: *mut _Bigint,
    pub _result_k: ::core::ffi::c_int,
    pub _p5s: *mut _Bigint,
    pub _freelist: *mut *mut _Bigint,
    pub _cvtlen: ::core::ffi::c_int,
    pub _cvtbuf: *mut ::core::ffi::c_char,
    pub _new: _reent__bindgen_ty_1,
    pub _sig_func: *mut ::core::option::Option<unsafe extern "C" fn(arg1: ::core::ffi::c_int)>,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _reent__bindgen_ty_1 {
    pub _reent: _reent__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _reent__bindgen_ty_1__bindgen_ty_1 {
    pub _strtok_last: *mut ::core::ffi::c_char,
    pub _asctime_buf: [::core::ffi::c_char; 26usize],
    pub _localtime_buf: __tm,
    pub _gamma_signgam: ::core::ffi::c_int,
    pub _rand_next: ::core::ffi::c_ulonglong,
    pub _r48: _rand48,
    pub _mblen_state: _mbstate_t,
    pub _mbtowc_state: _mbstate_t,
    pub _wctomb_state: _mbstate_t,
    pub _l64a_buf: [::core::ffi::c_char; 8usize],
    pub _signal_buf: [::core::ffi::c_char; 24usize],
    pub _getdate_err: ::core::ffi::c_int,
    pub _mbrlen_state: _mbstate_t,
    pub _mbrtowc_state: _mbstate_t,
    pub _mbsrtowcs_state: _mbstate_t,
    pub _wcrtomb_state: _mbstate_t,
    pub _wcsrtombs_state: _mbstate_t,
    pub _h_errno: ::core::ffi::c_int,
    pub _getlocalename_l_buf: [::core::ffi::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<_reent__bindgen_ty_1__bindgen_ty_1>() - 232usize];
    ["Alignment of _reent__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<_reent__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_strtok_last"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _strtok_last) - 0usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_asctime_buf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _asctime_buf) - 4usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_localtime_buf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _localtime_buf) - 32usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_gamma_signgam"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _gamma_signgam) - 68usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_rand_next"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _rand_next) - 72usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_r48"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _r48) - 80usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mblen_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mblen_state) - 96usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mbtowc_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mbtowc_state) - 104usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_wctomb_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _wctomb_state) - 112usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_l64a_buf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _l64a_buf) - 120usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_signal_buf"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _signal_buf) - 128usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_getdate_err"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _getdate_err) - 152usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mbrlen_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mbrlen_state) - 156usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mbrtowc_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mbrtowc_state) - 164usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_mbsrtowcs_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _mbsrtowcs_state) - 172usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_wcrtomb_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _wcrtomb_state) - 180usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_wcsrtombs_state"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _wcsrtombs_state) - 188usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_h_errno"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1__bindgen_ty_1, _h_errno) - 196usize];
    ["Offset of field: _reent__bindgen_ty_1__bindgen_ty_1::_getlocalename_l_buf"][::core::mem::offset_of!(
        _reent__bindgen_ty_1__bindgen_ty_1,
        _getlocalename_l_buf
    ) - 200usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent__bindgen_ty_1"][::core::mem::size_of::<_reent__bindgen_ty_1>() - 232usize];
    ["Alignment of _reent__bindgen_ty_1"][::core::mem::align_of::<_reent__bindgen_ty_1>() - 8usize];
    ["Offset of field: _reent__bindgen_ty_1::_reent"]
        [::core::mem::offset_of!(_reent__bindgen_ty_1, _reent) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _reent"][::core::mem::size_of::<_reent>() - 320usize];
    ["Alignment of _reent"][::core::mem::align_of::<_reent>() - 8usize];
    ["Offset of field: _reent::_errno"][::core::mem::offset_of!(_reent, _errno) - 0usize];
    ["Offset of field: _reent::_stdin"][::core::mem::offset_of!(_reent, _stdin) - 4usize];
    ["Offset of field: _reent::_stdout"][::core::mem::offset_of!(_reent, _stdout) - 8usize];
    ["Offset of field: _reent::_stderr"][::core::mem::offset_of!(_reent, _stderr) - 12usize];
    ["Offset of field: _reent::_inc"][::core::mem::offset_of!(_reent, _inc) - 16usize];
    ["Offset of field: _reent::_emergency"][::core::mem::offset_of!(_reent, _emergency) - 20usize];
    ["Offset of field: _reent::_locale"][::core::mem::offset_of!(_reent, _locale) - 48usize];
    ["Offset of field: _reent::__cleanup"][::core::mem::offset_of!(_reent, __cleanup) - 52usize];
    ["Offset of field: _reent::_result"][::core::mem::offset_of!(_reent, _result) - 56usize];
    ["Offset of field: _reent::_result_k"][::core::mem::offset_of!(_reent, _result_k) - 60usize];
    ["Offset of field: _reent::_p5s"][::core::mem::offset_of!(_reent, _p5s) - 64usize];
    ["Offset of field: _reent::_freelist"][::core::mem::offset_of!(_reent, _freelist) - 68usize];
    ["Offset of field: _reent::_cvtlen"][::core::mem::offset_of!(_reent, _cvtlen) - 72usize];
    ["Offset of field: _reent::_cvtbuf"][::core::mem::offset_of!(_reent, _cvtbuf) - 76usize];
    ["Offset of field: _reent::_new"][::core::mem::offset_of!(_reent, _new) - 80usize];
    ["Offset of field: _reent::_sig_func"][::core::mem::offset_of!(_reent, _sig_func) - 312usize];
};
unsafe extern "C" {
    pub static mut _impure_ptr: *mut _reent;
}
unsafe extern "C" {
    pub static mut _impure_data: _reent;
}
unsafe extern "C" {
    pub static mut __atexit: *mut _atexit;
}
unsafe extern "C" {
    pub static mut __atexit0: _atexit;
}
unsafe extern "C" {
    pub static mut __stdio_exit_handler: ::core::option::Option<unsafe extern "C" fn()>;
}
unsafe extern "C" {
    pub fn _reclaim_reent(arg1: *mut _reent);
}
unsafe extern "C" {
    pub fn _fwalk_sglue(
        arg1: *mut _reent,
        arg2: ::core::option::Option<
            unsafe extern "C" fn(arg1: *mut _reent, arg2: *mut __FILE) -> ::core::ffi::c_int,
        >,
        arg3: *mut _glue,
    ) -> ::core::ffi::c_int;
}
pub type locale_t = *mut __locale_t;
unsafe extern "C" {
    pub fn bcmp(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn bcopy(
        arg1: *const ::core::ffi::c_void,
        arg2: *mut ::core::ffi::c_void,
        arg3: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    pub fn bzero(arg1: *mut ::core::ffi::c_void, arg2: ::core::ffi::c_uint);
}
unsafe extern "C" {
    pub fn explicit_bzero(arg1: *mut ::core::ffi::c_void, arg2: usize);
}
unsafe extern "C" {
    pub fn ffs(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ffsl(arg1: ::core::ffi::c_long) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn ffsll(arg1: ::core::ffi::c_longlong) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn fls(arg1: ::core::ffi::c_int) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn flsl(arg1: ::core::ffi::c_long) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn flsll(arg1: ::core::ffi::c_longlong) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn index(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn rindex(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcasecmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp_l(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: locale_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp_l(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn memchr(
        arg1: *const ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn memset(
        arg1: *mut ::core::ffi::c_void,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn strcat(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strchr(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strcpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn strerror(arg1: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strlen(arg1: *const ::core::ffi::c_char) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn strncat(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strncmp(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strncpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strpbrk(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strspn(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn strstr(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strxfrm(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn strcoll_l(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: locale_t,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn strerror_l(arg1: ::core::ffi::c_int, arg2: locale_t) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strxfrm_l(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
        arg4: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strtok_r(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: *mut *mut ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn timingsafe_bcmp(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn timingsafe_memcmp(
        arg1: *const ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn memccpy(
        arg1: *mut ::core::ffi::c_void,
        arg2: *const ::core::ffi::c_void,
        arg3: ::core::ffi::c_int,
        arg4: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_void;
}
unsafe extern "C" {
    pub fn stpcpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strdup(arg1: *const ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _strdup_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strndup(
        arg1: *const ::core::ffi::c_char,
        arg2: ::core::ffi::c_uint,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn _strndup_r(
        arg1: *mut _reent,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        arg1: ::core::ffi::c_int,
        arg2: *mut ::core::ffi::c_char,
        arg3: usize,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn _strerror_r(
        arg1: *mut _reent,
        arg2: ::core::ffi::c_int,
        arg3: ::core::ffi::c_int,
        arg4: *mut ::core::ffi::c_int,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strlcat(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn strlcpy(
        arg1: *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_uint;
}
unsafe extern "C" {
    pub fn strnlen(arg1: *const ::core::ffi::c_char, arg2: usize) -> usize;
}
unsafe extern "C" {
    pub fn strsep(
        arg1: *mut *mut ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strnstr(
        arg1: *const ::core::ffi::c_char,
        arg2: *const ::core::ffi::c_char,
        arg3: usize,
    ) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strlwr(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strupr(arg1: *mut ::core::ffi::c_char) -> *mut ::core::ffi::c_char;
}
unsafe extern "C" {
    pub fn strsignal(__signo: ::core::ffi::c_int) -> *mut ::core::ffi::c_char;
}
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type int_least8_t = __int_least8_t;
pub type uint_least8_t = __uint_least8_t;
pub type int_least16_t = __int_least16_t;
pub type uint_least16_t = __uint_least16_t;
pub type int_least32_t = __int_least32_t;
pub type uint_least32_t = __uint_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::core::ffi::c_schar;
pub type uint_fast8_t = ::core::ffi::c_uchar;
pub type int_fast16_t = ::core::ffi::c_short;
pub type uint_fast16_t = ::core::ffi::c_ushort;
pub type int_fast32_t = ::core::ffi::c_int;
pub type uint_fast32_t = ::core::ffi::c_uint;
pub type int_fast64_t = ::core::ffi::c_longlong;
pub type uint_fast64_t = ::core::ffi::c_ulonglong;
pub type u8_ = u8;
pub type u16_ = u16;
pub type u32_ = u32;
pub type u64_ = u64;
pub type s8 = i8;
pub type s16 = i16;
pub type s32 = i32;
pub type s64 = i64;
pub type vu8 = u8_;
pub type vu16 = u16_;
pub type vu32 = u32_;
pub type vu64 = u64_;
pub type vs8 = s8;
pub type vs16 = s16;
pub type vs32 = s32;
pub type vs64 = s64;
pub type f32_ = f32;
pub type f64_ = f64;
pub type bool8 = u8_;
pub type bool16 = u16_;
pub type bool32 = u32_;
pub type vbool8 = vu8;
pub type vbool16 = vu16;
pub type vbool32 = vu32;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct BgCnt {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BgCnt"][::core::mem::size_of::<BgCnt>() - 2usize];
    ["Alignment of BgCnt"][::core::mem::align_of::<BgCnt>() - 1usize];
};
impl BgCnt {
    #[inline]
    pub fn priority(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_priority(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn priority_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                2u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_priority_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn charBaseBlock(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_charBaseBlock(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn charBaseBlock_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                2u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_charBaseBlock_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn dsCharBaseBlock(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_dsCharBaseBlock(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn dsCharBaseBlock_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                2u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_dsCharBaseBlock_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mosaic(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_mosaic(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mosaic_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_mosaic_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn palettes(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_palettes(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn palettes_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_palettes_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn screenBaseBlock(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_screenBaseBlock(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn screenBaseBlock_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                5u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_screenBaseBlock_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn areaOverflowMode(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_areaOverflowMode(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn areaOverflowMode_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_areaOverflowMode_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn screenSize(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_screenSize(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn screenSize_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                2u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_screenSize_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        priority: u16_,
        charBaseBlock: u16_,
        dsCharBaseBlock: u16_,
        mosaic: u16_,
        palettes: u16_,
        screenBaseBlock: u16_,
        areaOverflowMode: u16_,
        screenSize: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let priority: u16 = unsafe { ::core::mem::transmute(priority) };
            priority as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let charBaseBlock: u16 = unsafe { ::core::mem::transmute(charBaseBlock) };
            charBaseBlock as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let dsCharBaseBlock: u16 = unsafe { ::core::mem::transmute(dsCharBaseBlock) };
            dsCharBaseBlock as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let mosaic: u16 = unsafe { ::core::mem::transmute(mosaic) };
            mosaic as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let palettes: u16 = unsafe { ::core::mem::transmute(palettes) };
            palettes as u64
        });
        __bindgen_bitfield_unit.set(8usize, 5u8, {
            let screenBaseBlock: u16 = unsafe { ::core::mem::transmute(screenBaseBlock) };
            screenBaseBlock as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let areaOverflowMode: u16 = unsafe { ::core::mem::transmute(areaOverflowMode) };
            areaOverflowMode as u64
        });
        __bindgen_bitfield_unit.set(14usize, 2u8, {
            let screenSize: u16 = unsafe { ::core::mem::transmute(screenSize) };
            screenSize as u64
        });
        __bindgen_bitfield_unit
    }
}
pub type vBgCnt = BgCnt;
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct PlttData {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PlttData"][::core::mem::size_of::<PlttData>() - 2usize];
    ["Alignment of PlttData"][::core::mem::align_of::<PlttData>() - 2usize];
};
impl PlttData {
    #[inline]
    pub fn r(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_r(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn r_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                5u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_r_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn g(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_g(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn g_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                5u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_g_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn b(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_b(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn b_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                5u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_b_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn unused_15(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_unused_15(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn unused_15_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_unused_15_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        r: u16_,
        g: u16_,
        b: u16_,
        unused_15: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let r: u16 = unsafe { ::core::mem::transmute(r) };
            r as u64
        });
        __bindgen_bitfield_unit.set(5usize, 5u8, {
            let g: u16 = unsafe { ::core::mem::transmute(g) };
            g as u64
        });
        __bindgen_bitfield_unit.set(10usize, 5u8, {
            let b: u16 = unsafe { ::core::mem::transmute(b) };
            b as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let unused_15: u16 = unsafe { ::core::mem::transmute(unused_15) };
            unused_15 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct OamData {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 6usize]>,
    pub affineParam: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OamData"][::core::mem::size_of::<OamData>() - 8usize];
    ["Alignment of OamData"][::core::mem::align_of::<OamData>() - 4usize];
    ["Offset of field: OamData::affineParam"]
        [::core::mem::offset_of!(OamData, affineParam) - 6usize];
};
impl OamData {
    #[inline]
    pub fn y(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_y(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn y_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 6usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_y_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 6usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn affineMode(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_affineMode(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn affineMode_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 6usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_affineMode_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 6usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn objMode(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_objMode(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn objMode_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 6usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_objMode_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 6usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mosaic(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_mosaic(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mosaic_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 6usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_mosaic_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 6usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn bpp(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_bpp(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bpp_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 6usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_bpp_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 6usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn shape(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_shape(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn shape_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 6usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_shape_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 6usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn x(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 9u8) as u32) }
    }
    #[inline]
    pub fn set_x(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 9u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn x_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 6usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                9u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_x_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 6usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                9u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn matrixNum(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_matrixNum(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn matrixNum_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 6usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                25usize,
                5u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_matrixNum_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 6usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                25usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn size(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_size(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn size_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 6usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                30usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_size_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 6usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn tileNum(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(32usize, 10u8) as u16) }
    }
    #[inline]
    pub fn set_tileNum(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(32usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn tileNum_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 6usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                32usize,
                10u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_tileNum_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 6usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                32usize,
                10u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn priority(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(42usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_priority(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(42usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn priority_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 6usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                42usize,
                2u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_priority_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 6usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                42usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn paletteNum(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(44usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_paletteNum(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(44usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn paletteNum_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 6usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                44usize,
                4u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_paletteNum_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 6usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                44usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        y: u32_,
        affineMode: u32_,
        objMode: u32_,
        mosaic: u32_,
        bpp: u32_,
        shape: u32_,
        x: u32_,
        matrixNum: u32_,
        size: u32_,
        tileNum: u16_,
        priority: u16_,
        paletteNum: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 6usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 6usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let y: u32 = unsafe { ::core::mem::transmute(y) };
            y as u64
        });
        __bindgen_bitfield_unit.set(8usize, 2u8, {
            let affineMode: u32 = unsafe { ::core::mem::transmute(affineMode) };
            affineMode as u64
        });
        __bindgen_bitfield_unit.set(10usize, 2u8, {
            let objMode: u32 = unsafe { ::core::mem::transmute(objMode) };
            objMode as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let mosaic: u32 = unsafe { ::core::mem::transmute(mosaic) };
            mosaic as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let bpp: u32 = unsafe { ::core::mem::transmute(bpp) };
            bpp as u64
        });
        __bindgen_bitfield_unit.set(14usize, 2u8, {
            let shape: u32 = unsafe { ::core::mem::transmute(shape) };
            shape as u64
        });
        __bindgen_bitfield_unit.set(16usize, 9u8, {
            let x: u32 = unsafe { ::core::mem::transmute(x) };
            x as u64
        });
        __bindgen_bitfield_unit.set(25usize, 5u8, {
            let matrixNum: u32 = unsafe { ::core::mem::transmute(matrixNum) };
            matrixNum as u64
        });
        __bindgen_bitfield_unit.set(30usize, 2u8, {
            let size: u32 = unsafe { ::core::mem::transmute(size) };
            size as u64
        });
        __bindgen_bitfield_unit.set(32usize, 10u8, {
            let tileNum: u16 = unsafe { ::core::mem::transmute(tileNum) };
            tileNum as u64
        });
        __bindgen_bitfield_unit.set(42usize, 2u8, {
            let priority: u16 = unsafe { ::core::mem::transmute(priority) };
            priority as u64
        });
        __bindgen_bitfield_unit.set(44usize, 4u8, {
            let paletteNum: u16 = unsafe { ::core::mem::transmute(paletteNum) };
            paletteNum as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BgAffineSrcData {
    pub texX: s32,
    pub texY: s32,
    pub scrX: s16,
    pub scrY: s16,
    pub sx: s16,
    pub sy: s16,
    pub alpha: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BgAffineSrcData"][::core::mem::size_of::<BgAffineSrcData>() - 20usize];
    ["Alignment of BgAffineSrcData"][::core::mem::align_of::<BgAffineSrcData>() - 4usize];
    ["Offset of field: BgAffineSrcData::texX"]
        [::core::mem::offset_of!(BgAffineSrcData, texX) - 0usize];
    ["Offset of field: BgAffineSrcData::texY"]
        [::core::mem::offset_of!(BgAffineSrcData, texY) - 4usize];
    ["Offset of field: BgAffineSrcData::scrX"]
        [::core::mem::offset_of!(BgAffineSrcData, scrX) - 8usize];
    ["Offset of field: BgAffineSrcData::scrY"]
        [::core::mem::offset_of!(BgAffineSrcData, scrY) - 10usize];
    ["Offset of field: BgAffineSrcData::sx"]
        [::core::mem::offset_of!(BgAffineSrcData, sx) - 12usize];
    ["Offset of field: BgAffineSrcData::sy"]
        [::core::mem::offset_of!(BgAffineSrcData, sy) - 14usize];
    ["Offset of field: BgAffineSrcData::alpha"]
        [::core::mem::offset_of!(BgAffineSrcData, alpha) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BgAffineDstData {
    pub pa: s16,
    pub pb: s16,
    pub pc: s16,
    pub pd: s16,
    pub dx: s32,
    pub dy: s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BgAffineDstData"][::core::mem::size_of::<BgAffineDstData>() - 16usize];
    ["Alignment of BgAffineDstData"][::core::mem::align_of::<BgAffineDstData>() - 4usize];
    ["Offset of field: BgAffineDstData::pa"][::core::mem::offset_of!(BgAffineDstData, pa) - 0usize];
    ["Offset of field: BgAffineDstData::pb"][::core::mem::offset_of!(BgAffineDstData, pb) - 2usize];
    ["Offset of field: BgAffineDstData::pc"][::core::mem::offset_of!(BgAffineDstData, pc) - 4usize];
    ["Offset of field: BgAffineDstData::pd"][::core::mem::offset_of!(BgAffineDstData, pd) - 6usize];
    ["Offset of field: BgAffineDstData::dx"][::core::mem::offset_of!(BgAffineDstData, dx) - 8usize];
    ["Offset of field: BgAffineDstData::dy"]
        [::core::mem::offset_of!(BgAffineDstData, dy) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ObjAffineSrcData {
    pub xScale: s16,
    pub yScale: s16,
    pub rotation: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ObjAffineSrcData"][::core::mem::size_of::<ObjAffineSrcData>() - 6usize];
    ["Alignment of ObjAffineSrcData"][::core::mem::align_of::<ObjAffineSrcData>() - 2usize];
    ["Offset of field: ObjAffineSrcData::xScale"]
        [::core::mem::offset_of!(ObjAffineSrcData, xScale) - 0usize];
    ["Offset of field: ObjAffineSrcData::yScale"]
        [::core::mem::offset_of!(ObjAffineSrcData, yScale) - 2usize];
    ["Offset of field: ObjAffineSrcData::rotation"]
        [::core::mem::offset_of!(ObjAffineSrcData, rotation) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SioMultiCnt {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub data: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SioMultiCnt"][::core::mem::size_of::<SioMultiCnt>() - 4usize];
    ["Alignment of SioMultiCnt"][::core::mem::align_of::<SioMultiCnt>() - 2usize];
    ["Offset of field: SioMultiCnt::data"][::core::mem::offset_of!(SioMultiCnt, data) - 2usize];
};
impl SioMultiCnt {
    #[inline]
    pub fn baudRate(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_baudRate(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn baudRate_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                2u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_baudRate_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn si(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_si(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn si_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_si_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sd(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_sd(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sd_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_sd_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn id(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_id(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn id_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                2u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_id_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn error(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_error(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn error_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_error_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn enable(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_enable(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn enable_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_enable_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn unused_11_8(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u16) }
    }
    #[inline]
    pub fn set_unused_11_8(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn unused_11_8_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                4u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_unused_11_8_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mode(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_mode(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mode_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                2u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_mode_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn intrEnable(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_intrEnable(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn intrEnable_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_intrEnable_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn unused_15(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_unused_15(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn unused_15_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_unused_15_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        baudRate: u16_,
        si: u16_,
        sd: u16_,
        id: u16_,
        error: u16_,
        enable: u16_,
        unused_11_8: u16_,
        mode: u16_,
        intrEnable: u16_,
        unused_15: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let baudRate: u16 = unsafe { ::core::mem::transmute(baudRate) };
            baudRate as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let si: u16 = unsafe { ::core::mem::transmute(si) };
            si as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let sd: u16 = unsafe { ::core::mem::transmute(sd) };
            sd as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let id: u16 = unsafe { ::core::mem::transmute(id) };
            id as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let error: u16 = unsafe { ::core::mem::transmute(error) };
            error as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let enable: u16 = unsafe { ::core::mem::transmute(enable) };
            enable as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let unused_11_8: u16 = unsafe { ::core::mem::transmute(unused_11_8) };
            unused_11_8 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 2u8, {
            let mode: u16 = unsafe { ::core::mem::transmute(mode) };
            mode as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let intrEnable: u16 = unsafe { ::core::mem::transmute(intrEnable) };
            intrEnable as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let unused_15: u16 = unsafe { ::core::mem::transmute(unused_15) };
            unused_15 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MultiBootParam {
    pub system_work: [u32_; 5usize],
    pub handshake_data: u8_,
    pub handshake_timeout: u16_,
    pub probe_count: u8_,
    pub client_data: [u8_; 3usize],
    pub palette_data: u8_,
    pub response_bit: u8_,
    pub client_bit: u8_,
    pub reserved1: u8_,
    pub boot_srcp: *const u8_,
    pub boot_endp: *const u8_,
    pub masterp: *const u8_,
    pub reserved2: [*mut u8_; 3usize],
    pub system_work2: [u32_; 4usize],
    pub sendflag: u8_,
    pub probe_target_bit: u8_,
    pub check_wait: u8_,
    pub server_type: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MultiBootParam"][::core::mem::size_of::<MultiBootParam>() - 76usize];
    ["Alignment of MultiBootParam"][::core::mem::align_of::<MultiBootParam>() - 4usize];
    ["Offset of field: MultiBootParam::system_work"]
        [::core::mem::offset_of!(MultiBootParam, system_work) - 0usize];
    ["Offset of field: MultiBootParam::handshake_data"]
        [::core::mem::offset_of!(MultiBootParam, handshake_data) - 20usize];
    ["Offset of field: MultiBootParam::handshake_timeout"]
        [::core::mem::offset_of!(MultiBootParam, handshake_timeout) - 22usize];
    ["Offset of field: MultiBootParam::probe_count"]
        [::core::mem::offset_of!(MultiBootParam, probe_count) - 24usize];
    ["Offset of field: MultiBootParam::client_data"]
        [::core::mem::offset_of!(MultiBootParam, client_data) - 25usize];
    ["Offset of field: MultiBootParam::palette_data"]
        [::core::mem::offset_of!(MultiBootParam, palette_data) - 28usize];
    ["Offset of field: MultiBootParam::response_bit"]
        [::core::mem::offset_of!(MultiBootParam, response_bit) - 29usize];
    ["Offset of field: MultiBootParam::client_bit"]
        [::core::mem::offset_of!(MultiBootParam, client_bit) - 30usize];
    ["Offset of field: MultiBootParam::reserved1"]
        [::core::mem::offset_of!(MultiBootParam, reserved1) - 31usize];
    ["Offset of field: MultiBootParam::boot_srcp"]
        [::core::mem::offset_of!(MultiBootParam, boot_srcp) - 32usize];
    ["Offset of field: MultiBootParam::boot_endp"]
        [::core::mem::offset_of!(MultiBootParam, boot_endp) - 36usize];
    ["Offset of field: MultiBootParam::masterp"]
        [::core::mem::offset_of!(MultiBootParam, masterp) - 40usize];
    ["Offset of field: MultiBootParam::reserved2"]
        [::core::mem::offset_of!(MultiBootParam, reserved2) - 44usize];
    ["Offset of field: MultiBootParam::system_work2"]
        [::core::mem::offset_of!(MultiBootParam, system_work2) - 56usize];
    ["Offset of field: MultiBootParam::sendflag"]
        [::core::mem::offset_of!(MultiBootParam, sendflag) - 72usize];
    ["Offset of field: MultiBootParam::probe_target_bit"]
        [::core::mem::offset_of!(MultiBootParam, probe_target_bit) - 73usize];
    ["Offset of field: MultiBootParam::check_wait"]
        [::core::mem::offset_of!(MultiBootParam, check_wait) - 74usize];
    ["Offset of field: MultiBootParam::server_type"]
        [::core::mem::offset_of!(MultiBootParam, server_type) - 75usize];
};
unsafe extern "C" {
    pub fn SoftReset(resetFlags: u32_);
}
unsafe extern "C" {
    pub fn RegisterRamReset(resetFlags: u32_);
}
unsafe extern "C" {
    pub fn VBlankIntrWait();
}
unsafe extern "C" {
    pub fn Sqrt(num: u32_) -> u16_;
}
unsafe extern "C" {
    pub fn ArcTan2(x: s16, y: s16) -> u16_;
}
unsafe extern "C" {
    pub fn CpuSet(src: *const ::core::ffi::c_void, dest: *mut ::core::ffi::c_void, control: u32_);
}
unsafe extern "C" {
    pub fn CpuFastSet(
        src: *const ::core::ffi::c_void,
        dest: *mut ::core::ffi::c_void,
        control: u32_,
    );
}
unsafe extern "C" {
    pub fn BgAffineSet(src: *mut BgAffineSrcData, dest: *mut BgAffineDstData, count: s32);
}
unsafe extern "C" {
    pub fn ObjAffineSet(
        src: *mut ObjAffineSrcData,
        dest: *mut ::core::ffi::c_void,
        count: s32,
        offset: s32,
    );
}
unsafe extern "C" {
    pub fn LZ77UnCompWram(src: *const u32_, dest: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn LZ77UnCompVram(src: *const u32_, dest: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn RLUnCompWram(src: *const ::core::ffi::c_void, dest: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn RLUnCompVram(src: *const ::core::ffi::c_void, dest: *mut ::core::ffi::c_void);
}
unsafe extern "C" {
    pub fn MultiBoot(mp: *mut MultiBootParam) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub fn Div(num: s32, denom: s32) -> s32;
}
unsafe extern "C" {
    pub fn MgbaOpen() -> bool32;
}
unsafe extern "C" {
    pub fn MgbaClose();
}
unsafe extern "C" {
    pub fn MgbaPrintf(level: s32, pBuf: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    pub fn MgbaAssert(
        pFile: *const ::core::ffi::c_char,
        nLine: s32,
        pExpression: *const ::core::ffi::c_char,
        nStopProgram: bool32,
    );
}
unsafe extern "C" {
    pub fn NoCashGBAPrintf(pBuf: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    pub fn NoCashGBAAssert(
        pFile: *const ::core::ffi::c_char,
        nLine: s32,
        pExpression: *const ::core::ffi::c_char,
        nStopProgram: bool32,
    );
}
unsafe extern "C" {
    pub fn AGBPrintf(pBuf: *const ::core::ffi::c_char, ...);
}
unsafe extern "C" {
    pub fn AGBAssert(
        pFile: *const ::core::ffi::c_char,
        nLine: ::core::ffi::c_int,
        pExpression: *const ::core::ffi::c_char,
        nStopProgram: ::core::ffi::c_int,
    );
}
unsafe extern "C" {
    pub fn AGBPrintInit();
}
pub type q4_12_t = s16;
pub type uq4_12_t = u32_;
pub const REMATCH_ROSE: _bindgen_ty_1 = 0;
pub const REMATCH_ANDRES: _bindgen_ty_1 = 1;
pub const REMATCH_DUSTY: _bindgen_ty_1 = 2;
pub const REMATCH_LOLA: _bindgen_ty_1 = 3;
pub const REMATCH_RICKY: _bindgen_ty_1 = 4;
pub const REMATCH_LILA_AND_ROY: _bindgen_ty_1 = 5;
pub const REMATCH_CRISTIN: _bindgen_ty_1 = 6;
pub const REMATCH_BROOKE: _bindgen_ty_1 = 7;
pub const REMATCH_WILTON: _bindgen_ty_1 = 8;
pub const REMATCH_VALERIE: _bindgen_ty_1 = 9;
pub const REMATCH_CINDY: _bindgen_ty_1 = 10;
pub const REMATCH_THALIA: _bindgen_ty_1 = 11;
pub const REMATCH_JESSICA: _bindgen_ty_1 = 12;
pub const REMATCH_WINSTON: _bindgen_ty_1 = 13;
pub const REMATCH_STEVE: _bindgen_ty_1 = 14;
pub const REMATCH_TONY: _bindgen_ty_1 = 15;
pub const REMATCH_NOB: _bindgen_ty_1 = 16;
pub const REMATCH_KOJI: _bindgen_ty_1 = 17;
pub const REMATCH_FERNANDO: _bindgen_ty_1 = 18;
pub const REMATCH_DALTON: _bindgen_ty_1 = 19;
pub const REMATCH_BERNIE: _bindgen_ty_1 = 20;
pub const REMATCH_ETHAN: _bindgen_ty_1 = 21;
pub const REMATCH_JOHN_AND_JAY: _bindgen_ty_1 = 22;
pub const REMATCH_JEFFREY: _bindgen_ty_1 = 23;
pub const REMATCH_CAMERON: _bindgen_ty_1 = 24;
pub const REMATCH_JACKI: _bindgen_ty_1 = 25;
pub const REMATCH_WALTER: _bindgen_ty_1 = 26;
pub const REMATCH_KAREN: _bindgen_ty_1 = 27;
pub const REMATCH_JERRY: _bindgen_ty_1 = 28;
pub const REMATCH_ANNA_AND_MEG: _bindgen_ty_1 = 29;
pub const REMATCH_ISABEL: _bindgen_ty_1 = 30;
pub const REMATCH_MIGUEL: _bindgen_ty_1 = 31;
pub const REMATCH_TIMOTHY: _bindgen_ty_1 = 32;
pub const REMATCH_SHELBY: _bindgen_ty_1 = 33;
pub const REMATCH_CALVIN: _bindgen_ty_1 = 34;
pub const REMATCH_ELLIOT: _bindgen_ty_1 = 35;
pub const REMATCH_ISAIAH: _bindgen_ty_1 = 36;
pub const REMATCH_MARIA: _bindgen_ty_1 = 37;
pub const REMATCH_ABIGAIL: _bindgen_ty_1 = 38;
pub const REMATCH_DYLAN: _bindgen_ty_1 = 39;
pub const REMATCH_KATELYN: _bindgen_ty_1 = 40;
pub const REMATCH_BENJAMIN: _bindgen_ty_1 = 41;
pub const REMATCH_PABLO: _bindgen_ty_1 = 42;
pub const REMATCH_NICOLAS: _bindgen_ty_1 = 43;
pub const REMATCH_ROBERT: _bindgen_ty_1 = 44;
pub const REMATCH_LAO: _bindgen_ty_1 = 45;
pub const REMATCH_CYNDY: _bindgen_ty_1 = 46;
pub const REMATCH_MADELINE: _bindgen_ty_1 = 47;
pub const REMATCH_JENNY: _bindgen_ty_1 = 48;
pub const REMATCH_DIANA: _bindgen_ty_1 = 49;
pub const REMATCH_AMY_AND_LIV: _bindgen_ty_1 = 50;
pub const REMATCH_ERNEST: _bindgen_ty_1 = 51;
pub const REMATCH_CORY: _bindgen_ty_1 = 52;
pub const REMATCH_EDWIN: _bindgen_ty_1 = 53;
pub const REMATCH_LYDIA: _bindgen_ty_1 = 54;
pub const REMATCH_ISAAC: _bindgen_ty_1 = 55;
pub const REMATCH_GABRIELLE: _bindgen_ty_1 = 56;
pub const REMATCH_CATHERINE: _bindgen_ty_1 = 57;
pub const REMATCH_JACKSON: _bindgen_ty_1 = 58;
pub const REMATCH_HALEY: _bindgen_ty_1 = 59;
pub const REMATCH_JAMES: _bindgen_ty_1 = 60;
pub const REMATCH_TRENT: _bindgen_ty_1 = 61;
pub const REMATCH_SAWYER: _bindgen_ty_1 = 62;
pub const REMATCH_KIRA_AND_DAN: _bindgen_ty_1 = 63;
pub const REMATCH_WALLY_VR: _bindgen_ty_1 = 64;
pub const REMATCH_ROXANNE: _bindgen_ty_1 = 65;
pub const REMATCH_BRAWLY: _bindgen_ty_1 = 66;
pub const REMATCH_WATTSON: _bindgen_ty_1 = 67;
pub const REMATCH_FLANNERY: _bindgen_ty_1 = 68;
pub const REMATCH_NORMAN: _bindgen_ty_1 = 69;
pub const REMATCH_WINONA: _bindgen_ty_1 = 70;
pub const REMATCH_TATE_AND_LIZA: _bindgen_ty_1 = 71;
pub const REMATCH_JUAN: _bindgen_ty_1 = 72;
pub const REMATCH_SIDNEY: _bindgen_ty_1 = 73;
pub const REMATCH_PHOEBE: _bindgen_ty_1 = 74;
pub const REMATCH_GLACIA: _bindgen_ty_1 = 75;
pub const REMATCH_DRAKE: _bindgen_ty_1 = 76;
pub const REMATCH_WALLACE: _bindgen_ty_1 = 77;
pub const REMATCH_TABLE_ENTRIES: _bindgen_ty_1 = 78;
pub type _bindgen_ty_1 = ::core::ffi::c_uint;
pub const NATIONAL_DEX_NONE: _bindgen_ty_2 = 0;
pub const NATIONAL_DEX_BULBASAUR: _bindgen_ty_2 = 1;
pub const NATIONAL_DEX_IVYSAUR: _bindgen_ty_2 = 2;
pub const NATIONAL_DEX_VENUSAUR: _bindgen_ty_2 = 3;
pub const NATIONAL_DEX_CHARMANDER: _bindgen_ty_2 = 4;
pub const NATIONAL_DEX_CHARMELEON: _bindgen_ty_2 = 5;
pub const NATIONAL_DEX_CHARIZARD: _bindgen_ty_2 = 6;
pub const NATIONAL_DEX_SQUIRTLE: _bindgen_ty_2 = 7;
pub const NATIONAL_DEX_WARTORTLE: _bindgen_ty_2 = 8;
pub const NATIONAL_DEX_BLASTOISE: _bindgen_ty_2 = 9;
pub const NATIONAL_DEX_CATERPIE: _bindgen_ty_2 = 10;
pub const NATIONAL_DEX_METAPOD: _bindgen_ty_2 = 11;
pub const NATIONAL_DEX_BUTTERFREE: _bindgen_ty_2 = 12;
pub const NATIONAL_DEX_WEEDLE: _bindgen_ty_2 = 13;
pub const NATIONAL_DEX_KAKUNA: _bindgen_ty_2 = 14;
pub const NATIONAL_DEX_BEEDRILL: _bindgen_ty_2 = 15;
pub const NATIONAL_DEX_PIDGEY: _bindgen_ty_2 = 16;
pub const NATIONAL_DEX_PIDGEOTTO: _bindgen_ty_2 = 17;
pub const NATIONAL_DEX_PIDGEOT: _bindgen_ty_2 = 18;
pub const NATIONAL_DEX_RATTATA: _bindgen_ty_2 = 19;
pub const NATIONAL_DEX_RATICATE: _bindgen_ty_2 = 20;
pub const NATIONAL_DEX_SPEAROW: _bindgen_ty_2 = 21;
pub const NATIONAL_DEX_FEAROW: _bindgen_ty_2 = 22;
pub const NATIONAL_DEX_EKANS: _bindgen_ty_2 = 23;
pub const NATIONAL_DEX_ARBOK: _bindgen_ty_2 = 24;
pub const NATIONAL_DEX_PIKACHU: _bindgen_ty_2 = 25;
pub const NATIONAL_DEX_RAICHU: _bindgen_ty_2 = 26;
pub const NATIONAL_DEX_SANDSHREW: _bindgen_ty_2 = 27;
pub const NATIONAL_DEX_SANDSLASH: _bindgen_ty_2 = 28;
pub const NATIONAL_DEX_NIDORAN_F: _bindgen_ty_2 = 29;
pub const NATIONAL_DEX_NIDORINA: _bindgen_ty_2 = 30;
pub const NATIONAL_DEX_NIDOQUEEN: _bindgen_ty_2 = 31;
pub const NATIONAL_DEX_NIDORAN_M: _bindgen_ty_2 = 32;
pub const NATIONAL_DEX_NIDORINO: _bindgen_ty_2 = 33;
pub const NATIONAL_DEX_NIDOKING: _bindgen_ty_2 = 34;
pub const NATIONAL_DEX_CLEFAIRY: _bindgen_ty_2 = 35;
pub const NATIONAL_DEX_CLEFABLE: _bindgen_ty_2 = 36;
pub const NATIONAL_DEX_VULPIX: _bindgen_ty_2 = 37;
pub const NATIONAL_DEX_NINETALES: _bindgen_ty_2 = 38;
pub const NATIONAL_DEX_JIGGLYPUFF: _bindgen_ty_2 = 39;
pub const NATIONAL_DEX_WIGGLYTUFF: _bindgen_ty_2 = 40;
pub const NATIONAL_DEX_ZUBAT: _bindgen_ty_2 = 41;
pub const NATIONAL_DEX_GOLBAT: _bindgen_ty_2 = 42;
pub const NATIONAL_DEX_ODDISH: _bindgen_ty_2 = 43;
pub const NATIONAL_DEX_GLOOM: _bindgen_ty_2 = 44;
pub const NATIONAL_DEX_VILEPLUME: _bindgen_ty_2 = 45;
pub const NATIONAL_DEX_PARAS: _bindgen_ty_2 = 46;
pub const NATIONAL_DEX_PARASECT: _bindgen_ty_2 = 47;
pub const NATIONAL_DEX_VENONAT: _bindgen_ty_2 = 48;
pub const NATIONAL_DEX_VENOMOTH: _bindgen_ty_2 = 49;
pub const NATIONAL_DEX_DIGLETT: _bindgen_ty_2 = 50;
pub const NATIONAL_DEX_DUGTRIO: _bindgen_ty_2 = 51;
pub const NATIONAL_DEX_MEOWTH: _bindgen_ty_2 = 52;
pub const NATIONAL_DEX_PERSIAN: _bindgen_ty_2 = 53;
pub const NATIONAL_DEX_PSYDUCK: _bindgen_ty_2 = 54;
pub const NATIONAL_DEX_GOLDUCK: _bindgen_ty_2 = 55;
pub const NATIONAL_DEX_MANKEY: _bindgen_ty_2 = 56;
pub const NATIONAL_DEX_PRIMEAPE: _bindgen_ty_2 = 57;
pub const NATIONAL_DEX_GROWLITHE: _bindgen_ty_2 = 58;
pub const NATIONAL_DEX_ARCANINE: _bindgen_ty_2 = 59;
pub const NATIONAL_DEX_POLIWAG: _bindgen_ty_2 = 60;
pub const NATIONAL_DEX_POLIWHIRL: _bindgen_ty_2 = 61;
pub const NATIONAL_DEX_POLIWRATH: _bindgen_ty_2 = 62;
pub const NATIONAL_DEX_ABRA: _bindgen_ty_2 = 63;
pub const NATIONAL_DEX_KADABRA: _bindgen_ty_2 = 64;
pub const NATIONAL_DEX_ALAKAZAM: _bindgen_ty_2 = 65;
pub const NATIONAL_DEX_MACHOP: _bindgen_ty_2 = 66;
pub const NATIONAL_DEX_MACHOKE: _bindgen_ty_2 = 67;
pub const NATIONAL_DEX_MACHAMP: _bindgen_ty_2 = 68;
pub const NATIONAL_DEX_BELLSPROUT: _bindgen_ty_2 = 69;
pub const NATIONAL_DEX_WEEPINBELL: _bindgen_ty_2 = 70;
pub const NATIONAL_DEX_VICTREEBEL: _bindgen_ty_2 = 71;
pub const NATIONAL_DEX_TENTACOOL: _bindgen_ty_2 = 72;
pub const NATIONAL_DEX_TENTACRUEL: _bindgen_ty_2 = 73;
pub const NATIONAL_DEX_GEODUDE: _bindgen_ty_2 = 74;
pub const NATIONAL_DEX_GRAVELER: _bindgen_ty_2 = 75;
pub const NATIONAL_DEX_GOLEM: _bindgen_ty_2 = 76;
pub const NATIONAL_DEX_PONYTA: _bindgen_ty_2 = 77;
pub const NATIONAL_DEX_RAPIDASH: _bindgen_ty_2 = 78;
pub const NATIONAL_DEX_SLOWPOKE: _bindgen_ty_2 = 79;
pub const NATIONAL_DEX_SLOWBRO: _bindgen_ty_2 = 80;
pub const NATIONAL_DEX_MAGNEMITE: _bindgen_ty_2 = 81;
pub const NATIONAL_DEX_MAGNETON: _bindgen_ty_2 = 82;
pub const NATIONAL_DEX_FARFETCHD: _bindgen_ty_2 = 83;
pub const NATIONAL_DEX_DODUO: _bindgen_ty_2 = 84;
pub const NATIONAL_DEX_DODRIO: _bindgen_ty_2 = 85;
pub const NATIONAL_DEX_SEEL: _bindgen_ty_2 = 86;
pub const NATIONAL_DEX_DEWGONG: _bindgen_ty_2 = 87;
pub const NATIONAL_DEX_GRIMER: _bindgen_ty_2 = 88;
pub const NATIONAL_DEX_MUK: _bindgen_ty_2 = 89;
pub const NATIONAL_DEX_SHELLDER: _bindgen_ty_2 = 90;
pub const NATIONAL_DEX_CLOYSTER: _bindgen_ty_2 = 91;
pub const NATIONAL_DEX_GASTLY: _bindgen_ty_2 = 92;
pub const NATIONAL_DEX_HAUNTER: _bindgen_ty_2 = 93;
pub const NATIONAL_DEX_GENGAR: _bindgen_ty_2 = 94;
pub const NATIONAL_DEX_ONIX: _bindgen_ty_2 = 95;
pub const NATIONAL_DEX_DROWZEE: _bindgen_ty_2 = 96;
pub const NATIONAL_DEX_HYPNO: _bindgen_ty_2 = 97;
pub const NATIONAL_DEX_KRABBY: _bindgen_ty_2 = 98;
pub const NATIONAL_DEX_KINGLER: _bindgen_ty_2 = 99;
pub const NATIONAL_DEX_VOLTORB: _bindgen_ty_2 = 100;
pub const NATIONAL_DEX_ELECTRODE: _bindgen_ty_2 = 101;
pub const NATIONAL_DEX_EXEGGCUTE: _bindgen_ty_2 = 102;
pub const NATIONAL_DEX_EXEGGUTOR: _bindgen_ty_2 = 103;
pub const NATIONAL_DEX_CUBONE: _bindgen_ty_2 = 104;
pub const NATIONAL_DEX_MAROWAK: _bindgen_ty_2 = 105;
pub const NATIONAL_DEX_HITMONLEE: _bindgen_ty_2 = 106;
pub const NATIONAL_DEX_HITMONCHAN: _bindgen_ty_2 = 107;
pub const NATIONAL_DEX_LICKITUNG: _bindgen_ty_2 = 108;
pub const NATIONAL_DEX_KOFFING: _bindgen_ty_2 = 109;
pub const NATIONAL_DEX_WEEZING: _bindgen_ty_2 = 110;
pub const NATIONAL_DEX_RHYHORN: _bindgen_ty_2 = 111;
pub const NATIONAL_DEX_RHYDON: _bindgen_ty_2 = 112;
pub const NATIONAL_DEX_CHANSEY: _bindgen_ty_2 = 113;
pub const NATIONAL_DEX_TANGELA: _bindgen_ty_2 = 114;
pub const NATIONAL_DEX_KANGASKHAN: _bindgen_ty_2 = 115;
pub const NATIONAL_DEX_HORSEA: _bindgen_ty_2 = 116;
pub const NATIONAL_DEX_SEADRA: _bindgen_ty_2 = 117;
pub const NATIONAL_DEX_GOLDEEN: _bindgen_ty_2 = 118;
pub const NATIONAL_DEX_SEAKING: _bindgen_ty_2 = 119;
pub const NATIONAL_DEX_STARYU: _bindgen_ty_2 = 120;
pub const NATIONAL_DEX_STARMIE: _bindgen_ty_2 = 121;
pub const NATIONAL_DEX_MR_MIME: _bindgen_ty_2 = 122;
pub const NATIONAL_DEX_SCYTHER: _bindgen_ty_2 = 123;
pub const NATIONAL_DEX_JYNX: _bindgen_ty_2 = 124;
pub const NATIONAL_DEX_ELECTABUZZ: _bindgen_ty_2 = 125;
pub const NATIONAL_DEX_MAGMAR: _bindgen_ty_2 = 126;
pub const NATIONAL_DEX_PINSIR: _bindgen_ty_2 = 127;
pub const NATIONAL_DEX_TAUROS: _bindgen_ty_2 = 128;
pub const NATIONAL_DEX_MAGIKARP: _bindgen_ty_2 = 129;
pub const NATIONAL_DEX_GYARADOS: _bindgen_ty_2 = 130;
pub const NATIONAL_DEX_LAPRAS: _bindgen_ty_2 = 131;
pub const NATIONAL_DEX_DITTO: _bindgen_ty_2 = 132;
pub const NATIONAL_DEX_EEVEE: _bindgen_ty_2 = 133;
pub const NATIONAL_DEX_VAPOREON: _bindgen_ty_2 = 134;
pub const NATIONAL_DEX_JOLTEON: _bindgen_ty_2 = 135;
pub const NATIONAL_DEX_FLAREON: _bindgen_ty_2 = 136;
pub const NATIONAL_DEX_PORYGON: _bindgen_ty_2 = 137;
pub const NATIONAL_DEX_OMANYTE: _bindgen_ty_2 = 138;
pub const NATIONAL_DEX_OMASTAR: _bindgen_ty_2 = 139;
pub const NATIONAL_DEX_KABUTO: _bindgen_ty_2 = 140;
pub const NATIONAL_DEX_KABUTOPS: _bindgen_ty_2 = 141;
pub const NATIONAL_DEX_AERODACTYL: _bindgen_ty_2 = 142;
pub const NATIONAL_DEX_SNORLAX: _bindgen_ty_2 = 143;
pub const NATIONAL_DEX_ARTICUNO: _bindgen_ty_2 = 144;
pub const NATIONAL_DEX_ZAPDOS: _bindgen_ty_2 = 145;
pub const NATIONAL_DEX_MOLTRES: _bindgen_ty_2 = 146;
pub const NATIONAL_DEX_DRATINI: _bindgen_ty_2 = 147;
pub const NATIONAL_DEX_DRAGONAIR: _bindgen_ty_2 = 148;
pub const NATIONAL_DEX_DRAGONITE: _bindgen_ty_2 = 149;
pub const NATIONAL_DEX_MEWTWO: _bindgen_ty_2 = 150;
pub const NATIONAL_DEX_MEW: _bindgen_ty_2 = 151;
pub const NATIONAL_DEX_CHIKORITA: _bindgen_ty_2 = 152;
pub const NATIONAL_DEX_BAYLEEF: _bindgen_ty_2 = 153;
pub const NATIONAL_DEX_MEGANIUM: _bindgen_ty_2 = 154;
pub const NATIONAL_DEX_CYNDAQUIL: _bindgen_ty_2 = 155;
pub const NATIONAL_DEX_QUILAVA: _bindgen_ty_2 = 156;
pub const NATIONAL_DEX_TYPHLOSION: _bindgen_ty_2 = 157;
pub const NATIONAL_DEX_TOTODILE: _bindgen_ty_2 = 158;
pub const NATIONAL_DEX_CROCONAW: _bindgen_ty_2 = 159;
pub const NATIONAL_DEX_FERALIGATR: _bindgen_ty_2 = 160;
pub const NATIONAL_DEX_SENTRET: _bindgen_ty_2 = 161;
pub const NATIONAL_DEX_FURRET: _bindgen_ty_2 = 162;
pub const NATIONAL_DEX_HOOTHOOT: _bindgen_ty_2 = 163;
pub const NATIONAL_DEX_NOCTOWL: _bindgen_ty_2 = 164;
pub const NATIONAL_DEX_LEDYBA: _bindgen_ty_2 = 165;
pub const NATIONAL_DEX_LEDIAN: _bindgen_ty_2 = 166;
pub const NATIONAL_DEX_SPINARAK: _bindgen_ty_2 = 167;
pub const NATIONAL_DEX_ARIADOS: _bindgen_ty_2 = 168;
pub const NATIONAL_DEX_CROBAT: _bindgen_ty_2 = 169;
pub const NATIONAL_DEX_CHINCHOU: _bindgen_ty_2 = 170;
pub const NATIONAL_DEX_LANTURN: _bindgen_ty_2 = 171;
pub const NATIONAL_DEX_PICHU: _bindgen_ty_2 = 172;
pub const NATIONAL_DEX_CLEFFA: _bindgen_ty_2 = 173;
pub const NATIONAL_DEX_IGGLYBUFF: _bindgen_ty_2 = 174;
pub const NATIONAL_DEX_TOGEPI: _bindgen_ty_2 = 175;
pub const NATIONAL_DEX_TOGETIC: _bindgen_ty_2 = 176;
pub const NATIONAL_DEX_NATU: _bindgen_ty_2 = 177;
pub const NATIONAL_DEX_XATU: _bindgen_ty_2 = 178;
pub const NATIONAL_DEX_MAREEP: _bindgen_ty_2 = 179;
pub const NATIONAL_DEX_FLAAFFY: _bindgen_ty_2 = 180;
pub const NATIONAL_DEX_AMPHAROS: _bindgen_ty_2 = 181;
pub const NATIONAL_DEX_BELLOSSOM: _bindgen_ty_2 = 182;
pub const NATIONAL_DEX_MARILL: _bindgen_ty_2 = 183;
pub const NATIONAL_DEX_AZUMARILL: _bindgen_ty_2 = 184;
pub const NATIONAL_DEX_SUDOWOODO: _bindgen_ty_2 = 185;
pub const NATIONAL_DEX_POLITOED: _bindgen_ty_2 = 186;
pub const NATIONAL_DEX_HOPPIP: _bindgen_ty_2 = 187;
pub const NATIONAL_DEX_SKIPLOOM: _bindgen_ty_2 = 188;
pub const NATIONAL_DEX_JUMPLUFF: _bindgen_ty_2 = 189;
pub const NATIONAL_DEX_AIPOM: _bindgen_ty_2 = 190;
pub const NATIONAL_DEX_SUNKERN: _bindgen_ty_2 = 191;
pub const NATIONAL_DEX_SUNFLORA: _bindgen_ty_2 = 192;
pub const NATIONAL_DEX_YANMA: _bindgen_ty_2 = 193;
pub const NATIONAL_DEX_WOOPER: _bindgen_ty_2 = 194;
pub const NATIONAL_DEX_QUAGSIRE: _bindgen_ty_2 = 195;
pub const NATIONAL_DEX_ESPEON: _bindgen_ty_2 = 196;
pub const NATIONAL_DEX_UMBREON: _bindgen_ty_2 = 197;
pub const NATIONAL_DEX_MURKROW: _bindgen_ty_2 = 198;
pub const NATIONAL_DEX_SLOWKING: _bindgen_ty_2 = 199;
pub const NATIONAL_DEX_MISDREAVUS: _bindgen_ty_2 = 200;
pub const NATIONAL_DEX_UNOWN: _bindgen_ty_2 = 201;
pub const NATIONAL_DEX_WOBBUFFET: _bindgen_ty_2 = 202;
pub const NATIONAL_DEX_GIRAFARIG: _bindgen_ty_2 = 203;
pub const NATIONAL_DEX_PINECO: _bindgen_ty_2 = 204;
pub const NATIONAL_DEX_FORRETRESS: _bindgen_ty_2 = 205;
pub const NATIONAL_DEX_DUNSPARCE: _bindgen_ty_2 = 206;
pub const NATIONAL_DEX_GLIGAR: _bindgen_ty_2 = 207;
pub const NATIONAL_DEX_STEELIX: _bindgen_ty_2 = 208;
pub const NATIONAL_DEX_SNUBBULL: _bindgen_ty_2 = 209;
pub const NATIONAL_DEX_GRANBULL: _bindgen_ty_2 = 210;
pub const NATIONAL_DEX_QWILFISH: _bindgen_ty_2 = 211;
pub const NATIONAL_DEX_SCIZOR: _bindgen_ty_2 = 212;
pub const NATIONAL_DEX_SHUCKLE: _bindgen_ty_2 = 213;
pub const NATIONAL_DEX_HERACROSS: _bindgen_ty_2 = 214;
pub const NATIONAL_DEX_SNEASEL: _bindgen_ty_2 = 215;
pub const NATIONAL_DEX_TEDDIURSA: _bindgen_ty_2 = 216;
pub const NATIONAL_DEX_URSARING: _bindgen_ty_2 = 217;
pub const NATIONAL_DEX_SLUGMA: _bindgen_ty_2 = 218;
pub const NATIONAL_DEX_MAGCARGO: _bindgen_ty_2 = 219;
pub const NATIONAL_DEX_SWINUB: _bindgen_ty_2 = 220;
pub const NATIONAL_DEX_PILOSWINE: _bindgen_ty_2 = 221;
pub const NATIONAL_DEX_CORSOLA: _bindgen_ty_2 = 222;
pub const NATIONAL_DEX_REMORAID: _bindgen_ty_2 = 223;
pub const NATIONAL_DEX_OCTILLERY: _bindgen_ty_2 = 224;
pub const NATIONAL_DEX_DELIBIRD: _bindgen_ty_2 = 225;
pub const NATIONAL_DEX_MANTINE: _bindgen_ty_2 = 226;
pub const NATIONAL_DEX_SKARMORY: _bindgen_ty_2 = 227;
pub const NATIONAL_DEX_HOUNDOUR: _bindgen_ty_2 = 228;
pub const NATIONAL_DEX_HOUNDOOM: _bindgen_ty_2 = 229;
pub const NATIONAL_DEX_KINGDRA: _bindgen_ty_2 = 230;
pub const NATIONAL_DEX_PHANPY: _bindgen_ty_2 = 231;
pub const NATIONAL_DEX_DONPHAN: _bindgen_ty_2 = 232;
pub const NATIONAL_DEX_PORYGON2: _bindgen_ty_2 = 233;
pub const NATIONAL_DEX_STANTLER: _bindgen_ty_2 = 234;
pub const NATIONAL_DEX_SMEARGLE: _bindgen_ty_2 = 235;
pub const NATIONAL_DEX_TYROGUE: _bindgen_ty_2 = 236;
pub const NATIONAL_DEX_HITMONTOP: _bindgen_ty_2 = 237;
pub const NATIONAL_DEX_SMOOCHUM: _bindgen_ty_2 = 238;
pub const NATIONAL_DEX_ELEKID: _bindgen_ty_2 = 239;
pub const NATIONAL_DEX_MAGBY: _bindgen_ty_2 = 240;
pub const NATIONAL_DEX_MILTANK: _bindgen_ty_2 = 241;
pub const NATIONAL_DEX_BLISSEY: _bindgen_ty_2 = 242;
pub const NATIONAL_DEX_RAIKOU: _bindgen_ty_2 = 243;
pub const NATIONAL_DEX_ENTEI: _bindgen_ty_2 = 244;
pub const NATIONAL_DEX_SUICUNE: _bindgen_ty_2 = 245;
pub const NATIONAL_DEX_LARVITAR: _bindgen_ty_2 = 246;
pub const NATIONAL_DEX_PUPITAR: _bindgen_ty_2 = 247;
pub const NATIONAL_DEX_TYRANITAR: _bindgen_ty_2 = 248;
pub const NATIONAL_DEX_LUGIA: _bindgen_ty_2 = 249;
pub const NATIONAL_DEX_HO_OH: _bindgen_ty_2 = 250;
pub const NATIONAL_DEX_CELEBI: _bindgen_ty_2 = 251;
pub const NATIONAL_DEX_TREECKO: _bindgen_ty_2 = 252;
pub const NATIONAL_DEX_GROVYLE: _bindgen_ty_2 = 253;
pub const NATIONAL_DEX_SCEPTILE: _bindgen_ty_2 = 254;
pub const NATIONAL_DEX_TORCHIC: _bindgen_ty_2 = 255;
pub const NATIONAL_DEX_COMBUSKEN: _bindgen_ty_2 = 256;
pub const NATIONAL_DEX_BLAZIKEN: _bindgen_ty_2 = 257;
pub const NATIONAL_DEX_MUDKIP: _bindgen_ty_2 = 258;
pub const NATIONAL_DEX_MARSHTOMP: _bindgen_ty_2 = 259;
pub const NATIONAL_DEX_SWAMPERT: _bindgen_ty_2 = 260;
pub const NATIONAL_DEX_POOCHYENA: _bindgen_ty_2 = 261;
pub const NATIONAL_DEX_MIGHTYENA: _bindgen_ty_2 = 262;
pub const NATIONAL_DEX_ZIGZAGOON: _bindgen_ty_2 = 263;
pub const NATIONAL_DEX_LINOONE: _bindgen_ty_2 = 264;
pub const NATIONAL_DEX_WURMPLE: _bindgen_ty_2 = 265;
pub const NATIONAL_DEX_SILCOON: _bindgen_ty_2 = 266;
pub const NATIONAL_DEX_BEAUTIFLY: _bindgen_ty_2 = 267;
pub const NATIONAL_DEX_CASCOON: _bindgen_ty_2 = 268;
pub const NATIONAL_DEX_DUSTOX: _bindgen_ty_2 = 269;
pub const NATIONAL_DEX_LOTAD: _bindgen_ty_2 = 270;
pub const NATIONAL_DEX_LOMBRE: _bindgen_ty_2 = 271;
pub const NATIONAL_DEX_LUDICOLO: _bindgen_ty_2 = 272;
pub const NATIONAL_DEX_SEEDOT: _bindgen_ty_2 = 273;
pub const NATIONAL_DEX_NUZLEAF: _bindgen_ty_2 = 274;
pub const NATIONAL_DEX_SHIFTRY: _bindgen_ty_2 = 275;
pub const NATIONAL_DEX_TAILLOW: _bindgen_ty_2 = 276;
pub const NATIONAL_DEX_SWELLOW: _bindgen_ty_2 = 277;
pub const NATIONAL_DEX_WINGULL: _bindgen_ty_2 = 278;
pub const NATIONAL_DEX_PELIPPER: _bindgen_ty_2 = 279;
pub const NATIONAL_DEX_RALTS: _bindgen_ty_2 = 280;
pub const NATIONAL_DEX_KIRLIA: _bindgen_ty_2 = 281;
pub const NATIONAL_DEX_GARDEVOIR: _bindgen_ty_2 = 282;
pub const NATIONAL_DEX_SURSKIT: _bindgen_ty_2 = 283;
pub const NATIONAL_DEX_MASQUERAIN: _bindgen_ty_2 = 284;
pub const NATIONAL_DEX_SHROOMISH: _bindgen_ty_2 = 285;
pub const NATIONAL_DEX_BRELOOM: _bindgen_ty_2 = 286;
pub const NATIONAL_DEX_SLAKOTH: _bindgen_ty_2 = 287;
pub const NATIONAL_DEX_VIGOROTH: _bindgen_ty_2 = 288;
pub const NATIONAL_DEX_SLAKING: _bindgen_ty_2 = 289;
pub const NATIONAL_DEX_NINCADA: _bindgen_ty_2 = 290;
pub const NATIONAL_DEX_NINJASK: _bindgen_ty_2 = 291;
pub const NATIONAL_DEX_SHEDINJA: _bindgen_ty_2 = 292;
pub const NATIONAL_DEX_WHISMUR: _bindgen_ty_2 = 293;
pub const NATIONAL_DEX_LOUDRED: _bindgen_ty_2 = 294;
pub const NATIONAL_DEX_EXPLOUD: _bindgen_ty_2 = 295;
pub const NATIONAL_DEX_MAKUHITA: _bindgen_ty_2 = 296;
pub const NATIONAL_DEX_HARIYAMA: _bindgen_ty_2 = 297;
pub const NATIONAL_DEX_AZURILL: _bindgen_ty_2 = 298;
pub const NATIONAL_DEX_NOSEPASS: _bindgen_ty_2 = 299;
pub const NATIONAL_DEX_SKITTY: _bindgen_ty_2 = 300;
pub const NATIONAL_DEX_DELCATTY: _bindgen_ty_2 = 301;
pub const NATIONAL_DEX_SABLEYE: _bindgen_ty_2 = 302;
pub const NATIONAL_DEX_MAWILE: _bindgen_ty_2 = 303;
pub const NATIONAL_DEX_ARON: _bindgen_ty_2 = 304;
pub const NATIONAL_DEX_LAIRON: _bindgen_ty_2 = 305;
pub const NATIONAL_DEX_AGGRON: _bindgen_ty_2 = 306;
pub const NATIONAL_DEX_MEDITITE: _bindgen_ty_2 = 307;
pub const NATIONAL_DEX_MEDICHAM: _bindgen_ty_2 = 308;
pub const NATIONAL_DEX_ELECTRIKE: _bindgen_ty_2 = 309;
pub const NATIONAL_DEX_MANECTRIC: _bindgen_ty_2 = 310;
pub const NATIONAL_DEX_PLUSLE: _bindgen_ty_2 = 311;
pub const NATIONAL_DEX_MINUN: _bindgen_ty_2 = 312;
pub const NATIONAL_DEX_VOLBEAT: _bindgen_ty_2 = 313;
pub const NATIONAL_DEX_ILLUMISE: _bindgen_ty_2 = 314;
pub const NATIONAL_DEX_ROSELIA: _bindgen_ty_2 = 315;
pub const NATIONAL_DEX_GULPIN: _bindgen_ty_2 = 316;
pub const NATIONAL_DEX_SWALOT: _bindgen_ty_2 = 317;
pub const NATIONAL_DEX_CARVANHA: _bindgen_ty_2 = 318;
pub const NATIONAL_DEX_SHARPEDO: _bindgen_ty_2 = 319;
pub const NATIONAL_DEX_WAILMER: _bindgen_ty_2 = 320;
pub const NATIONAL_DEX_WAILORD: _bindgen_ty_2 = 321;
pub const NATIONAL_DEX_NUMEL: _bindgen_ty_2 = 322;
pub const NATIONAL_DEX_CAMERUPT: _bindgen_ty_2 = 323;
pub const NATIONAL_DEX_TORKOAL: _bindgen_ty_2 = 324;
pub const NATIONAL_DEX_SPOINK: _bindgen_ty_2 = 325;
pub const NATIONAL_DEX_GRUMPIG: _bindgen_ty_2 = 326;
pub const NATIONAL_DEX_SPINDA: _bindgen_ty_2 = 327;
pub const NATIONAL_DEX_TRAPINCH: _bindgen_ty_2 = 328;
pub const NATIONAL_DEX_VIBRAVA: _bindgen_ty_2 = 329;
pub const NATIONAL_DEX_FLYGON: _bindgen_ty_2 = 330;
pub const NATIONAL_DEX_CACNEA: _bindgen_ty_2 = 331;
pub const NATIONAL_DEX_CACTURNE: _bindgen_ty_2 = 332;
pub const NATIONAL_DEX_SWABLU: _bindgen_ty_2 = 333;
pub const NATIONAL_DEX_ALTARIA: _bindgen_ty_2 = 334;
pub const NATIONAL_DEX_ZANGOOSE: _bindgen_ty_2 = 335;
pub const NATIONAL_DEX_SEVIPER: _bindgen_ty_2 = 336;
pub const NATIONAL_DEX_LUNATONE: _bindgen_ty_2 = 337;
pub const NATIONAL_DEX_SOLROCK: _bindgen_ty_2 = 338;
pub const NATIONAL_DEX_BARBOACH: _bindgen_ty_2 = 339;
pub const NATIONAL_DEX_WHISCASH: _bindgen_ty_2 = 340;
pub const NATIONAL_DEX_CORPHISH: _bindgen_ty_2 = 341;
pub const NATIONAL_DEX_CRAWDAUNT: _bindgen_ty_2 = 342;
pub const NATIONAL_DEX_BALTOY: _bindgen_ty_2 = 343;
pub const NATIONAL_DEX_CLAYDOL: _bindgen_ty_2 = 344;
pub const NATIONAL_DEX_LILEEP: _bindgen_ty_2 = 345;
pub const NATIONAL_DEX_CRADILY: _bindgen_ty_2 = 346;
pub const NATIONAL_DEX_ANORITH: _bindgen_ty_2 = 347;
pub const NATIONAL_DEX_ARMALDO: _bindgen_ty_2 = 348;
pub const NATIONAL_DEX_FEEBAS: _bindgen_ty_2 = 349;
pub const NATIONAL_DEX_MILOTIC: _bindgen_ty_2 = 350;
pub const NATIONAL_DEX_CASTFORM: _bindgen_ty_2 = 351;
pub const NATIONAL_DEX_KECLEON: _bindgen_ty_2 = 352;
pub const NATIONAL_DEX_SHUPPET: _bindgen_ty_2 = 353;
pub const NATIONAL_DEX_BANETTE: _bindgen_ty_2 = 354;
pub const NATIONAL_DEX_DUSKULL: _bindgen_ty_2 = 355;
pub const NATIONAL_DEX_DUSCLOPS: _bindgen_ty_2 = 356;
pub const NATIONAL_DEX_TROPIUS: _bindgen_ty_2 = 357;
pub const NATIONAL_DEX_CHIMECHO: _bindgen_ty_2 = 358;
pub const NATIONAL_DEX_ABSOL: _bindgen_ty_2 = 359;
pub const NATIONAL_DEX_WYNAUT: _bindgen_ty_2 = 360;
pub const NATIONAL_DEX_SNORUNT: _bindgen_ty_2 = 361;
pub const NATIONAL_DEX_GLALIE: _bindgen_ty_2 = 362;
pub const NATIONAL_DEX_SPHEAL: _bindgen_ty_2 = 363;
pub const NATIONAL_DEX_SEALEO: _bindgen_ty_2 = 364;
pub const NATIONAL_DEX_WALREIN: _bindgen_ty_2 = 365;
pub const NATIONAL_DEX_CLAMPERL: _bindgen_ty_2 = 366;
pub const NATIONAL_DEX_HUNTAIL: _bindgen_ty_2 = 367;
pub const NATIONAL_DEX_GOREBYSS: _bindgen_ty_2 = 368;
pub const NATIONAL_DEX_RELICANTH: _bindgen_ty_2 = 369;
pub const NATIONAL_DEX_LUVDISC: _bindgen_ty_2 = 370;
pub const NATIONAL_DEX_BAGON: _bindgen_ty_2 = 371;
pub const NATIONAL_DEX_SHELGON: _bindgen_ty_2 = 372;
pub const NATIONAL_DEX_SALAMENCE: _bindgen_ty_2 = 373;
pub const NATIONAL_DEX_BELDUM: _bindgen_ty_2 = 374;
pub const NATIONAL_DEX_METANG: _bindgen_ty_2 = 375;
pub const NATIONAL_DEX_METAGROSS: _bindgen_ty_2 = 376;
pub const NATIONAL_DEX_REGIROCK: _bindgen_ty_2 = 377;
pub const NATIONAL_DEX_REGICE: _bindgen_ty_2 = 378;
pub const NATIONAL_DEX_REGISTEEL: _bindgen_ty_2 = 379;
pub const NATIONAL_DEX_LATIAS: _bindgen_ty_2 = 380;
pub const NATIONAL_DEX_LATIOS: _bindgen_ty_2 = 381;
pub const NATIONAL_DEX_KYOGRE: _bindgen_ty_2 = 382;
pub const NATIONAL_DEX_GROUDON: _bindgen_ty_2 = 383;
pub const NATIONAL_DEX_RAYQUAZA: _bindgen_ty_2 = 384;
pub const NATIONAL_DEX_JIRACHI: _bindgen_ty_2 = 385;
pub const NATIONAL_DEX_DEOXYS: _bindgen_ty_2 = 386;
pub const NATIONAL_DEX_TURTWIG: _bindgen_ty_2 = 387;
pub const NATIONAL_DEX_GROTLE: _bindgen_ty_2 = 388;
pub const NATIONAL_DEX_TORTERRA: _bindgen_ty_2 = 389;
pub const NATIONAL_DEX_CHIMCHAR: _bindgen_ty_2 = 390;
pub const NATIONAL_DEX_MONFERNO: _bindgen_ty_2 = 391;
pub const NATIONAL_DEX_INFERNAPE: _bindgen_ty_2 = 392;
pub const NATIONAL_DEX_PIPLUP: _bindgen_ty_2 = 393;
pub const NATIONAL_DEX_PRINPLUP: _bindgen_ty_2 = 394;
pub const NATIONAL_DEX_EMPOLEON: _bindgen_ty_2 = 395;
pub const NATIONAL_DEX_STARLY: _bindgen_ty_2 = 396;
pub const NATIONAL_DEX_STARAVIA: _bindgen_ty_2 = 397;
pub const NATIONAL_DEX_STARAPTOR: _bindgen_ty_2 = 398;
pub const NATIONAL_DEX_BIDOOF: _bindgen_ty_2 = 399;
pub const NATIONAL_DEX_BIBAREL: _bindgen_ty_2 = 400;
pub const NATIONAL_DEX_KRICKETOT: _bindgen_ty_2 = 401;
pub const NATIONAL_DEX_KRICKETUNE: _bindgen_ty_2 = 402;
pub const NATIONAL_DEX_SHINX: _bindgen_ty_2 = 403;
pub const NATIONAL_DEX_LUXIO: _bindgen_ty_2 = 404;
pub const NATIONAL_DEX_LUXRAY: _bindgen_ty_2 = 405;
pub const NATIONAL_DEX_BUDEW: _bindgen_ty_2 = 406;
pub const NATIONAL_DEX_ROSERADE: _bindgen_ty_2 = 407;
pub const NATIONAL_DEX_CRANIDOS: _bindgen_ty_2 = 408;
pub const NATIONAL_DEX_RAMPARDOS: _bindgen_ty_2 = 409;
pub const NATIONAL_DEX_SHIELDON: _bindgen_ty_2 = 410;
pub const NATIONAL_DEX_BASTIODON: _bindgen_ty_2 = 411;
pub const NATIONAL_DEX_BURMY: _bindgen_ty_2 = 412;
pub const NATIONAL_DEX_WORMADAM: _bindgen_ty_2 = 413;
pub const NATIONAL_DEX_MOTHIM: _bindgen_ty_2 = 414;
pub const NATIONAL_DEX_COMBEE: _bindgen_ty_2 = 415;
pub const NATIONAL_DEX_VESPIQUEN: _bindgen_ty_2 = 416;
pub const NATIONAL_DEX_PACHIRISU: _bindgen_ty_2 = 417;
pub const NATIONAL_DEX_BUIZEL: _bindgen_ty_2 = 418;
pub const NATIONAL_DEX_FLOATZEL: _bindgen_ty_2 = 419;
pub const NATIONAL_DEX_CHERUBI: _bindgen_ty_2 = 420;
pub const NATIONAL_DEX_CHERRIM: _bindgen_ty_2 = 421;
pub const NATIONAL_DEX_SHELLOS: _bindgen_ty_2 = 422;
pub const NATIONAL_DEX_GASTRODON: _bindgen_ty_2 = 423;
pub const NATIONAL_DEX_AMBIPOM: _bindgen_ty_2 = 424;
pub const NATIONAL_DEX_DRIFLOON: _bindgen_ty_2 = 425;
pub const NATIONAL_DEX_DRIFBLIM: _bindgen_ty_2 = 426;
pub const NATIONAL_DEX_BUNEARY: _bindgen_ty_2 = 427;
pub const NATIONAL_DEX_LOPUNNY: _bindgen_ty_2 = 428;
pub const NATIONAL_DEX_MISMAGIUS: _bindgen_ty_2 = 429;
pub const NATIONAL_DEX_HONCHKROW: _bindgen_ty_2 = 430;
pub const NATIONAL_DEX_GLAMEOW: _bindgen_ty_2 = 431;
pub const NATIONAL_DEX_PURUGLY: _bindgen_ty_2 = 432;
pub const NATIONAL_DEX_CHINGLING: _bindgen_ty_2 = 433;
pub const NATIONAL_DEX_STUNKY: _bindgen_ty_2 = 434;
pub const NATIONAL_DEX_SKUNTANK: _bindgen_ty_2 = 435;
pub const NATIONAL_DEX_BRONZOR: _bindgen_ty_2 = 436;
pub const NATIONAL_DEX_BRONZONG: _bindgen_ty_2 = 437;
pub const NATIONAL_DEX_BONSLY: _bindgen_ty_2 = 438;
pub const NATIONAL_DEX_MIME_JR: _bindgen_ty_2 = 439;
pub const NATIONAL_DEX_HAPPINY: _bindgen_ty_2 = 440;
pub const NATIONAL_DEX_CHATOT: _bindgen_ty_2 = 441;
pub const NATIONAL_DEX_SPIRITOMB: _bindgen_ty_2 = 442;
pub const NATIONAL_DEX_GIBLE: _bindgen_ty_2 = 443;
pub const NATIONAL_DEX_GABITE: _bindgen_ty_2 = 444;
pub const NATIONAL_DEX_GARCHOMP: _bindgen_ty_2 = 445;
pub const NATIONAL_DEX_MUNCHLAX: _bindgen_ty_2 = 446;
pub const NATIONAL_DEX_RIOLU: _bindgen_ty_2 = 447;
pub const NATIONAL_DEX_LUCARIO: _bindgen_ty_2 = 448;
pub const NATIONAL_DEX_HIPPOPOTAS: _bindgen_ty_2 = 449;
pub const NATIONAL_DEX_HIPPOWDON: _bindgen_ty_2 = 450;
pub const NATIONAL_DEX_SKORUPI: _bindgen_ty_2 = 451;
pub const NATIONAL_DEX_DRAPION: _bindgen_ty_2 = 452;
pub const NATIONAL_DEX_CROAGUNK: _bindgen_ty_2 = 453;
pub const NATIONAL_DEX_TOXICROAK: _bindgen_ty_2 = 454;
pub const NATIONAL_DEX_CARNIVINE: _bindgen_ty_2 = 455;
pub const NATIONAL_DEX_FINNEON: _bindgen_ty_2 = 456;
pub const NATIONAL_DEX_LUMINEON: _bindgen_ty_2 = 457;
pub const NATIONAL_DEX_MANTYKE: _bindgen_ty_2 = 458;
pub const NATIONAL_DEX_SNOVER: _bindgen_ty_2 = 459;
pub const NATIONAL_DEX_ABOMASNOW: _bindgen_ty_2 = 460;
pub const NATIONAL_DEX_WEAVILE: _bindgen_ty_2 = 461;
pub const NATIONAL_DEX_MAGNEZONE: _bindgen_ty_2 = 462;
pub const NATIONAL_DEX_LICKILICKY: _bindgen_ty_2 = 463;
pub const NATIONAL_DEX_RHYPERIOR: _bindgen_ty_2 = 464;
pub const NATIONAL_DEX_TANGROWTH: _bindgen_ty_2 = 465;
pub const NATIONAL_DEX_ELECTIVIRE: _bindgen_ty_2 = 466;
pub const NATIONAL_DEX_MAGMORTAR: _bindgen_ty_2 = 467;
pub const NATIONAL_DEX_TOGEKISS: _bindgen_ty_2 = 468;
pub const NATIONAL_DEX_YANMEGA: _bindgen_ty_2 = 469;
pub const NATIONAL_DEX_LEAFEON: _bindgen_ty_2 = 470;
pub const NATIONAL_DEX_GLACEON: _bindgen_ty_2 = 471;
pub const NATIONAL_DEX_GLISCOR: _bindgen_ty_2 = 472;
pub const NATIONAL_DEX_MAMOSWINE: _bindgen_ty_2 = 473;
pub const NATIONAL_DEX_PORYGON_Z: _bindgen_ty_2 = 474;
pub const NATIONAL_DEX_GALLADE: _bindgen_ty_2 = 475;
pub const NATIONAL_DEX_PROBOPASS: _bindgen_ty_2 = 476;
pub const NATIONAL_DEX_DUSKNOIR: _bindgen_ty_2 = 477;
pub const NATIONAL_DEX_FROSLASS: _bindgen_ty_2 = 478;
pub const NATIONAL_DEX_ROTOM: _bindgen_ty_2 = 479;
pub const NATIONAL_DEX_UXIE: _bindgen_ty_2 = 480;
pub const NATIONAL_DEX_MESPRIT: _bindgen_ty_2 = 481;
pub const NATIONAL_DEX_AZELF: _bindgen_ty_2 = 482;
pub const NATIONAL_DEX_DIALGA: _bindgen_ty_2 = 483;
pub const NATIONAL_DEX_PALKIA: _bindgen_ty_2 = 484;
pub const NATIONAL_DEX_HEATRAN: _bindgen_ty_2 = 485;
pub const NATIONAL_DEX_REGIGIGAS: _bindgen_ty_2 = 486;
pub const NATIONAL_DEX_GIRATINA: _bindgen_ty_2 = 487;
pub const NATIONAL_DEX_CRESSELIA: _bindgen_ty_2 = 488;
pub const NATIONAL_DEX_PHIONE: _bindgen_ty_2 = 489;
pub const NATIONAL_DEX_MANAPHY: _bindgen_ty_2 = 490;
pub const NATIONAL_DEX_DARKRAI: _bindgen_ty_2 = 491;
pub const NATIONAL_DEX_SHAYMIN: _bindgen_ty_2 = 492;
pub const NATIONAL_DEX_ARCEUS: _bindgen_ty_2 = 493;
pub const NATIONAL_DEX_VICTINI: _bindgen_ty_2 = 494;
pub const NATIONAL_DEX_SNIVY: _bindgen_ty_2 = 495;
pub const NATIONAL_DEX_SERVINE: _bindgen_ty_2 = 496;
pub const NATIONAL_DEX_SERPERIOR: _bindgen_ty_2 = 497;
pub const NATIONAL_DEX_TEPIG: _bindgen_ty_2 = 498;
pub const NATIONAL_DEX_PIGNITE: _bindgen_ty_2 = 499;
pub const NATIONAL_DEX_EMBOAR: _bindgen_ty_2 = 500;
pub const NATIONAL_DEX_OSHAWOTT: _bindgen_ty_2 = 501;
pub const NATIONAL_DEX_DEWOTT: _bindgen_ty_2 = 502;
pub const NATIONAL_DEX_SAMUROTT: _bindgen_ty_2 = 503;
pub const NATIONAL_DEX_PATRAT: _bindgen_ty_2 = 504;
pub const NATIONAL_DEX_WATCHOG: _bindgen_ty_2 = 505;
pub const NATIONAL_DEX_LILLIPUP: _bindgen_ty_2 = 506;
pub const NATIONAL_DEX_HERDIER: _bindgen_ty_2 = 507;
pub const NATIONAL_DEX_STOUTLAND: _bindgen_ty_2 = 508;
pub const NATIONAL_DEX_PURRLOIN: _bindgen_ty_2 = 509;
pub const NATIONAL_DEX_LIEPARD: _bindgen_ty_2 = 510;
pub const NATIONAL_DEX_PANSAGE: _bindgen_ty_2 = 511;
pub const NATIONAL_DEX_SIMISAGE: _bindgen_ty_2 = 512;
pub const NATIONAL_DEX_PANSEAR: _bindgen_ty_2 = 513;
pub const NATIONAL_DEX_SIMISEAR: _bindgen_ty_2 = 514;
pub const NATIONAL_DEX_PANPOUR: _bindgen_ty_2 = 515;
pub const NATIONAL_DEX_SIMIPOUR: _bindgen_ty_2 = 516;
pub const NATIONAL_DEX_MUNNA: _bindgen_ty_2 = 517;
pub const NATIONAL_DEX_MUSHARNA: _bindgen_ty_2 = 518;
pub const NATIONAL_DEX_PIDOVE: _bindgen_ty_2 = 519;
pub const NATIONAL_DEX_TRANQUILL: _bindgen_ty_2 = 520;
pub const NATIONAL_DEX_UNFEZANT: _bindgen_ty_2 = 521;
pub const NATIONAL_DEX_BLITZLE: _bindgen_ty_2 = 522;
pub const NATIONAL_DEX_ZEBSTRIKA: _bindgen_ty_2 = 523;
pub const NATIONAL_DEX_ROGGENROLA: _bindgen_ty_2 = 524;
pub const NATIONAL_DEX_BOLDORE: _bindgen_ty_2 = 525;
pub const NATIONAL_DEX_GIGALITH: _bindgen_ty_2 = 526;
pub const NATIONAL_DEX_WOOBAT: _bindgen_ty_2 = 527;
pub const NATIONAL_DEX_SWOOBAT: _bindgen_ty_2 = 528;
pub const NATIONAL_DEX_DRILBUR: _bindgen_ty_2 = 529;
pub const NATIONAL_DEX_EXCADRILL: _bindgen_ty_2 = 530;
pub const NATIONAL_DEX_AUDINO: _bindgen_ty_2 = 531;
pub const NATIONAL_DEX_TIMBURR: _bindgen_ty_2 = 532;
pub const NATIONAL_DEX_GURDURR: _bindgen_ty_2 = 533;
pub const NATIONAL_DEX_CONKELDURR: _bindgen_ty_2 = 534;
pub const NATIONAL_DEX_TYMPOLE: _bindgen_ty_2 = 535;
pub const NATIONAL_DEX_PALPITOAD: _bindgen_ty_2 = 536;
pub const NATIONAL_DEX_SEISMITOAD: _bindgen_ty_2 = 537;
pub const NATIONAL_DEX_THROH: _bindgen_ty_2 = 538;
pub const NATIONAL_DEX_SAWK: _bindgen_ty_2 = 539;
pub const NATIONAL_DEX_SEWADDLE: _bindgen_ty_2 = 540;
pub const NATIONAL_DEX_SWADLOON: _bindgen_ty_2 = 541;
pub const NATIONAL_DEX_LEAVANNY: _bindgen_ty_2 = 542;
pub const NATIONAL_DEX_VENIPEDE: _bindgen_ty_2 = 543;
pub const NATIONAL_DEX_WHIRLIPEDE: _bindgen_ty_2 = 544;
pub const NATIONAL_DEX_SCOLIPEDE: _bindgen_ty_2 = 545;
pub const NATIONAL_DEX_COTTONEE: _bindgen_ty_2 = 546;
pub const NATIONAL_DEX_WHIMSICOTT: _bindgen_ty_2 = 547;
pub const NATIONAL_DEX_PETILIL: _bindgen_ty_2 = 548;
pub const NATIONAL_DEX_LILLIGANT: _bindgen_ty_2 = 549;
pub const NATIONAL_DEX_BASCULIN: _bindgen_ty_2 = 550;
pub const NATIONAL_DEX_SANDILE: _bindgen_ty_2 = 551;
pub const NATIONAL_DEX_KROKOROK: _bindgen_ty_2 = 552;
pub const NATIONAL_DEX_KROOKODILE: _bindgen_ty_2 = 553;
pub const NATIONAL_DEX_DARUMAKA: _bindgen_ty_2 = 554;
pub const NATIONAL_DEX_DARMANITAN: _bindgen_ty_2 = 555;
pub const NATIONAL_DEX_MARACTUS: _bindgen_ty_2 = 556;
pub const NATIONAL_DEX_DWEBBLE: _bindgen_ty_2 = 557;
pub const NATIONAL_DEX_CRUSTLE: _bindgen_ty_2 = 558;
pub const NATIONAL_DEX_SCRAGGY: _bindgen_ty_2 = 559;
pub const NATIONAL_DEX_SCRAFTY: _bindgen_ty_2 = 560;
pub const NATIONAL_DEX_SIGILYPH: _bindgen_ty_2 = 561;
pub const NATIONAL_DEX_YAMASK: _bindgen_ty_2 = 562;
pub const NATIONAL_DEX_COFAGRIGUS: _bindgen_ty_2 = 563;
pub const NATIONAL_DEX_TIRTOUGA: _bindgen_ty_2 = 564;
pub const NATIONAL_DEX_CARRACOSTA: _bindgen_ty_2 = 565;
pub const NATIONAL_DEX_ARCHEN: _bindgen_ty_2 = 566;
pub const NATIONAL_DEX_ARCHEOPS: _bindgen_ty_2 = 567;
pub const NATIONAL_DEX_TRUBBISH: _bindgen_ty_2 = 568;
pub const NATIONAL_DEX_GARBODOR: _bindgen_ty_2 = 569;
pub const NATIONAL_DEX_ZORUA: _bindgen_ty_2 = 570;
pub const NATIONAL_DEX_ZOROARK: _bindgen_ty_2 = 571;
pub const NATIONAL_DEX_MINCCINO: _bindgen_ty_2 = 572;
pub const NATIONAL_DEX_CINCCINO: _bindgen_ty_2 = 573;
pub const NATIONAL_DEX_GOTHITA: _bindgen_ty_2 = 574;
pub const NATIONAL_DEX_GOTHORITA: _bindgen_ty_2 = 575;
pub const NATIONAL_DEX_GOTHITELLE: _bindgen_ty_2 = 576;
pub const NATIONAL_DEX_SOLOSIS: _bindgen_ty_2 = 577;
pub const NATIONAL_DEX_DUOSION: _bindgen_ty_2 = 578;
pub const NATIONAL_DEX_REUNICLUS: _bindgen_ty_2 = 579;
pub const NATIONAL_DEX_DUCKLETT: _bindgen_ty_2 = 580;
pub const NATIONAL_DEX_SWANNA: _bindgen_ty_2 = 581;
pub const NATIONAL_DEX_VANILLITE: _bindgen_ty_2 = 582;
pub const NATIONAL_DEX_VANILLISH: _bindgen_ty_2 = 583;
pub const NATIONAL_DEX_VANILLUXE: _bindgen_ty_2 = 584;
pub const NATIONAL_DEX_DEERLING: _bindgen_ty_2 = 585;
pub const NATIONAL_DEX_SAWSBUCK: _bindgen_ty_2 = 586;
pub const NATIONAL_DEX_EMOLGA: _bindgen_ty_2 = 587;
pub const NATIONAL_DEX_KARRABLAST: _bindgen_ty_2 = 588;
pub const NATIONAL_DEX_ESCAVALIER: _bindgen_ty_2 = 589;
pub const NATIONAL_DEX_FOONGUS: _bindgen_ty_2 = 590;
pub const NATIONAL_DEX_AMOONGUSS: _bindgen_ty_2 = 591;
pub const NATIONAL_DEX_FRILLISH: _bindgen_ty_2 = 592;
pub const NATIONAL_DEX_JELLICENT: _bindgen_ty_2 = 593;
pub const NATIONAL_DEX_ALOMOMOLA: _bindgen_ty_2 = 594;
pub const NATIONAL_DEX_JOLTIK: _bindgen_ty_2 = 595;
pub const NATIONAL_DEX_GALVANTULA: _bindgen_ty_2 = 596;
pub const NATIONAL_DEX_FERROSEED: _bindgen_ty_2 = 597;
pub const NATIONAL_DEX_FERROTHORN: _bindgen_ty_2 = 598;
pub const NATIONAL_DEX_KLINK: _bindgen_ty_2 = 599;
pub const NATIONAL_DEX_KLANG: _bindgen_ty_2 = 600;
pub const NATIONAL_DEX_KLINKLANG: _bindgen_ty_2 = 601;
pub const NATIONAL_DEX_TYNAMO: _bindgen_ty_2 = 602;
pub const NATIONAL_DEX_EELEKTRIK: _bindgen_ty_2 = 603;
pub const NATIONAL_DEX_EELEKTROSS: _bindgen_ty_2 = 604;
pub const NATIONAL_DEX_ELGYEM: _bindgen_ty_2 = 605;
pub const NATIONAL_DEX_BEHEEYEM: _bindgen_ty_2 = 606;
pub const NATIONAL_DEX_LITWICK: _bindgen_ty_2 = 607;
pub const NATIONAL_DEX_LAMPENT: _bindgen_ty_2 = 608;
pub const NATIONAL_DEX_CHANDELURE: _bindgen_ty_2 = 609;
pub const NATIONAL_DEX_AXEW: _bindgen_ty_2 = 610;
pub const NATIONAL_DEX_FRAXURE: _bindgen_ty_2 = 611;
pub const NATIONAL_DEX_HAXORUS: _bindgen_ty_2 = 612;
pub const NATIONAL_DEX_CUBCHOO: _bindgen_ty_2 = 613;
pub const NATIONAL_DEX_BEARTIC: _bindgen_ty_2 = 614;
pub const NATIONAL_DEX_CRYOGONAL: _bindgen_ty_2 = 615;
pub const NATIONAL_DEX_SHELMET: _bindgen_ty_2 = 616;
pub const NATIONAL_DEX_ACCELGOR: _bindgen_ty_2 = 617;
pub const NATIONAL_DEX_STUNFISK: _bindgen_ty_2 = 618;
pub const NATIONAL_DEX_MIENFOO: _bindgen_ty_2 = 619;
pub const NATIONAL_DEX_MIENSHAO: _bindgen_ty_2 = 620;
pub const NATIONAL_DEX_DRUDDIGON: _bindgen_ty_2 = 621;
pub const NATIONAL_DEX_GOLETT: _bindgen_ty_2 = 622;
pub const NATIONAL_DEX_GOLURK: _bindgen_ty_2 = 623;
pub const NATIONAL_DEX_PAWNIARD: _bindgen_ty_2 = 624;
pub const NATIONAL_DEX_BISHARP: _bindgen_ty_2 = 625;
pub const NATIONAL_DEX_BOUFFALANT: _bindgen_ty_2 = 626;
pub const NATIONAL_DEX_RUFFLET: _bindgen_ty_2 = 627;
pub const NATIONAL_DEX_BRAVIARY: _bindgen_ty_2 = 628;
pub const NATIONAL_DEX_VULLABY: _bindgen_ty_2 = 629;
pub const NATIONAL_DEX_MANDIBUZZ: _bindgen_ty_2 = 630;
pub const NATIONAL_DEX_HEATMOR: _bindgen_ty_2 = 631;
pub const NATIONAL_DEX_DURANT: _bindgen_ty_2 = 632;
pub const NATIONAL_DEX_DEINO: _bindgen_ty_2 = 633;
pub const NATIONAL_DEX_ZWEILOUS: _bindgen_ty_2 = 634;
pub const NATIONAL_DEX_HYDREIGON: _bindgen_ty_2 = 635;
pub const NATIONAL_DEX_LARVESTA: _bindgen_ty_2 = 636;
pub const NATIONAL_DEX_VOLCARONA: _bindgen_ty_2 = 637;
pub const NATIONAL_DEX_COBALION: _bindgen_ty_2 = 638;
pub const NATIONAL_DEX_TERRAKION: _bindgen_ty_2 = 639;
pub const NATIONAL_DEX_VIRIZION: _bindgen_ty_2 = 640;
pub const NATIONAL_DEX_TORNADUS: _bindgen_ty_2 = 641;
pub const NATIONAL_DEX_THUNDURUS: _bindgen_ty_2 = 642;
pub const NATIONAL_DEX_RESHIRAM: _bindgen_ty_2 = 643;
pub const NATIONAL_DEX_ZEKROM: _bindgen_ty_2 = 644;
pub const NATIONAL_DEX_LANDORUS: _bindgen_ty_2 = 645;
pub const NATIONAL_DEX_KYUREM: _bindgen_ty_2 = 646;
pub const NATIONAL_DEX_KELDEO: _bindgen_ty_2 = 647;
pub const NATIONAL_DEX_MELOETTA: _bindgen_ty_2 = 648;
pub const NATIONAL_DEX_GENESECT: _bindgen_ty_2 = 649;
pub const NATIONAL_DEX_CHESPIN: _bindgen_ty_2 = 650;
pub const NATIONAL_DEX_QUILLADIN: _bindgen_ty_2 = 651;
pub const NATIONAL_DEX_CHESNAUGHT: _bindgen_ty_2 = 652;
pub const NATIONAL_DEX_FENNEKIN: _bindgen_ty_2 = 653;
pub const NATIONAL_DEX_BRAIXEN: _bindgen_ty_2 = 654;
pub const NATIONAL_DEX_DELPHOX: _bindgen_ty_2 = 655;
pub const NATIONAL_DEX_FROAKIE: _bindgen_ty_2 = 656;
pub const NATIONAL_DEX_FROGADIER: _bindgen_ty_2 = 657;
pub const NATIONAL_DEX_GRENINJA: _bindgen_ty_2 = 658;
pub const NATIONAL_DEX_BUNNELBY: _bindgen_ty_2 = 659;
pub const NATIONAL_DEX_DIGGERSBY: _bindgen_ty_2 = 660;
pub const NATIONAL_DEX_FLETCHLING: _bindgen_ty_2 = 661;
pub const NATIONAL_DEX_FLETCHINDER: _bindgen_ty_2 = 662;
pub const NATIONAL_DEX_TALONFLAME: _bindgen_ty_2 = 663;
pub const NATIONAL_DEX_SCATTERBUG: _bindgen_ty_2 = 664;
pub const NATIONAL_DEX_SPEWPA: _bindgen_ty_2 = 665;
pub const NATIONAL_DEX_VIVILLON: _bindgen_ty_2 = 666;
pub const NATIONAL_DEX_LITLEO: _bindgen_ty_2 = 667;
pub const NATIONAL_DEX_PYROAR: _bindgen_ty_2 = 668;
pub const NATIONAL_DEX_FLABEBE: _bindgen_ty_2 = 669;
pub const NATIONAL_DEX_FLOETTE: _bindgen_ty_2 = 670;
pub const NATIONAL_DEX_FLORGES: _bindgen_ty_2 = 671;
pub const NATIONAL_DEX_SKIDDO: _bindgen_ty_2 = 672;
pub const NATIONAL_DEX_GOGOAT: _bindgen_ty_2 = 673;
pub const NATIONAL_DEX_PANCHAM: _bindgen_ty_2 = 674;
pub const NATIONAL_DEX_PANGORO: _bindgen_ty_2 = 675;
pub const NATIONAL_DEX_FURFROU: _bindgen_ty_2 = 676;
pub const NATIONAL_DEX_ESPURR: _bindgen_ty_2 = 677;
pub const NATIONAL_DEX_MEOWSTIC: _bindgen_ty_2 = 678;
pub const NATIONAL_DEX_HONEDGE: _bindgen_ty_2 = 679;
pub const NATIONAL_DEX_DOUBLADE: _bindgen_ty_2 = 680;
pub const NATIONAL_DEX_AEGISLASH: _bindgen_ty_2 = 681;
pub const NATIONAL_DEX_SPRITZEE: _bindgen_ty_2 = 682;
pub const NATIONAL_DEX_AROMATISSE: _bindgen_ty_2 = 683;
pub const NATIONAL_DEX_SWIRLIX: _bindgen_ty_2 = 684;
pub const NATIONAL_DEX_SLURPUFF: _bindgen_ty_2 = 685;
pub const NATIONAL_DEX_INKAY: _bindgen_ty_2 = 686;
pub const NATIONAL_DEX_MALAMAR: _bindgen_ty_2 = 687;
pub const NATIONAL_DEX_BINACLE: _bindgen_ty_2 = 688;
pub const NATIONAL_DEX_BARBARACLE: _bindgen_ty_2 = 689;
pub const NATIONAL_DEX_SKRELP: _bindgen_ty_2 = 690;
pub const NATIONAL_DEX_DRAGALGE: _bindgen_ty_2 = 691;
pub const NATIONAL_DEX_CLAUNCHER: _bindgen_ty_2 = 692;
pub const NATIONAL_DEX_CLAWITZER: _bindgen_ty_2 = 693;
pub const NATIONAL_DEX_HELIOPTILE: _bindgen_ty_2 = 694;
pub const NATIONAL_DEX_HELIOLISK: _bindgen_ty_2 = 695;
pub const NATIONAL_DEX_TYRUNT: _bindgen_ty_2 = 696;
pub const NATIONAL_DEX_TYRANTRUM: _bindgen_ty_2 = 697;
pub const NATIONAL_DEX_AMAURA: _bindgen_ty_2 = 698;
pub const NATIONAL_DEX_AURORUS: _bindgen_ty_2 = 699;
pub const NATIONAL_DEX_SYLVEON: _bindgen_ty_2 = 700;
pub const NATIONAL_DEX_HAWLUCHA: _bindgen_ty_2 = 701;
pub const NATIONAL_DEX_DEDENNE: _bindgen_ty_2 = 702;
pub const NATIONAL_DEX_CARBINK: _bindgen_ty_2 = 703;
pub const NATIONAL_DEX_GOOMY: _bindgen_ty_2 = 704;
pub const NATIONAL_DEX_SLIGGOO: _bindgen_ty_2 = 705;
pub const NATIONAL_DEX_GOODRA: _bindgen_ty_2 = 706;
pub const NATIONAL_DEX_KLEFKI: _bindgen_ty_2 = 707;
pub const NATIONAL_DEX_PHANTUMP: _bindgen_ty_2 = 708;
pub const NATIONAL_DEX_TREVENANT: _bindgen_ty_2 = 709;
pub const NATIONAL_DEX_PUMPKABOO: _bindgen_ty_2 = 710;
pub const NATIONAL_DEX_GOURGEIST: _bindgen_ty_2 = 711;
pub const NATIONAL_DEX_BERGMITE: _bindgen_ty_2 = 712;
pub const NATIONAL_DEX_AVALUGG: _bindgen_ty_2 = 713;
pub const NATIONAL_DEX_NOIBAT: _bindgen_ty_2 = 714;
pub const NATIONAL_DEX_NOIVERN: _bindgen_ty_2 = 715;
pub const NATIONAL_DEX_XERNEAS: _bindgen_ty_2 = 716;
pub const NATIONAL_DEX_YVELTAL: _bindgen_ty_2 = 717;
pub const NATIONAL_DEX_ZYGARDE: _bindgen_ty_2 = 718;
pub const NATIONAL_DEX_DIANCIE: _bindgen_ty_2 = 719;
pub const NATIONAL_DEX_HOOPA: _bindgen_ty_2 = 720;
pub const NATIONAL_DEX_VOLCANION: _bindgen_ty_2 = 721;
pub const NATIONAL_DEX_ROWLET: _bindgen_ty_2 = 722;
pub const NATIONAL_DEX_DARTRIX: _bindgen_ty_2 = 723;
pub const NATIONAL_DEX_DECIDUEYE: _bindgen_ty_2 = 724;
pub const NATIONAL_DEX_LITTEN: _bindgen_ty_2 = 725;
pub const NATIONAL_DEX_TORRACAT: _bindgen_ty_2 = 726;
pub const NATIONAL_DEX_INCINEROAR: _bindgen_ty_2 = 727;
pub const NATIONAL_DEX_POPPLIO: _bindgen_ty_2 = 728;
pub const NATIONAL_DEX_BRIONNE: _bindgen_ty_2 = 729;
pub const NATIONAL_DEX_PRIMARINA: _bindgen_ty_2 = 730;
pub const NATIONAL_DEX_PIKIPEK: _bindgen_ty_2 = 731;
pub const NATIONAL_DEX_TRUMBEAK: _bindgen_ty_2 = 732;
pub const NATIONAL_DEX_TOUCANNON: _bindgen_ty_2 = 733;
pub const NATIONAL_DEX_YUNGOOS: _bindgen_ty_2 = 734;
pub const NATIONAL_DEX_GUMSHOOS: _bindgen_ty_2 = 735;
pub const NATIONAL_DEX_GRUBBIN: _bindgen_ty_2 = 736;
pub const NATIONAL_DEX_CHARJABUG: _bindgen_ty_2 = 737;
pub const NATIONAL_DEX_VIKAVOLT: _bindgen_ty_2 = 738;
pub const NATIONAL_DEX_CRABRAWLER: _bindgen_ty_2 = 739;
pub const NATIONAL_DEX_CRABOMINABLE: _bindgen_ty_2 = 740;
pub const NATIONAL_DEX_ORICORIO: _bindgen_ty_2 = 741;
pub const NATIONAL_DEX_CUTIEFLY: _bindgen_ty_2 = 742;
pub const NATIONAL_DEX_RIBOMBEE: _bindgen_ty_2 = 743;
pub const NATIONAL_DEX_ROCKRUFF: _bindgen_ty_2 = 744;
pub const NATIONAL_DEX_LYCANROC: _bindgen_ty_2 = 745;
pub const NATIONAL_DEX_WISHIWASHI: _bindgen_ty_2 = 746;
pub const NATIONAL_DEX_MAREANIE: _bindgen_ty_2 = 747;
pub const NATIONAL_DEX_TOXAPEX: _bindgen_ty_2 = 748;
pub const NATIONAL_DEX_MUDBRAY: _bindgen_ty_2 = 749;
pub const NATIONAL_DEX_MUDSDALE: _bindgen_ty_2 = 750;
pub const NATIONAL_DEX_DEWPIDER: _bindgen_ty_2 = 751;
pub const NATIONAL_DEX_ARAQUANID: _bindgen_ty_2 = 752;
pub const NATIONAL_DEX_FOMANTIS: _bindgen_ty_2 = 753;
pub const NATIONAL_DEX_LURANTIS: _bindgen_ty_2 = 754;
pub const NATIONAL_DEX_MORELULL: _bindgen_ty_2 = 755;
pub const NATIONAL_DEX_SHIINOTIC: _bindgen_ty_2 = 756;
pub const NATIONAL_DEX_SALANDIT: _bindgen_ty_2 = 757;
pub const NATIONAL_DEX_SALAZZLE: _bindgen_ty_2 = 758;
pub const NATIONAL_DEX_STUFFUL: _bindgen_ty_2 = 759;
pub const NATIONAL_DEX_BEWEAR: _bindgen_ty_2 = 760;
pub const NATIONAL_DEX_BOUNSWEET: _bindgen_ty_2 = 761;
pub const NATIONAL_DEX_STEENEE: _bindgen_ty_2 = 762;
pub const NATIONAL_DEX_TSAREENA: _bindgen_ty_2 = 763;
pub const NATIONAL_DEX_COMFEY: _bindgen_ty_2 = 764;
pub const NATIONAL_DEX_ORANGURU: _bindgen_ty_2 = 765;
pub const NATIONAL_DEX_PASSIMIAN: _bindgen_ty_2 = 766;
pub const NATIONAL_DEX_WIMPOD: _bindgen_ty_2 = 767;
pub const NATIONAL_DEX_GOLISOPOD: _bindgen_ty_2 = 768;
pub const NATIONAL_DEX_SANDYGAST: _bindgen_ty_2 = 769;
pub const NATIONAL_DEX_PALOSSAND: _bindgen_ty_2 = 770;
pub const NATIONAL_DEX_PYUKUMUKU: _bindgen_ty_2 = 771;
pub const NATIONAL_DEX_TYPE_NULL: _bindgen_ty_2 = 772;
pub const NATIONAL_DEX_SILVALLY: _bindgen_ty_2 = 773;
pub const NATIONAL_DEX_MINIOR: _bindgen_ty_2 = 774;
pub const NATIONAL_DEX_KOMALA: _bindgen_ty_2 = 775;
pub const NATIONAL_DEX_TURTONATOR: _bindgen_ty_2 = 776;
pub const NATIONAL_DEX_TOGEDEMARU: _bindgen_ty_2 = 777;
pub const NATIONAL_DEX_MIMIKYU: _bindgen_ty_2 = 778;
pub const NATIONAL_DEX_BRUXISH: _bindgen_ty_2 = 779;
pub const NATIONAL_DEX_DRAMPA: _bindgen_ty_2 = 780;
pub const NATIONAL_DEX_DHELMISE: _bindgen_ty_2 = 781;
pub const NATIONAL_DEX_JANGMO_O: _bindgen_ty_2 = 782;
pub const NATIONAL_DEX_HAKAMO_O: _bindgen_ty_2 = 783;
pub const NATIONAL_DEX_KOMMO_O: _bindgen_ty_2 = 784;
pub const NATIONAL_DEX_TAPU_KOKO: _bindgen_ty_2 = 785;
pub const NATIONAL_DEX_TAPU_LELE: _bindgen_ty_2 = 786;
pub const NATIONAL_DEX_TAPU_BULU: _bindgen_ty_2 = 787;
pub const NATIONAL_DEX_TAPU_FINI: _bindgen_ty_2 = 788;
pub const NATIONAL_DEX_COSMOG: _bindgen_ty_2 = 789;
pub const NATIONAL_DEX_COSMOEM: _bindgen_ty_2 = 790;
pub const NATIONAL_DEX_SOLGALEO: _bindgen_ty_2 = 791;
pub const NATIONAL_DEX_LUNALA: _bindgen_ty_2 = 792;
pub const NATIONAL_DEX_NIHILEGO: _bindgen_ty_2 = 793;
pub const NATIONAL_DEX_BUZZWOLE: _bindgen_ty_2 = 794;
pub const NATIONAL_DEX_PHEROMOSA: _bindgen_ty_2 = 795;
pub const NATIONAL_DEX_XURKITREE: _bindgen_ty_2 = 796;
pub const NATIONAL_DEX_CELESTEELA: _bindgen_ty_2 = 797;
pub const NATIONAL_DEX_KARTANA: _bindgen_ty_2 = 798;
pub const NATIONAL_DEX_GUZZLORD: _bindgen_ty_2 = 799;
pub const NATIONAL_DEX_NECROZMA: _bindgen_ty_2 = 800;
pub const NATIONAL_DEX_MAGEARNA: _bindgen_ty_2 = 801;
pub const NATIONAL_DEX_MARSHADOW: _bindgen_ty_2 = 802;
pub const NATIONAL_DEX_POIPOLE: _bindgen_ty_2 = 803;
pub const NATIONAL_DEX_NAGANADEL: _bindgen_ty_2 = 804;
pub const NATIONAL_DEX_STAKATAKA: _bindgen_ty_2 = 805;
pub const NATIONAL_DEX_BLACEPHALON: _bindgen_ty_2 = 806;
pub const NATIONAL_DEX_ZERAORA: _bindgen_ty_2 = 807;
pub const NATIONAL_DEX_MELTAN: _bindgen_ty_2 = 808;
pub const NATIONAL_DEX_MELMETAL: _bindgen_ty_2 = 809;
pub const NATIONAL_DEX_GROOKEY: _bindgen_ty_2 = 810;
pub const NATIONAL_DEX_THWACKEY: _bindgen_ty_2 = 811;
pub const NATIONAL_DEX_RILLABOOM: _bindgen_ty_2 = 812;
pub const NATIONAL_DEX_SCORBUNNY: _bindgen_ty_2 = 813;
pub const NATIONAL_DEX_RABOOT: _bindgen_ty_2 = 814;
pub const NATIONAL_DEX_CINDERACE: _bindgen_ty_2 = 815;
pub const NATIONAL_DEX_SOBBLE: _bindgen_ty_2 = 816;
pub const NATIONAL_DEX_DRIZZILE: _bindgen_ty_2 = 817;
pub const NATIONAL_DEX_INTELEON: _bindgen_ty_2 = 818;
pub const NATIONAL_DEX_SKWOVET: _bindgen_ty_2 = 819;
pub const NATIONAL_DEX_GREEDENT: _bindgen_ty_2 = 820;
pub const NATIONAL_DEX_ROOKIDEE: _bindgen_ty_2 = 821;
pub const NATIONAL_DEX_CORVISQUIRE: _bindgen_ty_2 = 822;
pub const NATIONAL_DEX_CORVIKNIGHT: _bindgen_ty_2 = 823;
pub const NATIONAL_DEX_BLIPBUG: _bindgen_ty_2 = 824;
pub const NATIONAL_DEX_DOTTLER: _bindgen_ty_2 = 825;
pub const NATIONAL_DEX_ORBEETLE: _bindgen_ty_2 = 826;
pub const NATIONAL_DEX_NICKIT: _bindgen_ty_2 = 827;
pub const NATIONAL_DEX_THIEVUL: _bindgen_ty_2 = 828;
pub const NATIONAL_DEX_GOSSIFLEUR: _bindgen_ty_2 = 829;
pub const NATIONAL_DEX_ELDEGOSS: _bindgen_ty_2 = 830;
pub const NATIONAL_DEX_WOOLOO: _bindgen_ty_2 = 831;
pub const NATIONAL_DEX_DUBWOOL: _bindgen_ty_2 = 832;
pub const NATIONAL_DEX_CHEWTLE: _bindgen_ty_2 = 833;
pub const NATIONAL_DEX_DREDNAW: _bindgen_ty_2 = 834;
pub const NATIONAL_DEX_YAMPER: _bindgen_ty_2 = 835;
pub const NATIONAL_DEX_BOLTUND: _bindgen_ty_2 = 836;
pub const NATIONAL_DEX_ROLYCOLY: _bindgen_ty_2 = 837;
pub const NATIONAL_DEX_CARKOL: _bindgen_ty_2 = 838;
pub const NATIONAL_DEX_COALOSSAL: _bindgen_ty_2 = 839;
pub const NATIONAL_DEX_APPLIN: _bindgen_ty_2 = 840;
pub const NATIONAL_DEX_FLAPPLE: _bindgen_ty_2 = 841;
pub const NATIONAL_DEX_APPLETUN: _bindgen_ty_2 = 842;
pub const NATIONAL_DEX_SILICOBRA: _bindgen_ty_2 = 843;
pub const NATIONAL_DEX_SANDACONDA: _bindgen_ty_2 = 844;
pub const NATIONAL_DEX_CRAMORANT: _bindgen_ty_2 = 845;
pub const NATIONAL_DEX_ARROKUDA: _bindgen_ty_2 = 846;
pub const NATIONAL_DEX_BARRASKEWDA: _bindgen_ty_2 = 847;
pub const NATIONAL_DEX_TOXEL: _bindgen_ty_2 = 848;
pub const NATIONAL_DEX_TOXTRICITY: _bindgen_ty_2 = 849;
pub const NATIONAL_DEX_SIZZLIPEDE: _bindgen_ty_2 = 850;
pub const NATIONAL_DEX_CENTISKORCH: _bindgen_ty_2 = 851;
pub const NATIONAL_DEX_CLOBBOPUS: _bindgen_ty_2 = 852;
pub const NATIONAL_DEX_GRAPPLOCT: _bindgen_ty_2 = 853;
pub const NATIONAL_DEX_SINISTEA: _bindgen_ty_2 = 854;
pub const NATIONAL_DEX_POLTEAGEIST: _bindgen_ty_2 = 855;
pub const NATIONAL_DEX_HATENNA: _bindgen_ty_2 = 856;
pub const NATIONAL_DEX_HATTREM: _bindgen_ty_2 = 857;
pub const NATIONAL_DEX_HATTERENE: _bindgen_ty_2 = 858;
pub const NATIONAL_DEX_IMPIDIMP: _bindgen_ty_2 = 859;
pub const NATIONAL_DEX_MORGREM: _bindgen_ty_2 = 860;
pub const NATIONAL_DEX_GRIMMSNARL: _bindgen_ty_2 = 861;
pub const NATIONAL_DEX_OBSTAGOON: _bindgen_ty_2 = 862;
pub const NATIONAL_DEX_PERRSERKER: _bindgen_ty_2 = 863;
pub const NATIONAL_DEX_CURSOLA: _bindgen_ty_2 = 864;
pub const NATIONAL_DEX_SIRFETCHD: _bindgen_ty_2 = 865;
pub const NATIONAL_DEX_MR_RIME: _bindgen_ty_2 = 866;
pub const NATIONAL_DEX_RUNERIGUS: _bindgen_ty_2 = 867;
pub const NATIONAL_DEX_MILCERY: _bindgen_ty_2 = 868;
pub const NATIONAL_DEX_ALCREMIE: _bindgen_ty_2 = 869;
pub const NATIONAL_DEX_FALINKS: _bindgen_ty_2 = 870;
pub const NATIONAL_DEX_PINCURCHIN: _bindgen_ty_2 = 871;
pub const NATIONAL_DEX_SNOM: _bindgen_ty_2 = 872;
pub const NATIONAL_DEX_FROSMOTH: _bindgen_ty_2 = 873;
pub const NATIONAL_DEX_STONJOURNER: _bindgen_ty_2 = 874;
pub const NATIONAL_DEX_EISCUE: _bindgen_ty_2 = 875;
pub const NATIONAL_DEX_INDEEDEE: _bindgen_ty_2 = 876;
pub const NATIONAL_DEX_MORPEKO: _bindgen_ty_2 = 877;
pub const NATIONAL_DEX_CUFANT: _bindgen_ty_2 = 878;
pub const NATIONAL_DEX_COPPERAJAH: _bindgen_ty_2 = 879;
pub const NATIONAL_DEX_DRACOZOLT: _bindgen_ty_2 = 880;
pub const NATIONAL_DEX_ARCTOZOLT: _bindgen_ty_2 = 881;
pub const NATIONAL_DEX_DRACOVISH: _bindgen_ty_2 = 882;
pub const NATIONAL_DEX_ARCTOVISH: _bindgen_ty_2 = 883;
pub const NATIONAL_DEX_DURALUDON: _bindgen_ty_2 = 884;
pub const NATIONAL_DEX_DREEPY: _bindgen_ty_2 = 885;
pub const NATIONAL_DEX_DRAKLOAK: _bindgen_ty_2 = 886;
pub const NATIONAL_DEX_DRAGAPULT: _bindgen_ty_2 = 887;
pub const NATIONAL_DEX_ZACIAN: _bindgen_ty_2 = 888;
pub const NATIONAL_DEX_ZAMAZENTA: _bindgen_ty_2 = 889;
pub const NATIONAL_DEX_ETERNATUS: _bindgen_ty_2 = 890;
pub const NATIONAL_DEX_KUBFU: _bindgen_ty_2 = 891;
pub const NATIONAL_DEX_URSHIFU: _bindgen_ty_2 = 892;
pub const NATIONAL_DEX_ZARUDE: _bindgen_ty_2 = 893;
pub const NATIONAL_DEX_REGIELEKI: _bindgen_ty_2 = 894;
pub const NATIONAL_DEX_REGIDRAGO: _bindgen_ty_2 = 895;
pub const NATIONAL_DEX_GLASTRIER: _bindgen_ty_2 = 896;
pub const NATIONAL_DEX_SPECTRIER: _bindgen_ty_2 = 897;
pub const NATIONAL_DEX_CALYREX: _bindgen_ty_2 = 898;
pub const NATIONAL_DEX_WYRDEER: _bindgen_ty_2 = 899;
pub const NATIONAL_DEX_KLEAVOR: _bindgen_ty_2 = 900;
pub const NATIONAL_DEX_URSALUNA: _bindgen_ty_2 = 901;
pub const NATIONAL_DEX_BASCULEGION: _bindgen_ty_2 = 902;
pub const NATIONAL_DEX_SNEASLER: _bindgen_ty_2 = 903;
pub const NATIONAL_DEX_OVERQWIL: _bindgen_ty_2 = 904;
pub const NATIONAL_DEX_ENAMORUS: _bindgen_ty_2 = 905;
pub const NATIONAL_DEX_SPRIGATITO: _bindgen_ty_2 = 906;
pub const NATIONAL_DEX_FLORAGATO: _bindgen_ty_2 = 907;
pub const NATIONAL_DEX_MEOWSCARADA: _bindgen_ty_2 = 908;
pub const NATIONAL_DEX_FUECOCO: _bindgen_ty_2 = 909;
pub const NATIONAL_DEX_CROCALOR: _bindgen_ty_2 = 910;
pub const NATIONAL_DEX_SKELEDIRGE: _bindgen_ty_2 = 911;
pub const NATIONAL_DEX_QUAXLY: _bindgen_ty_2 = 912;
pub const NATIONAL_DEX_QUAXWELL: _bindgen_ty_2 = 913;
pub const NATIONAL_DEX_QUAQUAVAL: _bindgen_ty_2 = 914;
pub const NATIONAL_DEX_LECHONK: _bindgen_ty_2 = 915;
pub const NATIONAL_DEX_OINKOLOGNE: _bindgen_ty_2 = 916;
pub const NATIONAL_DEX_TAROUNTULA: _bindgen_ty_2 = 917;
pub const NATIONAL_DEX_SPIDOPS: _bindgen_ty_2 = 918;
pub const NATIONAL_DEX_NYMBLE: _bindgen_ty_2 = 919;
pub const NATIONAL_DEX_LOKIX: _bindgen_ty_2 = 920;
pub const NATIONAL_DEX_PAWMI: _bindgen_ty_2 = 921;
pub const NATIONAL_DEX_PAWMO: _bindgen_ty_2 = 922;
pub const NATIONAL_DEX_PAWMOT: _bindgen_ty_2 = 923;
pub const NATIONAL_DEX_TANDEMAUS: _bindgen_ty_2 = 924;
pub const NATIONAL_DEX_MAUSHOLD: _bindgen_ty_2 = 925;
pub const NATIONAL_DEX_FIDOUGH: _bindgen_ty_2 = 926;
pub const NATIONAL_DEX_DACHSBUN: _bindgen_ty_2 = 927;
pub const NATIONAL_DEX_SMOLIV: _bindgen_ty_2 = 928;
pub const NATIONAL_DEX_DOLLIV: _bindgen_ty_2 = 929;
pub const NATIONAL_DEX_ARBOLIVA: _bindgen_ty_2 = 930;
pub const NATIONAL_DEX_SQUAWKABILLY: _bindgen_ty_2 = 931;
pub const NATIONAL_DEX_NACLI: _bindgen_ty_2 = 932;
pub const NATIONAL_DEX_NACLSTACK: _bindgen_ty_2 = 933;
pub const NATIONAL_DEX_GARGANACL: _bindgen_ty_2 = 934;
pub const NATIONAL_DEX_CHARCADET: _bindgen_ty_2 = 935;
pub const NATIONAL_DEX_ARMAROUGE: _bindgen_ty_2 = 936;
pub const NATIONAL_DEX_CERULEDGE: _bindgen_ty_2 = 937;
pub const NATIONAL_DEX_TADBULB: _bindgen_ty_2 = 938;
pub const NATIONAL_DEX_BELLIBOLT: _bindgen_ty_2 = 939;
pub const NATIONAL_DEX_WATTREL: _bindgen_ty_2 = 940;
pub const NATIONAL_DEX_KILOWATTREL: _bindgen_ty_2 = 941;
pub const NATIONAL_DEX_MASCHIFF: _bindgen_ty_2 = 942;
pub const NATIONAL_DEX_MABOSSTIFF: _bindgen_ty_2 = 943;
pub const NATIONAL_DEX_SHROODLE: _bindgen_ty_2 = 944;
pub const NATIONAL_DEX_GRAFAIAI: _bindgen_ty_2 = 945;
pub const NATIONAL_DEX_BRAMBLIN: _bindgen_ty_2 = 946;
pub const NATIONAL_DEX_BRAMBLEGHAST: _bindgen_ty_2 = 947;
pub const NATIONAL_DEX_TOEDSCOOL: _bindgen_ty_2 = 948;
pub const NATIONAL_DEX_TOEDSCRUEL: _bindgen_ty_2 = 949;
pub const NATIONAL_DEX_KLAWF: _bindgen_ty_2 = 950;
pub const NATIONAL_DEX_CAPSAKID: _bindgen_ty_2 = 951;
pub const NATIONAL_DEX_SCOVILLAIN: _bindgen_ty_2 = 952;
pub const NATIONAL_DEX_RELLOR: _bindgen_ty_2 = 953;
pub const NATIONAL_DEX_RABSCA: _bindgen_ty_2 = 954;
pub const NATIONAL_DEX_FLITTLE: _bindgen_ty_2 = 955;
pub const NATIONAL_DEX_ESPATHRA: _bindgen_ty_2 = 956;
pub const NATIONAL_DEX_TINKATINK: _bindgen_ty_2 = 957;
pub const NATIONAL_DEX_TINKATUFF: _bindgen_ty_2 = 958;
pub const NATIONAL_DEX_TINKATON: _bindgen_ty_2 = 959;
pub const NATIONAL_DEX_WIGLETT: _bindgen_ty_2 = 960;
pub const NATIONAL_DEX_WUGTRIO: _bindgen_ty_2 = 961;
pub const NATIONAL_DEX_BOMBIRDIER: _bindgen_ty_2 = 962;
pub const NATIONAL_DEX_FINIZEN: _bindgen_ty_2 = 963;
pub const NATIONAL_DEX_PALAFIN: _bindgen_ty_2 = 964;
pub const NATIONAL_DEX_VAROOM: _bindgen_ty_2 = 965;
pub const NATIONAL_DEX_REVAVROOM: _bindgen_ty_2 = 966;
pub const NATIONAL_DEX_CYCLIZAR: _bindgen_ty_2 = 967;
pub const NATIONAL_DEX_ORTHWORM: _bindgen_ty_2 = 968;
pub const NATIONAL_DEX_GLIMMET: _bindgen_ty_2 = 969;
pub const NATIONAL_DEX_GLIMMORA: _bindgen_ty_2 = 970;
pub const NATIONAL_DEX_GREAVARD: _bindgen_ty_2 = 971;
pub const NATIONAL_DEX_HOUNDSTONE: _bindgen_ty_2 = 972;
pub const NATIONAL_DEX_FLAMIGO: _bindgen_ty_2 = 973;
pub const NATIONAL_DEX_CETODDLE: _bindgen_ty_2 = 974;
pub const NATIONAL_DEX_CETITAN: _bindgen_ty_2 = 975;
pub const NATIONAL_DEX_VELUZA: _bindgen_ty_2 = 976;
pub const NATIONAL_DEX_DONDOZO: _bindgen_ty_2 = 977;
pub const NATIONAL_DEX_TATSUGIRI: _bindgen_ty_2 = 978;
pub const NATIONAL_DEX_ANNIHILAPE: _bindgen_ty_2 = 979;
pub const NATIONAL_DEX_CLODSIRE: _bindgen_ty_2 = 980;
pub const NATIONAL_DEX_FARIGIRAF: _bindgen_ty_2 = 981;
pub const NATIONAL_DEX_DUDUNSPARCE: _bindgen_ty_2 = 982;
pub const NATIONAL_DEX_KINGAMBIT: _bindgen_ty_2 = 983;
pub const NATIONAL_DEX_GREAT_TUSK: _bindgen_ty_2 = 984;
pub const NATIONAL_DEX_SCREAM_TAIL: _bindgen_ty_2 = 985;
pub const NATIONAL_DEX_BRUTE_BONNET: _bindgen_ty_2 = 986;
pub const NATIONAL_DEX_FLUTTER_MANE: _bindgen_ty_2 = 987;
pub const NATIONAL_DEX_SLITHER_WING: _bindgen_ty_2 = 988;
pub const NATIONAL_DEX_SANDY_SHOCKS: _bindgen_ty_2 = 989;
pub const NATIONAL_DEX_IRON_TREADS: _bindgen_ty_2 = 990;
pub const NATIONAL_DEX_IRON_BUNDLE: _bindgen_ty_2 = 991;
pub const NATIONAL_DEX_IRON_HANDS: _bindgen_ty_2 = 992;
pub const NATIONAL_DEX_IRON_JUGULIS: _bindgen_ty_2 = 993;
pub const NATIONAL_DEX_IRON_MOTH: _bindgen_ty_2 = 994;
pub const NATIONAL_DEX_IRON_THORNS: _bindgen_ty_2 = 995;
pub const NATIONAL_DEX_FRIGIBAX: _bindgen_ty_2 = 996;
pub const NATIONAL_DEX_ARCTIBAX: _bindgen_ty_2 = 997;
pub const NATIONAL_DEX_BAXCALIBUR: _bindgen_ty_2 = 998;
pub const NATIONAL_DEX_GIMMIGHOUL: _bindgen_ty_2 = 999;
pub const NATIONAL_DEX_GHOLDENGO: _bindgen_ty_2 = 1000;
pub const NATIONAL_DEX_WO_CHIEN: _bindgen_ty_2 = 1001;
pub const NATIONAL_DEX_CHIEN_PAO: _bindgen_ty_2 = 1002;
pub const NATIONAL_DEX_TING_LU: _bindgen_ty_2 = 1003;
pub const NATIONAL_DEX_CHI_YU: _bindgen_ty_2 = 1004;
pub const NATIONAL_DEX_ROARING_MOON: _bindgen_ty_2 = 1005;
pub const NATIONAL_DEX_IRON_VALIANT: _bindgen_ty_2 = 1006;
pub const NATIONAL_DEX_KORAIDON: _bindgen_ty_2 = 1007;
pub const NATIONAL_DEX_MIRAIDON: _bindgen_ty_2 = 1008;
pub const NATIONAL_DEX_WALKING_WAKE: _bindgen_ty_2 = 1009;
pub const NATIONAL_DEX_IRON_LEAVES: _bindgen_ty_2 = 1010;
pub const NATIONAL_DEX_DIPPLIN: _bindgen_ty_2 = 1011;
pub const NATIONAL_DEX_POLTCHAGEIST: _bindgen_ty_2 = 1012;
pub const NATIONAL_DEX_SINISTCHA: _bindgen_ty_2 = 1013;
pub const NATIONAL_DEX_OKIDOGI: _bindgen_ty_2 = 1014;
pub const NATIONAL_DEX_MUNKIDORI: _bindgen_ty_2 = 1015;
pub const NATIONAL_DEX_FEZANDIPITI: _bindgen_ty_2 = 1016;
pub const NATIONAL_DEX_OGERPON: _bindgen_ty_2 = 1017;
pub const NATIONAL_DEX_ARCHALUDON: _bindgen_ty_2 = 1018;
pub const NATIONAL_DEX_HYDRAPPLE: _bindgen_ty_2 = 1019;
pub const NATIONAL_DEX_GOUGING_FIRE: _bindgen_ty_2 = 1020;
pub const NATIONAL_DEX_RAGING_BOLT: _bindgen_ty_2 = 1021;
pub const NATIONAL_DEX_IRON_BOULDER: _bindgen_ty_2 = 1022;
pub const NATIONAL_DEX_IRON_CROWN: _bindgen_ty_2 = 1023;
pub const NATIONAL_DEX_TERAPAGOS: _bindgen_ty_2 = 1024;
pub const NATIONAL_DEX_PECHARUNT: _bindgen_ty_2 = 1025;
pub type _bindgen_ty_2 = ::core::ffi::c_uint;
pub const HOENN_DEX_NONE: _bindgen_ty_3 = 0;
pub const HOENN_DEX_TREECKO: _bindgen_ty_3 = 1;
pub const HOENN_DEX_GROVYLE: _bindgen_ty_3 = 2;
pub const HOENN_DEX_SCEPTILE: _bindgen_ty_3 = 3;
pub const HOENN_DEX_TORCHIC: _bindgen_ty_3 = 4;
pub const HOENN_DEX_COMBUSKEN: _bindgen_ty_3 = 5;
pub const HOENN_DEX_BLAZIKEN: _bindgen_ty_3 = 6;
pub const HOENN_DEX_MUDKIP: _bindgen_ty_3 = 7;
pub const HOENN_DEX_MARSHTOMP: _bindgen_ty_3 = 8;
pub const HOENN_DEX_SWAMPERT: _bindgen_ty_3 = 9;
pub const HOENN_DEX_POOCHYENA: _bindgen_ty_3 = 10;
pub const HOENN_DEX_MIGHTYENA: _bindgen_ty_3 = 11;
pub const HOENN_DEX_ZIGZAGOON: _bindgen_ty_3 = 12;
pub const HOENN_DEX_LINOONE: _bindgen_ty_3 = 13;
pub const HOENN_DEX_OBSTAGOON: _bindgen_ty_3 = 14;
pub const HOENN_DEX_WURMPLE: _bindgen_ty_3 = 15;
pub const HOENN_DEX_SILCOON: _bindgen_ty_3 = 16;
pub const HOENN_DEX_BEAUTIFLY: _bindgen_ty_3 = 17;
pub const HOENN_DEX_CASCOON: _bindgen_ty_3 = 18;
pub const HOENN_DEX_DUSTOX: _bindgen_ty_3 = 19;
pub const HOENN_DEX_LOTAD: _bindgen_ty_3 = 20;
pub const HOENN_DEX_LOMBRE: _bindgen_ty_3 = 21;
pub const HOENN_DEX_LUDICOLO: _bindgen_ty_3 = 22;
pub const HOENN_DEX_SEEDOT: _bindgen_ty_3 = 23;
pub const HOENN_DEX_NUZLEAF: _bindgen_ty_3 = 24;
pub const HOENN_DEX_SHIFTRY: _bindgen_ty_3 = 25;
pub const HOENN_DEX_TAILLOW: _bindgen_ty_3 = 26;
pub const HOENN_DEX_SWELLOW: _bindgen_ty_3 = 27;
pub const HOENN_DEX_WINGULL: _bindgen_ty_3 = 28;
pub const HOENN_DEX_PELIPPER: _bindgen_ty_3 = 29;
pub const HOENN_DEX_RALTS: _bindgen_ty_3 = 30;
pub const HOENN_DEX_KIRLIA: _bindgen_ty_3 = 31;
pub const HOENN_DEX_GARDEVOIR: _bindgen_ty_3 = 32;
pub const HOENN_DEX_GALLADE: _bindgen_ty_3 = 33;
pub const HOENN_DEX_SURSKIT: _bindgen_ty_3 = 34;
pub const HOENN_DEX_MASQUERAIN: _bindgen_ty_3 = 35;
pub const HOENN_DEX_SHROOMISH: _bindgen_ty_3 = 36;
pub const HOENN_DEX_BRELOOM: _bindgen_ty_3 = 37;
pub const HOENN_DEX_SLAKOTH: _bindgen_ty_3 = 38;
pub const HOENN_DEX_VIGOROTH: _bindgen_ty_3 = 39;
pub const HOENN_DEX_SLAKING: _bindgen_ty_3 = 40;
pub const HOENN_DEX_ABRA: _bindgen_ty_3 = 41;
pub const HOENN_DEX_KADABRA: _bindgen_ty_3 = 42;
pub const HOENN_DEX_ALAKAZAM: _bindgen_ty_3 = 43;
pub const HOENN_DEX_NINCADA: _bindgen_ty_3 = 44;
pub const HOENN_DEX_NINJASK: _bindgen_ty_3 = 45;
pub const HOENN_DEX_SHEDINJA: _bindgen_ty_3 = 46;
pub const HOENN_DEX_WHISMUR: _bindgen_ty_3 = 47;
pub const HOENN_DEX_LOUDRED: _bindgen_ty_3 = 48;
pub const HOENN_DEX_EXPLOUD: _bindgen_ty_3 = 49;
pub const HOENN_DEX_MAKUHITA: _bindgen_ty_3 = 50;
pub const HOENN_DEX_HARIYAMA: _bindgen_ty_3 = 51;
pub const HOENN_DEX_GOLDEEN: _bindgen_ty_3 = 52;
pub const HOENN_DEX_SEAKING: _bindgen_ty_3 = 53;
pub const HOENN_DEX_MAGIKARP: _bindgen_ty_3 = 54;
pub const HOENN_DEX_GYARADOS: _bindgen_ty_3 = 55;
pub const HOENN_DEX_AZURILL: _bindgen_ty_3 = 56;
pub const HOENN_DEX_MARILL: _bindgen_ty_3 = 57;
pub const HOENN_DEX_AZUMARILL: _bindgen_ty_3 = 58;
pub const HOENN_DEX_GEODUDE: _bindgen_ty_3 = 59;
pub const HOENN_DEX_GRAVELER: _bindgen_ty_3 = 60;
pub const HOENN_DEX_GOLEM: _bindgen_ty_3 = 61;
pub const HOENN_DEX_NOSEPASS: _bindgen_ty_3 = 62;
pub const HOENN_DEX_PROBOPASS: _bindgen_ty_3 = 63;
pub const HOENN_DEX_SKITTY: _bindgen_ty_3 = 64;
pub const HOENN_DEX_DELCATTY: _bindgen_ty_3 = 65;
pub const HOENN_DEX_ZUBAT: _bindgen_ty_3 = 66;
pub const HOENN_DEX_GOLBAT: _bindgen_ty_3 = 67;
pub const HOENN_DEX_CROBAT: _bindgen_ty_3 = 68;
pub const HOENN_DEX_TENTACOOL: _bindgen_ty_3 = 69;
pub const HOENN_DEX_TENTACRUEL: _bindgen_ty_3 = 70;
pub const HOENN_DEX_SABLEYE: _bindgen_ty_3 = 71;
pub const HOENN_DEX_MAWILE: _bindgen_ty_3 = 72;
pub const HOENN_DEX_ARON: _bindgen_ty_3 = 73;
pub const HOENN_DEX_LAIRON: _bindgen_ty_3 = 74;
pub const HOENN_DEX_AGGRON: _bindgen_ty_3 = 75;
pub const HOENN_DEX_MACHOP: _bindgen_ty_3 = 76;
pub const HOENN_DEX_MACHOKE: _bindgen_ty_3 = 77;
pub const HOENN_DEX_MACHAMP: _bindgen_ty_3 = 78;
pub const HOENN_DEX_MEDITITE: _bindgen_ty_3 = 79;
pub const HOENN_DEX_MEDICHAM: _bindgen_ty_3 = 80;
pub const HOENN_DEX_ELECTRIKE: _bindgen_ty_3 = 81;
pub const HOENN_DEX_MANECTRIC: _bindgen_ty_3 = 82;
pub const HOENN_DEX_PLUSLE: _bindgen_ty_3 = 83;
pub const HOENN_DEX_MINUN: _bindgen_ty_3 = 84;
pub const HOENN_DEX_MAGNEMITE: _bindgen_ty_3 = 85;
pub const HOENN_DEX_MAGNETON: _bindgen_ty_3 = 86;
pub const HOENN_DEX_MAGNEZONE: _bindgen_ty_3 = 87;
pub const HOENN_DEX_VOLTORB: _bindgen_ty_3 = 88;
pub const HOENN_DEX_ELECTRODE: _bindgen_ty_3 = 89;
pub const HOENN_DEX_VOLBEAT: _bindgen_ty_3 = 90;
pub const HOENN_DEX_ILLUMISE: _bindgen_ty_3 = 91;
pub const HOENN_DEX_ODDISH: _bindgen_ty_3 = 92;
pub const HOENN_DEX_GLOOM: _bindgen_ty_3 = 93;
pub const HOENN_DEX_VILEPLUME: _bindgen_ty_3 = 94;
pub const HOENN_DEX_BELLOSSOM: _bindgen_ty_3 = 95;
pub const HOENN_DEX_DODUO: _bindgen_ty_3 = 96;
pub const HOENN_DEX_DODRIO: _bindgen_ty_3 = 97;
pub const HOENN_DEX_BUDEW: _bindgen_ty_3 = 98;
pub const HOENN_DEX_ROSELIA: _bindgen_ty_3 = 99;
pub const HOENN_DEX_ROSERADE: _bindgen_ty_3 = 100;
pub const HOENN_DEX_GULPIN: _bindgen_ty_3 = 101;
pub const HOENN_DEX_SWALOT: _bindgen_ty_3 = 102;
pub const HOENN_DEX_CARVANHA: _bindgen_ty_3 = 103;
pub const HOENN_DEX_SHARPEDO: _bindgen_ty_3 = 104;
pub const HOENN_DEX_WAILMER: _bindgen_ty_3 = 105;
pub const HOENN_DEX_WAILORD: _bindgen_ty_3 = 106;
pub const HOENN_DEX_NUMEL: _bindgen_ty_3 = 107;
pub const HOENN_DEX_CAMERUPT: _bindgen_ty_3 = 108;
pub const HOENN_DEX_SLUGMA: _bindgen_ty_3 = 109;
pub const HOENN_DEX_MAGCARGO: _bindgen_ty_3 = 110;
pub const HOENN_DEX_TORKOAL: _bindgen_ty_3 = 111;
pub const HOENN_DEX_GRIMER: _bindgen_ty_3 = 112;
pub const HOENN_DEX_MUK: _bindgen_ty_3 = 113;
pub const HOENN_DEX_KOFFING: _bindgen_ty_3 = 114;
pub const HOENN_DEX_WEEZING: _bindgen_ty_3 = 115;
pub const HOENN_DEX_SPOINK: _bindgen_ty_3 = 116;
pub const HOENN_DEX_GRUMPIG: _bindgen_ty_3 = 117;
pub const HOENN_DEX_SANDSHREW: _bindgen_ty_3 = 118;
pub const HOENN_DEX_SANDSLASH: _bindgen_ty_3 = 119;
pub const HOENN_DEX_SPINDA: _bindgen_ty_3 = 120;
pub const HOENN_DEX_SKARMORY: _bindgen_ty_3 = 121;
pub const HOENN_DEX_TRAPINCH: _bindgen_ty_3 = 122;
pub const HOENN_DEX_VIBRAVA: _bindgen_ty_3 = 123;
pub const HOENN_DEX_FLYGON: _bindgen_ty_3 = 124;
pub const HOENN_DEX_CACNEA: _bindgen_ty_3 = 125;
pub const HOENN_DEX_CACTURNE: _bindgen_ty_3 = 126;
pub const HOENN_DEX_SWABLU: _bindgen_ty_3 = 127;
pub const HOENN_DEX_ALTARIA: _bindgen_ty_3 = 128;
pub const HOENN_DEX_ZANGOOSE: _bindgen_ty_3 = 129;
pub const HOENN_DEX_SEVIPER: _bindgen_ty_3 = 130;
pub const HOENN_DEX_LUNATONE: _bindgen_ty_3 = 131;
pub const HOENN_DEX_SOLROCK: _bindgen_ty_3 = 132;
pub const HOENN_DEX_BARBOACH: _bindgen_ty_3 = 133;
pub const HOENN_DEX_WHISCASH: _bindgen_ty_3 = 134;
pub const HOENN_DEX_CORPHISH: _bindgen_ty_3 = 135;
pub const HOENN_DEX_CRAWDAUNT: _bindgen_ty_3 = 136;
pub const HOENN_DEX_BALTOY: _bindgen_ty_3 = 137;
pub const HOENN_DEX_CLAYDOL: _bindgen_ty_3 = 138;
pub const HOENN_DEX_LILEEP: _bindgen_ty_3 = 139;
pub const HOENN_DEX_CRADILY: _bindgen_ty_3 = 140;
pub const HOENN_DEX_ANORITH: _bindgen_ty_3 = 141;
pub const HOENN_DEX_ARMALDO: _bindgen_ty_3 = 142;
pub const HOENN_DEX_IGGLYBUFF: _bindgen_ty_3 = 143;
pub const HOENN_DEX_JIGGLYPUFF: _bindgen_ty_3 = 144;
pub const HOENN_DEX_WIGGLYTUFF: _bindgen_ty_3 = 145;
pub const HOENN_DEX_FEEBAS: _bindgen_ty_3 = 146;
pub const HOENN_DEX_MILOTIC: _bindgen_ty_3 = 147;
pub const HOENN_DEX_CASTFORM: _bindgen_ty_3 = 148;
pub const HOENN_DEX_STARYU: _bindgen_ty_3 = 149;
pub const HOENN_DEX_STARMIE: _bindgen_ty_3 = 150;
pub const HOENN_DEX_KECLEON: _bindgen_ty_3 = 151;
pub const HOENN_DEX_SHUPPET: _bindgen_ty_3 = 152;
pub const HOENN_DEX_BANETTE: _bindgen_ty_3 = 153;
pub const HOENN_DEX_DUSKULL: _bindgen_ty_3 = 154;
pub const HOENN_DEX_DUSCLOPS: _bindgen_ty_3 = 155;
pub const HOENN_DEX_DUSKNOIR: _bindgen_ty_3 = 156;
pub const HOENN_DEX_TROPIUS: _bindgen_ty_3 = 157;
pub const HOENN_DEX_CHINGLING: _bindgen_ty_3 = 158;
pub const HOENN_DEX_CHIMECHO: _bindgen_ty_3 = 159;
pub const HOENN_DEX_ABSOL: _bindgen_ty_3 = 160;
pub const HOENN_DEX_VULPIX: _bindgen_ty_3 = 161;
pub const HOENN_DEX_NINETALES: _bindgen_ty_3 = 162;
pub const HOENN_DEX_PICHU: _bindgen_ty_3 = 163;
pub const HOENN_DEX_PIKACHU: _bindgen_ty_3 = 164;
pub const HOENN_DEX_RAICHU: _bindgen_ty_3 = 165;
pub const HOENN_DEX_PSYDUCK: _bindgen_ty_3 = 166;
pub const HOENN_DEX_GOLDUCK: _bindgen_ty_3 = 167;
pub const HOENN_DEX_WYNAUT: _bindgen_ty_3 = 168;
pub const HOENN_DEX_WOBBUFFET: _bindgen_ty_3 = 169;
pub const HOENN_DEX_NATU: _bindgen_ty_3 = 170;
pub const HOENN_DEX_XATU: _bindgen_ty_3 = 171;
pub const HOENN_DEX_GIRAFARIG: _bindgen_ty_3 = 172;
pub const HOENN_DEX_FARIGIRAF: _bindgen_ty_3 = 173;
pub const HOENN_DEX_PHANPY: _bindgen_ty_3 = 174;
pub const HOENN_DEX_DONPHAN: _bindgen_ty_3 = 175;
pub const HOENN_DEX_PINSIR: _bindgen_ty_3 = 176;
pub const HOENN_DEX_HERACROSS: _bindgen_ty_3 = 177;
pub const HOENN_DEX_RHYHORN: _bindgen_ty_3 = 178;
pub const HOENN_DEX_RHYDON: _bindgen_ty_3 = 179;
pub const HOENN_DEX_RHYPERIOR: _bindgen_ty_3 = 180;
pub const HOENN_DEX_SNORUNT: _bindgen_ty_3 = 181;
pub const HOENN_DEX_GLALIE: _bindgen_ty_3 = 182;
pub const HOENN_DEX_FROSLASS: _bindgen_ty_3 = 183;
pub const HOENN_DEX_SPHEAL: _bindgen_ty_3 = 184;
pub const HOENN_DEX_SEALEO: _bindgen_ty_3 = 185;
pub const HOENN_DEX_WALREIN: _bindgen_ty_3 = 186;
pub const HOENN_DEX_CLAMPERL: _bindgen_ty_3 = 187;
pub const HOENN_DEX_HUNTAIL: _bindgen_ty_3 = 188;
pub const HOENN_DEX_GOREBYSS: _bindgen_ty_3 = 189;
pub const HOENN_DEX_RELICANTH: _bindgen_ty_3 = 190;
pub const HOENN_DEX_CORSOLA: _bindgen_ty_3 = 191;
pub const HOENN_DEX_CURSOLA: _bindgen_ty_3 = 192;
pub const HOENN_DEX_CHINCHOU: _bindgen_ty_3 = 193;
pub const HOENN_DEX_LANTURN: _bindgen_ty_3 = 194;
pub const HOENN_DEX_LUVDISC: _bindgen_ty_3 = 195;
pub const HOENN_DEX_HORSEA: _bindgen_ty_3 = 196;
pub const HOENN_DEX_SEADRA: _bindgen_ty_3 = 197;
pub const HOENN_DEX_KINGDRA: _bindgen_ty_3 = 198;
pub const HOENN_DEX_BAGON: _bindgen_ty_3 = 199;
pub const HOENN_DEX_SHELGON: _bindgen_ty_3 = 200;
pub const HOENN_DEX_SALAMENCE: _bindgen_ty_3 = 201;
pub const HOENN_DEX_BELDUM: _bindgen_ty_3 = 202;
pub const HOENN_DEX_METANG: _bindgen_ty_3 = 203;
pub const HOENN_DEX_METAGROSS: _bindgen_ty_3 = 204;
pub const HOENN_DEX_REGIROCK: _bindgen_ty_3 = 205;
pub const HOENN_DEX_REGICE: _bindgen_ty_3 = 206;
pub const HOENN_DEX_REGISTEEL: _bindgen_ty_3 = 207;
pub const HOENN_DEX_LATIAS: _bindgen_ty_3 = 208;
pub const HOENN_DEX_LATIOS: _bindgen_ty_3 = 209;
pub const HOENN_DEX_KYOGRE: _bindgen_ty_3 = 210;
pub const HOENN_DEX_GROUDON: _bindgen_ty_3 = 211;
pub const HOENN_DEX_RAYQUAZA: _bindgen_ty_3 = 212;
pub const HOENN_DEX_JIRACHI: _bindgen_ty_3 = 213;
pub const HOENN_DEX_DEOXYS: _bindgen_ty_3 = 214;
pub type _bindgen_ty_3 = ::core::ffi::c_uint;
pub const DEX_MODE_HOENN: _bindgen_ty_4 = 0;
pub const DEX_MODE_NATIONAL: _bindgen_ty_4 = 1;
pub type _bindgen_ty_4 = ::core::ffi::c_uint;
pub const FLAG_GET_SEEN: _bindgen_ty_5 = 0;
pub const FLAG_GET_CAUGHT: _bindgen_ty_5 = 1;
pub const FLAG_SET_SEEN: _bindgen_ty_5 = 2;
pub const FLAG_SET_CAUGHT: _bindgen_ty_5 = 3;
pub type _bindgen_ty_5 = ::core::ffi::c_uint;
pub const EvolutionMethods_EVO_NONE: EvolutionMethods = 0;
pub const EvolutionMethods_EVO_FRIENDSHIP: EvolutionMethods = 1;
pub const EvolutionMethods_EVO_FRIENDSHIP_DAY: EvolutionMethods = 2;
pub const EvolutionMethods_EVO_FRIENDSHIP_NIGHT: EvolutionMethods = 3;
pub const EvolutionMethods_EVO_LEVEL: EvolutionMethods = 4;
pub const EvolutionMethods_EVO_TRADE: EvolutionMethods = 5;
pub const EvolutionMethods_EVO_TRADE_ITEM: EvolutionMethods = 6;
pub const EvolutionMethods_EVO_ITEM: EvolutionMethods = 7;
pub const EvolutionMethods_EVO_LEVEL_ATK_GT_DEF: EvolutionMethods = 8;
pub const EvolutionMethods_EVO_LEVEL_ATK_EQ_DEF: EvolutionMethods = 9;
pub const EvolutionMethods_EVO_LEVEL_ATK_LT_DEF: EvolutionMethods = 10;
pub const EvolutionMethods_EVO_LEVEL_SILCOON: EvolutionMethods = 11;
pub const EvolutionMethods_EVO_LEVEL_CASCOON: EvolutionMethods = 12;
pub const EvolutionMethods_EVO_LEVEL_NINJASK: EvolutionMethods = 13;
pub const EvolutionMethods_EVO_LEVEL_SHEDINJA: EvolutionMethods = 14;
pub const EvolutionMethods_EVO_BEAUTY: EvolutionMethods = 15;
pub const EvolutionMethods_EVO_LEVEL_FEMALE: EvolutionMethods = 16;
pub const EvolutionMethods_EVO_LEVEL_MALE: EvolutionMethods = 17;
pub const EvolutionMethods_EVO_LEVEL_NIGHT: EvolutionMethods = 18;
pub const EvolutionMethods_EVO_LEVEL_DAY: EvolutionMethods = 19;
pub const EvolutionMethods_EVO_LEVEL_DUSK: EvolutionMethods = 20;
pub const EvolutionMethods_EVO_ITEM_HOLD_DAY: EvolutionMethods = 21;
pub const EvolutionMethods_EVO_ITEM_HOLD_NIGHT: EvolutionMethods = 22;
pub const EvolutionMethods_EVO_MOVE: EvolutionMethods = 23;
pub const EvolutionMethods_EVO_FRIENDSHIP_MOVE_TYPE: EvolutionMethods = 24;
pub const EvolutionMethods_EVO_MAPSEC: EvolutionMethods = 25;
pub const EvolutionMethods_EVO_ITEM_MALE: EvolutionMethods = 26;
pub const EvolutionMethods_EVO_ITEM_FEMALE: EvolutionMethods = 27;
pub const EvolutionMethods_EVO_LEVEL_RAIN: EvolutionMethods = 28;
pub const EvolutionMethods_EVO_SPECIFIC_MON_IN_PARTY: EvolutionMethods = 29;
pub const EvolutionMethods_EVO_LEVEL_DARK_TYPE_MON_IN_PARTY: EvolutionMethods = 30;
pub const EvolutionMethods_EVO_TRADE_SPECIFIC_MON: EvolutionMethods = 31;
pub const EvolutionMethods_EVO_SPECIFIC_MAP: EvolutionMethods = 32;
pub const EvolutionMethods_EVO_LEVEL_NATURE_AMPED: EvolutionMethods = 33;
pub const EvolutionMethods_EVO_LEVEL_NATURE_LOW_KEY: EvolutionMethods = 34;
pub const EvolutionMethods_EVO_CRITICAL_HITS: EvolutionMethods = 35;
pub const EvolutionMethods_EVO_SCRIPT_TRIGGER_DMG: EvolutionMethods = 36;
pub const EvolutionMethods_EVO_DARK_SCROLL: EvolutionMethods = 37;
pub const EvolutionMethods_EVO_WATER_SCROLL: EvolutionMethods = 38;
pub const EvolutionMethods_EVO_ITEM_NIGHT: EvolutionMethods = 39;
pub const EvolutionMethods_EVO_ITEM_DAY: EvolutionMethods = 40;
pub const EvolutionMethods_EVO_ITEM_HOLD: EvolutionMethods = 41;
pub const EvolutionMethods_EVO_LEVEL_FOG: EvolutionMethods = 42;
pub const EvolutionMethods_EVO_MOVE_TWO_SEGMENT: EvolutionMethods = 43;
pub const EvolutionMethods_EVO_MOVE_THREE_SEGMENT: EvolutionMethods = 44;
pub const EvolutionMethods_EVO_LEVEL_FAMILY_OF_THREE: EvolutionMethods = 45;
pub const EvolutionMethods_EVO_LEVEL_FAMILY_OF_FOUR: EvolutionMethods = 46;
pub const EvolutionMethods_EVO_USE_MOVE_TWENTY_TIMES: EvolutionMethods = 47;
pub const EvolutionMethods_EVO_RECOIL_DAMAGE_MALE: EvolutionMethods = 48;
pub const EvolutionMethods_EVO_RECOIL_DAMAGE_FEMALE: EvolutionMethods = 49;
pub const EvolutionMethods_EVO_ITEM_COUNT_999: EvolutionMethods = 50;
pub const EvolutionMethods_EVO_DEFEAT_THREE_WITH_ITEM: EvolutionMethods = 51;
pub const EvolutionMethods_EVO_OVERWORLD_STEPS: EvolutionMethods = 52;
pub type EvolutionMethods = ::core::ffi::c_uint;
pub const EvolutionMode_EVO_MODE_NORMAL: EvolutionMode = 0;
pub const EvolutionMode_EVO_MODE_CANT_STOP: EvolutionMode = 1;
pub const EvolutionMode_EVO_MODE_TRADE: EvolutionMode = 2;
pub const EvolutionMode_EVO_MODE_ITEM_USE: EvolutionMode = 3;
pub const EvolutionMode_EVO_MODE_ITEM_CHECK: EvolutionMode = 4;
pub const EvolutionMode_EVO_MODE_BATTLE_SPECIAL: EvolutionMode = 5;
pub const EvolutionMode_EVO_MODE_OVERWORLD_SPECIAL: EvolutionMode = 6;
pub const EvolutionMode_EVO_MODE_BATTLE_ONLY: EvolutionMode = 7;
pub type EvolutionMode = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Coords8 {
    pub x: s8,
    pub y: s8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Coords8"][::core::mem::size_of::<Coords8>() - 2usize];
    ["Alignment of Coords8"][::core::mem::align_of::<Coords8>() - 1usize];
    ["Offset of field: Coords8::x"][::core::mem::offset_of!(Coords8, x) - 0usize];
    ["Offset of field: Coords8::y"][::core::mem::offset_of!(Coords8, y) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UCoords8 {
    pub x: u8_,
    pub y: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UCoords8"][::core::mem::size_of::<UCoords8>() - 2usize];
    ["Alignment of UCoords8"][::core::mem::align_of::<UCoords8>() - 1usize];
    ["Offset of field: UCoords8::x"][::core::mem::offset_of!(UCoords8, x) - 0usize];
    ["Offset of field: UCoords8::y"][::core::mem::offset_of!(UCoords8, y) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Coords16 {
    pub x: s16,
    pub y: s16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Coords16"][::core::mem::size_of::<Coords16>() - 4usize];
    ["Alignment of Coords16"][::core::mem::align_of::<Coords16>() - 2usize];
    ["Offset of field: Coords16::x"][::core::mem::offset_of!(Coords16, x) - 0usize];
    ["Offset of field: Coords16::y"][::core::mem::offset_of!(Coords16, y) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UCoords16 {
    pub x: u16_,
    pub y: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UCoords16"][::core::mem::size_of::<UCoords16>() - 4usize];
    ["Alignment of UCoords16"][::core::mem::align_of::<UCoords16>() - 2usize];
    ["Offset of field: UCoords16::x"][::core::mem::offset_of!(UCoords16, x) - 0usize];
    ["Offset of field: UCoords16::y"][::core::mem::offset_of!(UCoords16, y) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Coords32 {
    pub x: s32,
    pub y: s32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Coords32"][::core::mem::size_of::<Coords32>() - 8usize];
    ["Alignment of Coords32"][::core::mem::align_of::<Coords32>() - 4usize];
    ["Offset of field: Coords32::x"][::core::mem::offset_of!(Coords32, x) - 0usize];
    ["Offset of field: Coords32::y"][::core::mem::offset_of!(Coords32, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct UCoords32 {
    pub x: u32_,
    pub y: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of UCoords32"][::core::mem::size_of::<UCoords32>() - 8usize];
    ["Alignment of UCoords32"][::core::mem::align_of::<UCoords32>() - 4usize];
    ["Offset of field: UCoords32::x"][::core::mem::offset_of!(UCoords32, x) - 0usize];
    ["Offset of field: UCoords32::y"][::core::mem::offset_of!(UCoords32, y) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Time {
    pub days: s16,
    pub hours: s8,
    pub minutes: s8,
    pub seconds: s8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Time"][::core::mem::size_of::<Time>() - 6usize];
    ["Alignment of Time"][::core::mem::align_of::<Time>() - 2usize];
    ["Offset of field: Time::days"][::core::mem::offset_of!(Time, days) - 0usize];
    ["Offset of field: Time::hours"][::core::mem::offset_of!(Time, hours) - 2usize];
    ["Offset of field: Time::minutes"][::core::mem::offset_of!(Time, minutes) - 3usize];
    ["Offset of field: Time::seconds"][::core::mem::offset_of!(Time, seconds) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SaveBlock3 {
    pub test: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SaveBlock3"][::core::mem::size_of::<SaveBlock3>() - 1usize];
    ["Alignment of SaveBlock3"][::core::mem::align_of::<SaveBlock3>() - 1usize];
    ["Offset of field: SaveBlock3::test"][::core::mem::offset_of!(SaveBlock3, test) - 0usize];
};
unsafe extern "C" {
    pub static mut gSaveBlock3Ptr: *mut SaveBlock3;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Pokedex {
    pub order: u8_,
    pub mode: u8_,
    pub nationalMagic: u8_,
    pub unknown2: u8_,
    pub unownPersonality: u32_,
    pub spindaPersonality: u32_,
    pub unknown3: u32_,
    pub filler: [u8_; 104usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Pokedex"][::core::mem::size_of::<Pokedex>() - 120usize];
    ["Alignment of Pokedex"][::core::mem::align_of::<Pokedex>() - 4usize];
    ["Offset of field: Pokedex::order"][::core::mem::offset_of!(Pokedex, order) - 0usize];
    ["Offset of field: Pokedex::mode"][::core::mem::offset_of!(Pokedex, mode) - 1usize];
    ["Offset of field: Pokedex::nationalMagic"]
        [::core::mem::offset_of!(Pokedex, nationalMagic) - 2usize];
    ["Offset of field: Pokedex::unknown2"][::core::mem::offset_of!(Pokedex, unknown2) - 3usize];
    ["Offset of field: Pokedex::unownPersonality"]
        [::core::mem::offset_of!(Pokedex, unownPersonality) - 4usize];
    ["Offset of field: Pokedex::spindaPersonality"]
        [::core::mem::offset_of!(Pokedex, spindaPersonality) - 8usize];
    ["Offset of field: Pokedex::unknown3"][::core::mem::offset_of!(Pokedex, unknown3) - 12usize];
    ["Offset of field: Pokedex::filler"][::core::mem::offset_of!(Pokedex, filler) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PokemonJumpRecords {
    pub jumpsInRow: u16_,
    pub unused1: u16_,
    pub excellentsInRow: u16_,
    pub gamesWithMaxPlayers: u16_,
    pub unused2: u32_,
    pub bestJumpScore: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PokemonJumpRecords"][::core::mem::size_of::<PokemonJumpRecords>() - 16usize];
    ["Alignment of PokemonJumpRecords"][::core::mem::align_of::<PokemonJumpRecords>() - 4usize];
    ["Offset of field: PokemonJumpRecords::jumpsInRow"]
        [::core::mem::offset_of!(PokemonJumpRecords, jumpsInRow) - 0usize];
    ["Offset of field: PokemonJumpRecords::unused1"]
        [::core::mem::offset_of!(PokemonJumpRecords, unused1) - 2usize];
    ["Offset of field: PokemonJumpRecords::excellentsInRow"]
        [::core::mem::offset_of!(PokemonJumpRecords, excellentsInRow) - 4usize];
    ["Offset of field: PokemonJumpRecords::gamesWithMaxPlayers"]
        [::core::mem::offset_of!(PokemonJumpRecords, gamesWithMaxPlayers) - 6usize];
    ["Offset of field: PokemonJumpRecords::unused2"]
        [::core::mem::offset_of!(PokemonJumpRecords, unused2) - 8usize];
    ["Offset of field: PokemonJumpRecords::bestJumpScore"]
        [::core::mem::offset_of!(PokemonJumpRecords, bestJumpScore) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BerryPickingResults {
    pub bestScore: u32_,
    pub berriesPicked: u16_,
    pub berriesPickedInRow: u16_,
    pub field_8: u8_,
    pub field_9: u8_,
    pub field_A: u8_,
    pub field_B: u8_,
    pub field_C: u8_,
    pub field_D: u8_,
    pub field_E: u8_,
    pub field_F: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BerryPickingResults"][::core::mem::size_of::<BerryPickingResults>() - 16usize];
    ["Alignment of BerryPickingResults"][::core::mem::align_of::<BerryPickingResults>() - 4usize];
    ["Offset of field: BerryPickingResults::bestScore"]
        [::core::mem::offset_of!(BerryPickingResults, bestScore) - 0usize];
    ["Offset of field: BerryPickingResults::berriesPicked"]
        [::core::mem::offset_of!(BerryPickingResults, berriesPicked) - 4usize];
    ["Offset of field: BerryPickingResults::berriesPickedInRow"]
        [::core::mem::offset_of!(BerryPickingResults, berriesPickedInRow) - 6usize];
    ["Offset of field: BerryPickingResults::field_8"]
        [::core::mem::offset_of!(BerryPickingResults, field_8) - 8usize];
    ["Offset of field: BerryPickingResults::field_9"]
        [::core::mem::offset_of!(BerryPickingResults, field_9) - 9usize];
    ["Offset of field: BerryPickingResults::field_A"]
        [::core::mem::offset_of!(BerryPickingResults, field_A) - 10usize];
    ["Offset of field: BerryPickingResults::field_B"]
        [::core::mem::offset_of!(BerryPickingResults, field_B) - 11usize];
    ["Offset of field: BerryPickingResults::field_C"]
        [::core::mem::offset_of!(BerryPickingResults, field_C) - 12usize];
    ["Offset of field: BerryPickingResults::field_D"]
        [::core::mem::offset_of!(BerryPickingResults, field_D) - 13usize];
    ["Offset of field: BerryPickingResults::field_E"]
        [::core::mem::offset_of!(BerryPickingResults, field_E) - 14usize];
    ["Offset of field: BerryPickingResults::field_F"]
        [::core::mem::offset_of!(BerryPickingResults, field_F) - 15usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PyramidBag {
    pub itemId: [[u16_; 10usize]; 2usize],
    pub quantity: [[u8_; 10usize]; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PyramidBag"][::core::mem::size_of::<PyramidBag>() - 60usize];
    ["Alignment of PyramidBag"][::core::mem::align_of::<PyramidBag>() - 2usize];
    ["Offset of field: PyramidBag::itemId"][::core::mem::offset_of!(PyramidBag, itemId) - 0usize];
    ["Offset of field: PyramidBag::quantity"]
        [::core::mem::offset_of!(PyramidBag, quantity) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BerryCrush {
    pub pressingSpeeds: [u16_; 4usize],
    pub berryPowderAmount: u32_,
    pub unk: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BerryCrush"][::core::mem::size_of::<BerryCrush>() - 16usize];
    ["Alignment of BerryCrush"][::core::mem::align_of::<BerryCrush>() - 4usize];
    ["Offset of field: BerryCrush::pressingSpeeds"]
        [::core::mem::offset_of!(BerryCrush, pressingSpeeds) - 0usize];
    ["Offset of field: BerryCrush::berryPowderAmount"]
        [::core::mem::offset_of!(BerryCrush, berryPowderAmount) - 8usize];
    ["Offset of field: BerryCrush::unk"][::core::mem::offset_of!(BerryCrush, unk) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ApprenticeMon {
    pub species: u16_,
    pub moves: [u16_; 4usize],
    pub item: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ApprenticeMon"][::core::mem::size_of::<ApprenticeMon>() - 12usize];
    ["Alignment of ApprenticeMon"][::core::mem::align_of::<ApprenticeMon>() - 2usize];
    ["Offset of field: ApprenticeMon::species"]
        [::core::mem::offset_of!(ApprenticeMon, species) - 0usize];
    ["Offset of field: ApprenticeMon::moves"]
        [::core::mem::offset_of!(ApprenticeMon, moves) - 2usize];
    ["Offset of field: ApprenticeMon::item"]
        [::core::mem::offset_of!(ApprenticeMon, item) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Apprentice {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub numQuestions: u8_,
    pub number: u8_,
    pub party: [ApprenticeMon; 3usize],
    pub speechWon: [u16_; 6usize],
    pub playerId: [u8_; 4usize],
    pub playerName: [u8_; 7usize],
    pub language: u8_,
    pub checksum: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Apprentice"][::core::mem::size_of::<Apprentice>() - 68usize];
    ["Alignment of Apprentice"][::core::mem::align_of::<Apprentice>() - 4usize];
    ["Offset of field: Apprentice::numQuestions"]
        [::core::mem::offset_of!(Apprentice, numQuestions) - 1usize];
    ["Offset of field: Apprentice::number"][::core::mem::offset_of!(Apprentice, number) - 2usize];
    ["Offset of field: Apprentice::party"][::core::mem::offset_of!(Apprentice, party) - 4usize];
    ["Offset of field: Apprentice::speechWon"]
        [::core::mem::offset_of!(Apprentice, speechWon) - 40usize];
    ["Offset of field: Apprentice::playerId"]
        [::core::mem::offset_of!(Apprentice, playerId) - 52usize];
    ["Offset of field: Apprentice::playerName"]
        [::core::mem::offset_of!(Apprentice, playerName) - 56usize];
    ["Offset of field: Apprentice::language"]
        [::core::mem::offset_of!(Apprentice, language) - 63usize];
    ["Offset of field: Apprentice::checksum"]
        [::core::mem::offset_of!(Apprentice, checksum) - 64usize];
};
impl Apprentice {
    #[inline]
    pub fn id(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_id(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn id_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                5u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_id_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn lvlMode(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_lvlMode(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn lvlMode_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_lvlMode_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(id: u8_, lvlMode: u8_) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let id: u8 = unsafe { ::core::mem::transmute(id) };
            id as u64
        });
        __bindgen_bitfield_unit.set(5usize, 2u8, {
            let lvlMode: u8 = unsafe { ::core::mem::transmute(lvlMode) };
            lvlMode as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BattleTowerPokemon {
    pub species: u16_,
    pub heldItem: u16_,
    pub moves: [u16_; 4usize],
    pub level: u8_,
    pub ppBonuses: u8_,
    pub hpEV: u8_,
    pub attackEV: u8_,
    pub defenseEV: u8_,
    pub speedEV: u8_,
    pub spAttackEV: u8_,
    pub spDefenseEV: u8_,
    pub otId: u32_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub personality: u32_,
    pub nickname: [u8_; 11usize],
    pub friendship: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BattleTowerPokemon"][::core::mem::size_of::<BattleTowerPokemon>() - 44usize];
    ["Alignment of BattleTowerPokemon"][::core::mem::align_of::<BattleTowerPokemon>() - 4usize];
    ["Offset of field: BattleTowerPokemon::species"]
        [::core::mem::offset_of!(BattleTowerPokemon, species) - 0usize];
    ["Offset of field: BattleTowerPokemon::heldItem"]
        [::core::mem::offset_of!(BattleTowerPokemon, heldItem) - 2usize];
    ["Offset of field: BattleTowerPokemon::moves"]
        [::core::mem::offset_of!(BattleTowerPokemon, moves) - 4usize];
    ["Offset of field: BattleTowerPokemon::level"]
        [::core::mem::offset_of!(BattleTowerPokemon, level) - 12usize];
    ["Offset of field: BattleTowerPokemon::ppBonuses"]
        [::core::mem::offset_of!(BattleTowerPokemon, ppBonuses) - 13usize];
    ["Offset of field: BattleTowerPokemon::hpEV"]
        [::core::mem::offset_of!(BattleTowerPokemon, hpEV) - 14usize];
    ["Offset of field: BattleTowerPokemon::attackEV"]
        [::core::mem::offset_of!(BattleTowerPokemon, attackEV) - 15usize];
    ["Offset of field: BattleTowerPokemon::defenseEV"]
        [::core::mem::offset_of!(BattleTowerPokemon, defenseEV) - 16usize];
    ["Offset of field: BattleTowerPokemon::speedEV"]
        [::core::mem::offset_of!(BattleTowerPokemon, speedEV) - 17usize];
    ["Offset of field: BattleTowerPokemon::spAttackEV"]
        [::core::mem::offset_of!(BattleTowerPokemon, spAttackEV) - 18usize];
    ["Offset of field: BattleTowerPokemon::spDefenseEV"]
        [::core::mem::offset_of!(BattleTowerPokemon, spDefenseEV) - 19usize];
    ["Offset of field: BattleTowerPokemon::otId"]
        [::core::mem::offset_of!(BattleTowerPokemon, otId) - 20usize];
    ["Offset of field: BattleTowerPokemon::personality"]
        [::core::mem::offset_of!(BattleTowerPokemon, personality) - 28usize];
    ["Offset of field: BattleTowerPokemon::nickname"]
        [::core::mem::offset_of!(BattleTowerPokemon, nickname) - 32usize];
    ["Offset of field: BattleTowerPokemon::friendship"]
        [::core::mem::offset_of!(BattleTowerPokemon, friendship) - 43usize];
};
impl BattleTowerPokemon {
    #[inline]
    pub fn hpIV(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_hpIV(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hpIV_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                5u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_hpIV_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn attackIV(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_attackIV(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn attackIV_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                5u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_attackIV_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn defenseIV(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_defenseIV(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn defenseIV_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                5u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_defenseIV_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn speedIV(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_speedIV(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn speedIV_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                5u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_speedIV_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn spAttackIV(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_spAttackIV(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn spAttackIV_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                5u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_spAttackIV_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn spDefenseIV(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_spDefenseIV(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn spDefenseIV_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                25usize,
                5u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_spDefenseIV_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                25usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn gap(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_gap(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn gap_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                30usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_gap_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn abilityNum(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_abilityNum(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn abilityNum_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                31usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_abilityNum_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        hpIV: u32_,
        attackIV: u32_,
        defenseIV: u32_,
        speedIV: u32_,
        spAttackIV: u32_,
        spDefenseIV: u32_,
        gap: u32_,
        abilityNum: u32_,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 5u8, {
            let hpIV: u32 = unsafe { ::core::mem::transmute(hpIV) };
            hpIV as u64
        });
        __bindgen_bitfield_unit.set(5usize, 5u8, {
            let attackIV: u32 = unsafe { ::core::mem::transmute(attackIV) };
            attackIV as u64
        });
        __bindgen_bitfield_unit.set(10usize, 5u8, {
            let defenseIV: u32 = unsafe { ::core::mem::transmute(defenseIV) };
            defenseIV as u64
        });
        __bindgen_bitfield_unit.set(15usize, 5u8, {
            let speedIV: u32 = unsafe { ::core::mem::transmute(speedIV) };
            speedIV as u64
        });
        __bindgen_bitfield_unit.set(20usize, 5u8, {
            let spAttackIV: u32 = unsafe { ::core::mem::transmute(spAttackIV) };
            spAttackIV as u64
        });
        __bindgen_bitfield_unit.set(25usize, 5u8, {
            let spDefenseIV: u32 = unsafe { ::core::mem::transmute(spDefenseIV) };
            spDefenseIV as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let gap: u32 = unsafe { ::core::mem::transmute(gap) };
            gap as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let abilityNum: u32 = unsafe { ::core::mem::transmute(abilityNum) };
            abilityNum as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EmeraldBattleTowerRecord {
    pub lvlMode: u8_,
    pub facilityClass: u8_,
    pub winStreak: u16_,
    pub name: [u8_; 8usize],
    pub trainerId: [u8_; 4usize],
    pub greeting: [u16_; 6usize],
    pub speechWon: [u16_; 6usize],
    pub speechLost: [u16_; 6usize],
    pub party: [BattleTowerPokemon; 4usize],
    pub language: u8_,
    pub checksum: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of EmeraldBattleTowerRecord"]
        [::core::mem::size_of::<EmeraldBattleTowerRecord>() - 236usize];
    ["Alignment of EmeraldBattleTowerRecord"]
        [::core::mem::align_of::<EmeraldBattleTowerRecord>() - 4usize];
    ["Offset of field: EmeraldBattleTowerRecord::lvlMode"]
        [::core::mem::offset_of!(EmeraldBattleTowerRecord, lvlMode) - 0usize];
    ["Offset of field: EmeraldBattleTowerRecord::facilityClass"]
        [::core::mem::offset_of!(EmeraldBattleTowerRecord, facilityClass) - 1usize];
    ["Offset of field: EmeraldBattleTowerRecord::winStreak"]
        [::core::mem::offset_of!(EmeraldBattleTowerRecord, winStreak) - 2usize];
    ["Offset of field: EmeraldBattleTowerRecord::name"]
        [::core::mem::offset_of!(EmeraldBattleTowerRecord, name) - 4usize];
    ["Offset of field: EmeraldBattleTowerRecord::trainerId"]
        [::core::mem::offset_of!(EmeraldBattleTowerRecord, trainerId) - 12usize];
    ["Offset of field: EmeraldBattleTowerRecord::greeting"]
        [::core::mem::offset_of!(EmeraldBattleTowerRecord, greeting) - 16usize];
    ["Offset of field: EmeraldBattleTowerRecord::speechWon"]
        [::core::mem::offset_of!(EmeraldBattleTowerRecord, speechWon) - 28usize];
    ["Offset of field: EmeraldBattleTowerRecord::speechLost"]
        [::core::mem::offset_of!(EmeraldBattleTowerRecord, speechLost) - 40usize];
    ["Offset of field: EmeraldBattleTowerRecord::party"]
        [::core::mem::offset_of!(EmeraldBattleTowerRecord, party) - 52usize];
    ["Offset of field: EmeraldBattleTowerRecord::language"]
        [::core::mem::offset_of!(EmeraldBattleTowerRecord, language) - 228usize];
    ["Offset of field: EmeraldBattleTowerRecord::checksum"]
        [::core::mem::offset_of!(EmeraldBattleTowerRecord, checksum) - 232usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BattleTowerInterview {
    pub playerSpecies: u16_,
    pub opponentSpecies: u16_,
    pub opponentName: [u8_; 8usize],
    pub opponentMonNickname: [u8_; 11usize],
    pub opponentLanguage: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BattleTowerInterview"][::core::mem::size_of::<BattleTowerInterview>() - 24usize];
    ["Alignment of BattleTowerInterview"][::core::mem::align_of::<BattleTowerInterview>() - 2usize];
    ["Offset of field: BattleTowerInterview::playerSpecies"]
        [::core::mem::offset_of!(BattleTowerInterview, playerSpecies) - 0usize];
    ["Offset of field: BattleTowerInterview::opponentSpecies"]
        [::core::mem::offset_of!(BattleTowerInterview, opponentSpecies) - 2usize];
    ["Offset of field: BattleTowerInterview::opponentName"]
        [::core::mem::offset_of!(BattleTowerInterview, opponentName) - 4usize];
    ["Offset of field: BattleTowerInterview::opponentMonNickname"]
        [::core::mem::offset_of!(BattleTowerInterview, opponentMonNickname) - 12usize];
    ["Offset of field: BattleTowerInterview::opponentLanguage"]
        [::core::mem::offset_of!(BattleTowerInterview, opponentLanguage) - 23usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BattleTowerEReaderTrainer {
    pub unk0: u8_,
    pub facilityClass: u8_,
    pub winStreak: u16_,
    pub name: [u8_; 8usize],
    pub trainerId: [u8_; 4usize],
    pub greeting: [u16_; 6usize],
    pub farewellPlayerLost: [u16_; 6usize],
    pub farewellPlayerWon: [u16_; 6usize],
    pub party: [BattleTowerPokemon; 3usize],
    pub checksum: u32_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BattleTowerEReaderTrainer"]
        [::core::mem::size_of::<BattleTowerEReaderTrainer>() - 188usize];
    ["Alignment of BattleTowerEReaderTrainer"]
        [::core::mem::align_of::<BattleTowerEReaderTrainer>() - 4usize];
    ["Offset of field: BattleTowerEReaderTrainer::unk0"]
        [::core::mem::offset_of!(BattleTowerEReaderTrainer, unk0) - 0usize];
    ["Offset of field: BattleTowerEReaderTrainer::facilityClass"]
        [::core::mem::offset_of!(BattleTowerEReaderTrainer, facilityClass) - 1usize];
    ["Offset of field: BattleTowerEReaderTrainer::winStreak"]
        [::core::mem::offset_of!(BattleTowerEReaderTrainer, winStreak) - 2usize];
    ["Offset of field: BattleTowerEReaderTrainer::name"]
        [::core::mem::offset_of!(BattleTowerEReaderTrainer, name) - 4usize];
    ["Offset of field: BattleTowerEReaderTrainer::trainerId"]
        [::core::mem::offset_of!(BattleTowerEReaderTrainer, trainerId) - 12usize];
    ["Offset of field: BattleTowerEReaderTrainer::greeting"]
        [::core::mem::offset_of!(BattleTowerEReaderTrainer, greeting) - 16usize];
    ["Offset of field: BattleTowerEReaderTrainer::farewellPlayerLost"]
        [::core::mem::offset_of!(BattleTowerEReaderTrainer, farewellPlayerLost) - 28usize];
    ["Offset of field: BattleTowerEReaderTrainer::farewellPlayerWon"]
        [::core::mem::offset_of!(BattleTowerEReaderTrainer, farewellPlayerWon) - 40usize];
    ["Offset of field: BattleTowerEReaderTrainer::party"]
        [::core::mem::offset_of!(BattleTowerEReaderTrainer, party) - 52usize];
    ["Offset of field: BattleTowerEReaderTrainer::checksum"]
        [::core::mem::offset_of!(BattleTowerEReaderTrainer, checksum) - 184usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DomeMonData {
    pub moves: [u16_; 4usize],
    pub evs: [u8_; 6usize],
    pub nature: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DomeMonData"][::core::mem::size_of::<DomeMonData>() - 16usize];
    ["Alignment of DomeMonData"][::core::mem::align_of::<DomeMonData>() - 2usize];
    ["Offset of field: DomeMonData::moves"][::core::mem::offset_of!(DomeMonData, moves) - 0usize];
    ["Offset of field: DomeMonData::evs"][::core::mem::offset_of!(DomeMonData, evs) - 8usize];
    ["Offset of field: DomeMonData::nature"]
        [::core::mem::offset_of!(DomeMonData, nature) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RentalMon {
    pub monId: u16_,
    pub personality: u32_,
    pub ivs: u8_,
    pub abilityNum: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RentalMon"][::core::mem::size_of::<RentalMon>() - 12usize];
    ["Alignment of RentalMon"][::core::mem::align_of::<RentalMon>() - 4usize];
    ["Offset of field: RentalMon::monId"][::core::mem::offset_of!(RentalMon, monId) - 0usize];
    ["Offset of field: RentalMon::personality"]
        [::core::mem::offset_of!(RentalMon, personality) - 4usize];
    ["Offset of field: RentalMon::ivs"][::core::mem::offset_of!(RentalMon, ivs) - 8usize];
    ["Offset of field: RentalMon::abilityNum"]
        [::core::mem::offset_of!(RentalMon, abilityNum) - 9usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BattleDomeTrainer {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BattleDomeTrainer"][::core::mem::size_of::<BattleDomeTrainer>() - 2usize];
    ["Alignment of BattleDomeTrainer"][::core::mem::align_of::<BattleDomeTrainer>() - 2usize];
};
impl BattleDomeTrainer {
    #[inline]
    pub fn trainerId(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 10u8) as u16) }
    }
    #[inline]
    pub fn set_trainerId(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn trainerId_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                10u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_trainerId_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                10u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn isEliminated(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_isEliminated(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn isEliminated_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_isEliminated_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn eliminatedAt(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 2u8) as u16) }
    }
    #[inline]
    pub fn set_eliminatedAt(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn eliminatedAt_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                2u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_eliminatedAt_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn forfeited(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_forfeited(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn forfeited_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                3u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_forfeited_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        trainerId: u16_,
        isEliminated: u16_,
        eliminatedAt: u16_,
        forfeited: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 10u8, {
            let trainerId: u16 = unsafe { ::core::mem::transmute(trainerId) };
            trainerId as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let isEliminated: u16 = unsafe { ::core::mem::transmute(isEliminated) };
            isEliminated as u64
        });
        __bindgen_bitfield_unit.set(11usize, 2u8, {
            let eliminatedAt: u16 = unsafe { ::core::mem::transmute(eliminatedAt) };
            eliminatedAt as u64
        });
        __bindgen_bitfield_unit.set(13usize, 3u8, {
            let forfeited: u16 = unsafe { ::core::mem::transmute(forfeited) };
            forfeited as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BattleFrontier {
    pub towerPlayer: EmeraldBattleTowerRecord,
    pub towerRecords: [EmeraldBattleTowerRecord; 5usize],
    pub towerInterview: BattleTowerInterview,
    pub ereaderTrainer: BattleTowerEReaderTrainer,
    pub challengeStatus: u8_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub selectedPartyMons: [u16_; 4usize],
    pub curChallengeBattleNum: u16_,
    pub trainerIds: [u16_; 20usize],
    pub winStreakActiveFlags: u32_,
    pub towerWinStreaks: [[u16_; 2usize]; 4usize],
    pub towerRecordWinStreaks: [[u16_; 2usize]; 4usize],
    pub battledBrainFlags: u16_,
    pub towerSinglesStreak: u16_,
    pub towerNumWins: u16_,
    pub towerBattleOutcome: u8_,
    pub towerLvlMode: u8_,
    pub _bitfield_align_2: [u8; 0],
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub domeUnused: u8_,
    pub domeLvlMode: u8_,
    pub domeBattleMode: u8_,
    pub domeWinStreaks: [[u16_; 2usize]; 2usize],
    pub domeRecordWinStreaks: [[u16_; 2usize]; 2usize],
    pub domeTotalChampionships: [[u16_; 2usize]; 2usize],
    pub domeTrainers: [BattleDomeTrainer; 16usize],
    pub domeMonIds: [[u16_; 3usize]; 16usize],
    pub unused_DC4: u16_,
    pub palacePrize: u16_,
    pub palaceWinStreaks: [[u16_; 2usize]; 2usize],
    pub palaceRecordWinStreaks: [[u16_; 2usize]; 2usize],
    pub arenaPrize: u16_,
    pub arenaWinStreaks: [u16_; 2usize],
    pub arenaRecordStreaks: [u16_; 2usize],
    pub factoryWinStreaks: [[u16_; 2usize]; 2usize],
    pub factoryRecordWinStreaks: [[u16_; 2usize]; 2usize],
    pub factoryRentsCount: [[u16_; 2usize]; 2usize],
    pub factoryRecordRentsCount: [[u16_; 2usize]; 2usize],
    pub pikePrize: u16_,
    pub pikeWinStreaks: [u16_; 2usize],
    pub pikeRecordStreaks: [u16_; 2usize],
    pub pikeTotalStreaks: [u16_; 2usize],
    pub _bitfield_align_3: [u8; 0],
    pub _bitfield_3: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub pikeHeldItemsBackup: [u16_; 3usize],
    pub pyramidPrize: u16_,
    pub pyramidWinStreaks: [u16_; 2usize],
    pub pyramidRecordStreaks: [u16_; 2usize],
    pub pyramidRandoms: [u16_; 4usize],
    pub pyramidTrainerFlags: u8_,
    pub pyramidBag: PyramidBag,
    pub pyramidLightRadius: u8_,
    pub verdanturfTentPrize: u16_,
    pub fallarborTentPrize: u16_,
    pub slateportTentPrize: u16_,
    pub rentalMons: [RentalMon; 6usize],
    pub battlePoints: u16_,
    pub cardBattlePoints: u16_,
    pub battlesCount: u32_,
    pub domeWinningMoves: [u16_; 16usize],
    pub trainerFlags: u8_,
    pub opponentNames: [[u8_; 8usize]; 2usize],
    pub opponentTrainerIds: [[u8_; 4usize]; 2usize],
    pub _bitfield_align_4: [u8; 0],
    pub _bitfield_4: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub unused_EFA: u8_,
    pub unused_EFB: u8_,
    pub domePlayerPartyData: [DomeMonData; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BattleFrontier"][::core::mem::size_of::<BattleFrontier>() - 2240usize];
    ["Alignment of BattleFrontier"][::core::mem::align_of::<BattleFrontier>() - 4usize];
    ["Offset of field: BattleFrontier::towerPlayer"]
        [::core::mem::offset_of!(BattleFrontier, towerPlayer) - 0usize];
    ["Offset of field: BattleFrontier::towerRecords"]
        [::core::mem::offset_of!(BattleFrontier, towerRecords) - 236usize];
    ["Offset of field: BattleFrontier::towerInterview"]
        [::core::mem::offset_of!(BattleFrontier, towerInterview) - 1416usize];
    ["Offset of field: BattleFrontier::ereaderTrainer"]
        [::core::mem::offset_of!(BattleFrontier, ereaderTrainer) - 1440usize];
    ["Offset of field: BattleFrontier::challengeStatus"]
        [::core::mem::offset_of!(BattleFrontier, challengeStatus) - 1628usize];
    ["Offset of field: BattleFrontier::selectedPartyMons"]
        [::core::mem::offset_of!(BattleFrontier, selectedPartyMons) - 1630usize];
    ["Offset of field: BattleFrontier::curChallengeBattleNum"]
        [::core::mem::offset_of!(BattleFrontier, curChallengeBattleNum) - 1638usize];
    ["Offset of field: BattleFrontier::trainerIds"]
        [::core::mem::offset_of!(BattleFrontier, trainerIds) - 1640usize];
    ["Offset of field: BattleFrontier::winStreakActiveFlags"]
        [::core::mem::offset_of!(BattleFrontier, winStreakActiveFlags) - 1680usize];
    ["Offset of field: BattleFrontier::towerWinStreaks"]
        [::core::mem::offset_of!(BattleFrontier, towerWinStreaks) - 1684usize];
    ["Offset of field: BattleFrontier::towerRecordWinStreaks"]
        [::core::mem::offset_of!(BattleFrontier, towerRecordWinStreaks) - 1700usize];
    ["Offset of field: BattleFrontier::battledBrainFlags"]
        [::core::mem::offset_of!(BattleFrontier, battledBrainFlags) - 1716usize];
    ["Offset of field: BattleFrontier::towerSinglesStreak"]
        [::core::mem::offset_of!(BattleFrontier, towerSinglesStreak) - 1718usize];
    ["Offset of field: BattleFrontier::towerNumWins"]
        [::core::mem::offset_of!(BattleFrontier, towerNumWins) - 1720usize];
    ["Offset of field: BattleFrontier::towerBattleOutcome"]
        [::core::mem::offset_of!(BattleFrontier, towerBattleOutcome) - 1722usize];
    ["Offset of field: BattleFrontier::towerLvlMode"]
        [::core::mem::offset_of!(BattleFrontier, towerLvlMode) - 1723usize];
    ["Offset of field: BattleFrontier::domeUnused"]
        [::core::mem::offset_of!(BattleFrontier, domeUnused) - 1725usize];
    ["Offset of field: BattleFrontier::domeLvlMode"]
        [::core::mem::offset_of!(BattleFrontier, domeLvlMode) - 1726usize];
    ["Offset of field: BattleFrontier::domeBattleMode"]
        [::core::mem::offset_of!(BattleFrontier, domeBattleMode) - 1727usize];
    ["Offset of field: BattleFrontier::domeWinStreaks"]
        [::core::mem::offset_of!(BattleFrontier, domeWinStreaks) - 1728usize];
    ["Offset of field: BattleFrontier::domeRecordWinStreaks"]
        [::core::mem::offset_of!(BattleFrontier, domeRecordWinStreaks) - 1736usize];
    ["Offset of field: BattleFrontier::domeTotalChampionships"]
        [::core::mem::offset_of!(BattleFrontier, domeTotalChampionships) - 1744usize];
    ["Offset of field: BattleFrontier::domeTrainers"]
        [::core::mem::offset_of!(BattleFrontier, domeTrainers) - 1752usize];
    ["Offset of field: BattleFrontier::domeMonIds"]
        [::core::mem::offset_of!(BattleFrontier, domeMonIds) - 1784usize];
    ["Offset of field: BattleFrontier::unused_DC4"]
        [::core::mem::offset_of!(BattleFrontier, unused_DC4) - 1880usize];
    ["Offset of field: BattleFrontier::palacePrize"]
        [::core::mem::offset_of!(BattleFrontier, palacePrize) - 1882usize];
    ["Offset of field: BattleFrontier::palaceWinStreaks"]
        [::core::mem::offset_of!(BattleFrontier, palaceWinStreaks) - 1884usize];
    ["Offset of field: BattleFrontier::palaceRecordWinStreaks"]
        [::core::mem::offset_of!(BattleFrontier, palaceRecordWinStreaks) - 1892usize];
    ["Offset of field: BattleFrontier::arenaPrize"]
        [::core::mem::offset_of!(BattleFrontier, arenaPrize) - 1900usize];
    ["Offset of field: BattleFrontier::arenaWinStreaks"]
        [::core::mem::offset_of!(BattleFrontier, arenaWinStreaks) - 1902usize];
    ["Offset of field: BattleFrontier::arenaRecordStreaks"]
        [::core::mem::offset_of!(BattleFrontier, arenaRecordStreaks) - 1906usize];
    ["Offset of field: BattleFrontier::factoryWinStreaks"]
        [::core::mem::offset_of!(BattleFrontier, factoryWinStreaks) - 1910usize];
    ["Offset of field: BattleFrontier::factoryRecordWinStreaks"]
        [::core::mem::offset_of!(BattleFrontier, factoryRecordWinStreaks) - 1918usize];
    ["Offset of field: BattleFrontier::factoryRentsCount"]
        [::core::mem::offset_of!(BattleFrontier, factoryRentsCount) - 1926usize];
    ["Offset of field: BattleFrontier::factoryRecordRentsCount"]
        [::core::mem::offset_of!(BattleFrontier, factoryRecordRentsCount) - 1934usize];
    ["Offset of field: BattleFrontier::pikePrize"]
        [::core::mem::offset_of!(BattleFrontier, pikePrize) - 1942usize];
    ["Offset of field: BattleFrontier::pikeWinStreaks"]
        [::core::mem::offset_of!(BattleFrontier, pikeWinStreaks) - 1944usize];
    ["Offset of field: BattleFrontier::pikeRecordStreaks"]
        [::core::mem::offset_of!(BattleFrontier, pikeRecordStreaks) - 1948usize];
    ["Offset of field: BattleFrontier::pikeTotalStreaks"]
        [::core::mem::offset_of!(BattleFrontier, pikeTotalStreaks) - 1952usize];
    ["Offset of field: BattleFrontier::pikeHeldItemsBackup"]
        [::core::mem::offset_of!(BattleFrontier, pikeHeldItemsBackup) - 1958usize];
    ["Offset of field: BattleFrontier::pyramidPrize"]
        [::core::mem::offset_of!(BattleFrontier, pyramidPrize) - 1964usize];
    ["Offset of field: BattleFrontier::pyramidWinStreaks"]
        [::core::mem::offset_of!(BattleFrontier, pyramidWinStreaks) - 1966usize];
    ["Offset of field: BattleFrontier::pyramidRecordStreaks"]
        [::core::mem::offset_of!(BattleFrontier, pyramidRecordStreaks) - 1970usize];
    ["Offset of field: BattleFrontier::pyramidRandoms"]
        [::core::mem::offset_of!(BattleFrontier, pyramidRandoms) - 1974usize];
    ["Offset of field: BattleFrontier::pyramidTrainerFlags"]
        [::core::mem::offset_of!(BattleFrontier, pyramidTrainerFlags) - 1982usize];
    ["Offset of field: BattleFrontier::pyramidBag"]
        [::core::mem::offset_of!(BattleFrontier, pyramidBag) - 1984usize];
    ["Offset of field: BattleFrontier::pyramidLightRadius"]
        [::core::mem::offset_of!(BattleFrontier, pyramidLightRadius) - 2044usize];
    ["Offset of field: BattleFrontier::verdanturfTentPrize"]
        [::core::mem::offset_of!(BattleFrontier, verdanturfTentPrize) - 2046usize];
    ["Offset of field: BattleFrontier::fallarborTentPrize"]
        [::core::mem::offset_of!(BattleFrontier, fallarborTentPrize) - 2048usize];
    ["Offset of field: BattleFrontier::slateportTentPrize"]
        [::core::mem::offset_of!(BattleFrontier, slateportTentPrize) - 2050usize];
    ["Offset of field: BattleFrontier::rentalMons"]
        [::core::mem::offset_of!(BattleFrontier, rentalMons) - 2052usize];
    ["Offset of field: BattleFrontier::battlePoints"]
        [::core::mem::offset_of!(BattleFrontier, battlePoints) - 2124usize];
    ["Offset of field: BattleFrontier::cardBattlePoints"]
        [::core::mem::offset_of!(BattleFrontier, cardBattlePoints) - 2126usize];
    ["Offset of field: BattleFrontier::battlesCount"]
        [::core::mem::offset_of!(BattleFrontier, battlesCount) - 2128usize];
    ["Offset of field: BattleFrontier::domeWinningMoves"]
        [::core::mem::offset_of!(BattleFrontier, domeWinningMoves) - 2132usize];
    ["Offset of field: BattleFrontier::trainerFlags"]
        [::core::mem::offset_of!(BattleFrontier, trainerFlags) - 2164usize];
    ["Offset of field: BattleFrontier::opponentNames"]
        [::core::mem::offset_of!(BattleFrontier, opponentNames) - 2165usize];
    ["Offset of field: BattleFrontier::opponentTrainerIds"]
        [::core::mem::offset_of!(BattleFrontier, opponentTrainerIds) - 2181usize];
    ["Offset of field: BattleFrontier::unused_EFA"]
        [::core::mem::offset_of!(BattleFrontier, unused_EFA) - 2190usize];
    ["Offset of field: BattleFrontier::unused_EFB"]
        [::core::mem::offset_of!(BattleFrontier, unused_EFB) - 2191usize];
    ["Offset of field: BattleFrontier::domePlayerPartyData"]
        [::core::mem::offset_of!(BattleFrontier, domePlayerPartyData) - 2192usize];
};
impl BattleFrontier {
    #[inline]
    pub fn lvlMode(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_lvlMode(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn lvlMode_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_lvlMode_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn challengePaused(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_challengePaused(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn challengePaused_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_challengePaused_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn disableRecordBattle(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_disableRecordBattle(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn disableRecordBattle_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_disableRecordBattle_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        lvlMode: u8_,
        challengePaused: u8_,
        disableRecordBattle: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let lvlMode: u8 = unsafe { ::core::mem::transmute(lvlMode) };
            lvlMode as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let challengePaused: u8 = unsafe { ::core::mem::transmute(challengePaused) };
            challengePaused as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let disableRecordBattle: u8 = unsafe { ::core::mem::transmute(disableRecordBattle) };
            disableRecordBattle as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn domeAttemptedSingles50(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_2.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeAttemptedSingles50(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_2.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn domeAttemptedSingles50_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_2),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_domeAttemptedSingles50_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_2),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn domeAttemptedSinglesOpen(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_2.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeAttemptedSinglesOpen(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_2.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn domeAttemptedSinglesOpen_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_2),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_domeAttemptedSinglesOpen_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_2),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn domeHasWonSingles50(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_2.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeHasWonSingles50(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_2.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn domeHasWonSingles50_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_2),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_domeHasWonSingles50_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_2),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn domeHasWonSinglesOpen(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_2.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeHasWonSinglesOpen(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_2.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn domeHasWonSinglesOpen_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_2),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_domeHasWonSinglesOpen_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_2),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn domeAttemptedDoubles50(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_2.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeAttemptedDoubles50(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_2.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn domeAttemptedDoubles50_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_2),
                4usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_domeAttemptedDoubles50_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_2),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn domeAttemptedDoublesOpen(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_2.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeAttemptedDoublesOpen(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_2.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn domeAttemptedDoublesOpen_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_2),
                5usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_domeAttemptedDoublesOpen_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_2),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn domeHasWonDoubles50(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_2.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeHasWonDoubles50(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_2.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn domeHasWonDoubles50_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_2),
                6usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_domeHasWonDoubles50_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_2),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn domeHasWonDoublesOpen(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_2.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_domeHasWonDoublesOpen(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_2.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn domeHasWonDoublesOpen_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_2),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_domeHasWonDoublesOpen_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_2),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_2(
        domeAttemptedSingles50: u8_,
        domeAttemptedSinglesOpen: u8_,
        domeHasWonSingles50: u8_,
        domeHasWonSinglesOpen: u8_,
        domeAttemptedDoubles50: u8_,
        domeAttemptedDoublesOpen: u8_,
        domeHasWonDoubles50: u8_,
        domeHasWonDoublesOpen: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let domeAttemptedSingles50: u8 =
                unsafe { ::core::mem::transmute(domeAttemptedSingles50) };
            domeAttemptedSingles50 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let domeAttemptedSinglesOpen: u8 =
                unsafe { ::core::mem::transmute(domeAttemptedSinglesOpen) };
            domeAttemptedSinglesOpen as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let domeHasWonSingles50: u8 = unsafe { ::core::mem::transmute(domeHasWonSingles50) };
            domeHasWonSingles50 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let domeHasWonSinglesOpen: u8 =
                unsafe { ::core::mem::transmute(domeHasWonSinglesOpen) };
            domeHasWonSinglesOpen as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let domeAttemptedDoubles50: u8 =
                unsafe { ::core::mem::transmute(domeAttemptedDoubles50) };
            domeAttemptedDoubles50 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let domeAttemptedDoublesOpen: u8 =
                unsafe { ::core::mem::transmute(domeAttemptedDoublesOpen) };
            domeAttemptedDoublesOpen as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let domeHasWonDoubles50: u8 = unsafe { ::core::mem::transmute(domeHasWonDoubles50) };
            domeHasWonDoubles50 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let domeHasWonDoublesOpen: u8 =
                unsafe { ::core::mem::transmute(domeHasWonDoublesOpen) };
            domeHasWonDoublesOpen as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn pikeHintedRoomIndex(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_3.get(0usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_pikeHintedRoomIndex(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_3.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn pikeHintedRoomIndex_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_3),
                0usize,
                3u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_pikeHintedRoomIndex_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_3),
                0usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn pikeHintedRoomType(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_3.get(3usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_pikeHintedRoomType(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_3.set(3usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn pikeHintedRoomType_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_3),
                3usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_pikeHintedRoomType_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_3),
                3usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn pikeHealingRoomsDisabled(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_3.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pikeHealingRoomsDisabled(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_3.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn pikeHealingRoomsDisabled_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_3),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_pikeHealingRoomsDisabled_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_3),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_3(
        pikeHintedRoomIndex: u8_,
        pikeHintedRoomType: u8_,
        pikeHealingRoomsDisabled: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let pikeHintedRoomIndex: u8 = unsafe { ::core::mem::transmute(pikeHintedRoomIndex) };
            pikeHintedRoomIndex as u64
        });
        __bindgen_bitfield_unit.set(3usize, 4u8, {
            let pikeHintedRoomType: u8 = unsafe { ::core::mem::transmute(pikeHintedRoomType) };
            pikeHintedRoomType as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let pikeHealingRoomsDisabled: u8 =
                unsafe { ::core::mem::transmute(pikeHealingRoomsDisabled) };
            pikeHealingRoomsDisabled as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn unk_EF9(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_4.get(0usize, 7u8) as u8) }
    }
    #[inline]
    pub fn set_unk_EF9(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_4.set(0usize, 7u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn unk_EF9_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_4),
                0usize,
                7u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_unk_EF9_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_4),
                0usize,
                7u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn savedGame(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_4.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_savedGame(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_4.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn savedGame_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_4),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_savedGame_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_4),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_4(unk_EF9: u8_, savedGame: u8_) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 7u8, {
            let unk_EF9: u8 = unsafe { ::core::mem::transmute(unk_EF9) };
            unk_EF9 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let savedGame: u8 = unsafe { ::core::mem::transmute(savedGame) };
            savedGame as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ApprenticeQuestion {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub data: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ApprenticeQuestion"][::core::mem::size_of::<ApprenticeQuestion>() - 4usize];
    ["Alignment of ApprenticeQuestion"][::core::mem::align_of::<ApprenticeQuestion>() - 2usize];
    ["Offset of field: ApprenticeQuestion::data"]
        [::core::mem::offset_of!(ApprenticeQuestion, data) - 2usize];
};
impl ApprenticeQuestion {
    #[inline]
    pub fn questionId(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_questionId(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn questionId_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_questionId_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn monId(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_monId(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn monId_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_monId_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn moveSlot(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_moveSlot(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn moveSlot_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_moveSlot_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn suggestedChange(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_suggestedChange(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn suggestedChange_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_suggestedChange_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        questionId: u8_,
        monId: u8_,
        moveSlot: u8_,
        suggestedChange: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let questionId: u8 = unsafe { ::core::mem::transmute(questionId) };
            questionId as u64
        });
        __bindgen_bitfield_unit.set(2usize, 2u8, {
            let monId: u8 = unsafe { ::core::mem::transmute(monId) };
            monId as u64
        });
        __bindgen_bitfield_unit.set(4usize, 2u8, {
            let moveSlot: u8 = unsafe { ::core::mem::transmute(moveSlot) };
            moveSlot as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let suggestedChange: u8 = unsafe { ::core::mem::transmute(suggestedChange) };
            suggestedChange as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PlayersApprentice {
    pub id: u8_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub unused: u8_,
    pub speciesIds: [u8_; 3usize],
    pub questions: [ApprenticeQuestion; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of PlayersApprentice"][::core::mem::size_of::<PlayersApprentice>() - 44usize];
    ["Alignment of PlayersApprentice"][::core::mem::align_of::<PlayersApprentice>() - 2usize];
    ["Offset of field: PlayersApprentice::id"]
        [::core::mem::offset_of!(PlayersApprentice, id) - 0usize];
    ["Offset of field: PlayersApprentice::unused"]
        [::core::mem::offset_of!(PlayersApprentice, unused) - 3usize];
    ["Offset of field: PlayersApprentice::speciesIds"]
        [::core::mem::offset_of!(PlayersApprentice, speciesIds) - 4usize];
    ["Offset of field: PlayersApprentice::questions"]
        [::core::mem::offset_of!(PlayersApprentice, questions) - 8usize];
};
impl PlayersApprentice {
    #[inline]
    pub fn lvlMode(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_lvlMode(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn lvlMode_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_lvlMode_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn questionsAnswered(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_questionsAnswered(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn questionsAnswered_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_questionsAnswered_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn leadMonId(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_leadMonId(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn leadMonId_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_leadMonId_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn party(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_party(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn party_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                3u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_party_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn saveId(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_saveId(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn saveId_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_saveId_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        lvlMode: u8_,
        questionsAnswered: u8_,
        leadMonId: u8_,
        party: u8_,
        saveId: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 2u8, {
            let lvlMode: u8 = unsafe { ::core::mem::transmute(lvlMode) };
            lvlMode as u64
        });
        __bindgen_bitfield_unit.set(2usize, 4u8, {
            let questionsAnswered: u8 = unsafe { ::core::mem::transmute(questionsAnswered) };
            questionsAnswered as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let leadMonId: u8 = unsafe { ::core::mem::transmute(leadMonId) };
            leadMonId as u64
        });
        __bindgen_bitfield_unit.set(8usize, 3u8, {
            let party: u8 = unsafe { ::core::mem::transmute(party) };
            party as u64
        });
        __bindgen_bitfield_unit.set(11usize, 2u8, {
            let saveId: u8 = unsafe { ::core::mem::transmute(saveId) };
            saveId as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RankingHall1P {
    pub id: [u8_; 4usize],
    pub winStreak: u16_,
    pub name: [u8_; 8usize],
    pub language: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RankingHall1P"][::core::mem::size_of::<RankingHall1P>() - 16usize];
    ["Alignment of RankingHall1P"][::core::mem::align_of::<RankingHall1P>() - 2usize];
    ["Offset of field: RankingHall1P::id"][::core::mem::offset_of!(RankingHall1P, id) - 0usize];
    ["Offset of field: RankingHall1P::winStreak"]
        [::core::mem::offset_of!(RankingHall1P, winStreak) - 4usize];
    ["Offset of field: RankingHall1P::name"][::core::mem::offset_of!(RankingHall1P, name) - 6usize];
    ["Offset of field: RankingHall1P::language"]
        [::core::mem::offset_of!(RankingHall1P, language) - 14usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RankingHall2P {
    pub id1: [u8_; 4usize],
    pub id2: [u8_; 4usize],
    pub winStreak: u16_,
    pub name1: [u8_; 8usize],
    pub name2: [u8_; 8usize],
    pub language: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RankingHall2P"][::core::mem::size_of::<RankingHall2P>() - 28usize];
    ["Alignment of RankingHall2P"][::core::mem::align_of::<RankingHall2P>() - 2usize];
    ["Offset of field: RankingHall2P::id1"][::core::mem::offset_of!(RankingHall2P, id1) - 0usize];
    ["Offset of field: RankingHall2P::id2"][::core::mem::offset_of!(RankingHall2P, id2) - 4usize];
    ["Offset of field: RankingHall2P::winStreak"]
        [::core::mem::offset_of!(RankingHall2P, winStreak) - 8usize];
    ["Offset of field: RankingHall2P::name1"]
        [::core::mem::offset_of!(RankingHall2P, name1) - 10usize];
    ["Offset of field: RankingHall2P::name2"]
        [::core::mem::offset_of!(RankingHall2P, name2) - 18usize];
    ["Offset of field: RankingHall2P::language"]
        [::core::mem::offset_of!(RankingHall2P, language) - 26usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SaveBlock2 {
    pub playerName: [u8_; 8usize],
    pub playerGender: u8_,
    pub specialSaveWarpFlags: u8_,
    pub playerTrainerId: [u8_; 4usize],
    pub playTimeHours: u16_,
    pub playTimeMinutes: u8_,
    pub playTimeSeconds: u8_,
    pub playTimeVBlanks: u8_,
    pub optionsButtonMode: u8_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub pokedex: Pokedex,
    pub filler_90: [u8_; 8usize],
    pub localTimeOffset: Time,
    pub lastBerryTreeUpdate: Time,
    pub gcnLinkFlags: u32_,
    pub encryptionKey: u32_,
    pub playerApprentice: PlayersApprentice,
    pub apprentices: [Apprentice; 4usize],
    pub berryCrush: BerryCrush,
    pub pokeJump: PokemonJumpRecords,
    pub berryPick: BerryPickingResults,
    pub hallRecords1P: [[[RankingHall1P; 3usize]; 2usize]; 9usize],
    pub hallRecords2P: [[RankingHall2P; 3usize]; 2usize],
    pub contestLinkResults: [[u16_; 4usize]; 5usize],
    pub frontier: BattleFrontier,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SaveBlock2"][::core::mem::size_of::<SaveBlock2>() - 3848usize];
    ["Alignment of SaveBlock2"][::core::mem::align_of::<SaveBlock2>() - 4usize];
    ["Offset of field: SaveBlock2::playerName"]
        [::core::mem::offset_of!(SaveBlock2, playerName) - 0usize];
    ["Offset of field: SaveBlock2::playerGender"]
        [::core::mem::offset_of!(SaveBlock2, playerGender) - 8usize];
    ["Offset of field: SaveBlock2::specialSaveWarpFlags"]
        [::core::mem::offset_of!(SaveBlock2, specialSaveWarpFlags) - 9usize];
    ["Offset of field: SaveBlock2::playerTrainerId"]
        [::core::mem::offset_of!(SaveBlock2, playerTrainerId) - 10usize];
    ["Offset of field: SaveBlock2::playTimeHours"]
        [::core::mem::offset_of!(SaveBlock2, playTimeHours) - 14usize];
    ["Offset of field: SaveBlock2::playTimeMinutes"]
        [::core::mem::offset_of!(SaveBlock2, playTimeMinutes) - 16usize];
    ["Offset of field: SaveBlock2::playTimeSeconds"]
        [::core::mem::offset_of!(SaveBlock2, playTimeSeconds) - 17usize];
    ["Offset of field: SaveBlock2::playTimeVBlanks"]
        [::core::mem::offset_of!(SaveBlock2, playTimeVBlanks) - 18usize];
    ["Offset of field: SaveBlock2::optionsButtonMode"]
        [::core::mem::offset_of!(SaveBlock2, optionsButtonMode) - 19usize];
    ["Offset of field: SaveBlock2::pokedex"]
        [::core::mem::offset_of!(SaveBlock2, pokedex) - 24usize];
    ["Offset of field: SaveBlock2::filler_90"]
        [::core::mem::offset_of!(SaveBlock2, filler_90) - 144usize];
    ["Offset of field: SaveBlock2::localTimeOffset"]
        [::core::mem::offset_of!(SaveBlock2, localTimeOffset) - 152usize];
    ["Offset of field: SaveBlock2::lastBerryTreeUpdate"]
        [::core::mem::offset_of!(SaveBlock2, lastBerryTreeUpdate) - 158usize];
    ["Offset of field: SaveBlock2::gcnLinkFlags"]
        [::core::mem::offset_of!(SaveBlock2, gcnLinkFlags) - 164usize];
    ["Offset of field: SaveBlock2::encryptionKey"]
        [::core::mem::offset_of!(SaveBlock2, encryptionKey) - 168usize];
    ["Offset of field: SaveBlock2::playerApprentice"]
        [::core::mem::offset_of!(SaveBlock2, playerApprentice) - 172usize];
    ["Offset of field: SaveBlock2::apprentices"]
        [::core::mem::offset_of!(SaveBlock2, apprentices) - 216usize];
    ["Offset of field: SaveBlock2::berryCrush"]
        [::core::mem::offset_of!(SaveBlock2, berryCrush) - 488usize];
    ["Offset of field: SaveBlock2::pokeJump"]
        [::core::mem::offset_of!(SaveBlock2, pokeJump) - 504usize];
    ["Offset of field: SaveBlock2::berryPick"]
        [::core::mem::offset_of!(SaveBlock2, berryPick) - 520usize];
    ["Offset of field: SaveBlock2::hallRecords1P"]
        [::core::mem::offset_of!(SaveBlock2, hallRecords1P) - 536usize];
    ["Offset of field: SaveBlock2::hallRecords2P"]
        [::core::mem::offset_of!(SaveBlock2, hallRecords2P) - 1400usize];
    ["Offset of field: SaveBlock2::contestLinkResults"]
        [::core::mem::offset_of!(SaveBlock2, contestLinkResults) - 1568usize];
    ["Offset of field: SaveBlock2::frontier"]
        [::core::mem::offset_of!(SaveBlock2, frontier) - 1608usize];
};
impl SaveBlock2 {
    #[inline]
    pub fn optionsTextSpeed(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u16) }
    }
    #[inline]
    pub fn set_optionsTextSpeed(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn optionsTextSpeed_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                3u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_optionsTextSpeed_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn optionsWindowFrameType(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u16) }
    }
    #[inline]
    pub fn set_optionsWindowFrameType(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn optionsWindowFrameType_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                5u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_optionsWindowFrameType_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn optionsSound(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_optionsSound(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn optionsSound_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_optionsSound_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn optionsBattleStyle(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_optionsBattleStyle(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn optionsBattleStyle_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_optionsBattleStyle_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn optionsBattleSceneOff(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_optionsBattleSceneOff(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn optionsBattleSceneOff_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_optionsBattleSceneOff_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn regionMapZoom(&self) -> u16_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_regionMapZoom(&mut self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn regionMapZoom_raw(this: *const Self) -> u16_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_regionMapZoom_raw(this: *mut Self, val: u16_) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        optionsTextSpeed: u16_,
        optionsWindowFrameType: u16_,
        optionsSound: u16_,
        optionsBattleStyle: u16_,
        optionsBattleSceneOff: u16_,
        regionMapZoom: u16_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let optionsTextSpeed: u16 = unsafe { ::core::mem::transmute(optionsTextSpeed) };
            optionsTextSpeed as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let optionsWindowFrameType: u16 =
                unsafe { ::core::mem::transmute(optionsWindowFrameType) };
            optionsWindowFrameType as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let optionsSound: u16 = unsafe { ::core::mem::transmute(optionsSound) };
            optionsSound as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let optionsBattleStyle: u16 = unsafe { ::core::mem::transmute(optionsBattleStyle) };
            optionsBattleStyle as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let optionsBattleSceneOff: u16 =
                unsafe { ::core::mem::transmute(optionsBattleSceneOff) };
            optionsBattleSceneOff as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let regionMapZoom: u16 = unsafe { ::core::mem::transmute(regionMapZoom) };
            regionMapZoom as u64
        });
        __bindgen_bitfield_unit
    }
}
unsafe extern "C" {
    pub static mut gSaveBlock2Ptr: *mut SaveBlock2;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SecretBaseParty {
    pub personality: [u32_; 6usize],
    pub moves: [u16_; 24usize],
    pub species: [u16_; 6usize],
    pub heldItems: [u16_; 6usize],
    pub levels: [u8_; 6usize],
    pub EVs: [u8_; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SecretBaseParty"][::core::mem::size_of::<SecretBaseParty>() - 108usize];
    ["Alignment of SecretBaseParty"][::core::mem::align_of::<SecretBaseParty>() - 4usize];
    ["Offset of field: SecretBaseParty::personality"]
        [::core::mem::offset_of!(SecretBaseParty, personality) - 0usize];
    ["Offset of field: SecretBaseParty::moves"]
        [::core::mem::offset_of!(SecretBaseParty, moves) - 24usize];
    ["Offset of field: SecretBaseParty::species"]
        [::core::mem::offset_of!(SecretBaseParty, species) - 72usize];
    ["Offset of field: SecretBaseParty::heldItems"]
        [::core::mem::offset_of!(SecretBaseParty, heldItems) - 84usize];
    ["Offset of field: SecretBaseParty::levels"]
        [::core::mem::offset_of!(SecretBaseParty, levels) - 96usize];
    ["Offset of field: SecretBaseParty::EVs"]
        [::core::mem::offset_of!(SecretBaseParty, EVs) - 102usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SecretBase {
    pub secretBaseId: u8_,
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub trainerName: [u8_; 7usize],
    pub trainerId: [u8_; 4usize],
    pub language: u8_,
    pub numSecretBasesReceived: u16_,
    pub numTimesEntered: u8_,
    pub unused: u8_,
    pub decorations: [u8_; 16usize],
    pub decorationPositions: [u8_; 16usize],
    pub party: SecretBaseParty,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SecretBase"][::core::mem::size_of::<SecretBase>() - 160usize];
    ["Alignment of SecretBase"][::core::mem::align_of::<SecretBase>() - 4usize];
    ["Offset of field: SecretBase::secretBaseId"]
        [::core::mem::offset_of!(SecretBase, secretBaseId) - 0usize];
    ["Offset of field: SecretBase::trainerName"]
        [::core::mem::offset_of!(SecretBase, trainerName) - 2usize];
    ["Offset of field: SecretBase::trainerId"]
        [::core::mem::offset_of!(SecretBase, trainerId) - 9usize];
    ["Offset of field: SecretBase::language"]
        [::core::mem::offset_of!(SecretBase, language) - 13usize];
    ["Offset of field: SecretBase::numSecretBasesReceived"]
        [::core::mem::offset_of!(SecretBase, numSecretBasesReceived) - 14usize];
    ["Offset of field: SecretBase::numTimesEntered"]
        [::core::mem::offset_of!(SecretBase, numTimesEntered) - 16usize];
    ["Offset of field: SecretBase::unused"][::core::mem::offset_of!(SecretBase, unused) - 17usize];
    ["Offset of field: SecretBase::decorations"]
        [::core::mem::offset_of!(SecretBase, decorations) - 18usize];
    ["Offset of field: SecretBase::decorationPositions"]
        [::core::mem::offset_of!(SecretBase, decorationPositions) - 34usize];
    ["Offset of field: SecretBase::party"][::core::mem::offset_of!(SecretBase, party) - 52usize];
};
impl SecretBase {
    #[inline]
    pub fn toRegister(&self) -> bool8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_toRegister(&mut self, val: bool8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn toRegister_raw(this: *const Self) -> bool8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                4u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_toRegister_raw(this: *mut Self, val: bool8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn gender(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_gender(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn gender_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_gender_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn battledOwnerToday(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_battledOwnerToday(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn battledOwnerToday_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_battledOwnerToday_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn registryStatus(&self) -> u8_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 2u8) as u8) }
    }
    #[inline]
    pub fn set_registryStatus(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn registryStatus_raw(this: *const Self) -> u8_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                2u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_registryStatus_raw(this: *mut Self, val: u8_) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        toRegister: bool8,
        gender: u8_,
        battledOwnerToday: u8_,
        registryStatus: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let toRegister: u8 = unsafe { ::core::mem::transmute(toRegister) };
            toRegister as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let gender: u8 = unsafe { ::core::mem::transmute(gender) };
            gender as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let battledOwnerToday: u8 = unsafe { ::core::mem::transmute(battledOwnerToday) };
            battledOwnerToday as u64
        });
        __bindgen_bitfield_unit.set(6usize, 2u8, {
            let registryStatus: u8 = unsafe { ::core::mem::transmute(registryStatus) };
            registryStatus as u64
        });
        __bindgen_bitfield_unit
    }
}
pub const METATILE_LAYER_TYPE_NORMAL: _bindgen_ty_6 = 0;
pub const METATILE_LAYER_TYPE_COVERED: _bindgen_ty_6 = 1;
pub const METATILE_LAYER_TYPE_SPLIT: _bindgen_ty_6 = 2;
pub type _bindgen_ty_6 = ::core::ffi::c_uint;
pub type TilesetCB = ::core::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Tileset {
    pub isCompressed: bool8,
    pub isSecondary: bool8,
    pub tiles: *const u32_,
    pub palettes: *const [::core::ffi::c_ushort; 16usize],
    pub metatiles: *const u16_,
    pub metatileAttributes: *const u16_,
    pub callback: TilesetCB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Tileset"][::core::mem::size_of::<Tileset>() - 24usize];
    ["Alignment of Tileset"][::core::mem::align_of::<Tileset>() - 4usize];
    ["Offset of field: Tileset::isCompressed"]
        [::core::mem::offset_of!(Tileset, isCompressed) - 0usize];
    ["Offset of field: Tileset::isSecondary"]
        [::core::mem::offset_of!(Tileset, isSecondary) - 1usize];
    ["Offset of field: Tileset::tiles"][::core::mem::offset_of!(Tileset, tiles) - 4usize];
    ["Offset of field: Tileset::palettes"][::core::mem::offset_of!(Tileset, palettes) - 8usize];
    ["Offset of field: Tileset::metatiles"][::core::mem::offset_of!(Tileset, metatiles) - 12usize];
    ["Offset of field: Tileset::metatileAttributes"]
        [::core::mem::offset_of!(Tileset, metatileAttributes) - 16usize];
    ["Offset of field: Tileset::callback"][::core::mem::offset_of!(Tileset, callback) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MapLayout {
    pub width: s32,
    pub height: s32,
    pub border: *const u16_,
    pub map: *const u16_,
    pub primaryTileset: *const Tileset,
    pub secondaryTileset: *const Tileset,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MapLayout"][::core::mem::size_of::<MapLayout>() - 24usize];
    ["Alignment of MapLayout"][::core::mem::align_of::<MapLayout>() - 4usize];
    ["Offset of field: MapLayout::width"][::core::mem::offset_of!(MapLayout, width) - 0usize];
    ["Offset of field: MapLayout::height"][::core::mem::offset_of!(MapLayout, height) - 4usize];
    ["Offset of field: MapLayout::border"][::core::mem::offset_of!(MapLayout, border) - 8usize];
    ["Offset of field: MapLayout::map"][::core::mem::offset_of!(MapLayout, map) - 12usize];
    ["Offset of field: MapLayout::primaryTileset"]
        [::core::mem::offset_of!(MapLayout, primaryTileset) - 16usize];
    ["Offset of field: MapLayout::secondaryTileset"]
        [::core::mem::offset_of!(MapLayout, secondaryTileset) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BackupMapLayout {
    pub width: s32,
    pub height: s32,
    pub map: *mut u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BackupMapLayout"][::core::mem::size_of::<BackupMapLayout>() - 12usize];
    ["Alignment of BackupMapLayout"][::core::mem::align_of::<BackupMapLayout>() - 4usize];
    ["Offset of field: BackupMapLayout::width"]
        [::core::mem::offset_of!(BackupMapLayout, width) - 0usize];
    ["Offset of field: BackupMapLayout::height"]
        [::core::mem::offset_of!(BackupMapLayout, height) - 4usize];
    ["Offset of field: BackupMapLayout::map"]
        [::core::mem::offset_of!(BackupMapLayout, map) - 8usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ObjectEventTemplate {
    pub _bindgen_opaque_blob: [u32; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ObjectEventTemplate"][::core::mem::size_of::<ObjectEventTemplate>() - 24usize];
    ["Alignment of ObjectEventTemplate"][::core::mem::align_of::<ObjectEventTemplate>() - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WarpEvent {
    pub x: s16,
    pub y: s16,
    pub elevation: u8_,
    pub warpId: u8_,
    pub mapNum: u8_,
    pub mapGroup: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of WarpEvent"][::core::mem::size_of::<WarpEvent>() - 8usize];
    ["Alignment of WarpEvent"][::core::mem::align_of::<WarpEvent>() - 2usize];
    ["Offset of field: WarpEvent::x"][::core::mem::offset_of!(WarpEvent, x) - 0usize];
    ["Offset of field: WarpEvent::y"][::core::mem::offset_of!(WarpEvent, y) - 2usize];
    ["Offset of field: WarpEvent::elevation"]
        [::core::mem::offset_of!(WarpEvent, elevation) - 4usize];
    ["Offset of field: WarpEvent::warpId"][::core::mem::offset_of!(WarpEvent, warpId) - 5usize];
    ["Offset of field: WarpEvent::mapNum"][::core::mem::offset_of!(WarpEvent, mapNum) - 6usize];
    ["Offset of field: WarpEvent::mapGroup"][::core::mem::offset_of!(WarpEvent, mapGroup) - 7usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CoordEvent {
    pub x: s16,
    pub y: s16,
    pub elevation: u8_,
    pub trigger: u16_,
    pub index: u16_,
    pub script: *const u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CoordEvent"][::core::mem::size_of::<CoordEvent>() - 16usize];
    ["Alignment of CoordEvent"][::core::mem::align_of::<CoordEvent>() - 4usize];
    ["Offset of field: CoordEvent::x"][::core::mem::offset_of!(CoordEvent, x) - 0usize];
    ["Offset of field: CoordEvent::y"][::core::mem::offset_of!(CoordEvent, y) - 2usize];
    ["Offset of field: CoordEvent::elevation"]
        [::core::mem::offset_of!(CoordEvent, elevation) - 4usize];
    ["Offset of field: CoordEvent::trigger"][::core::mem::offset_of!(CoordEvent, trigger) - 6usize];
    ["Offset of field: CoordEvent::index"][::core::mem::offset_of!(CoordEvent, index) - 8usize];
    ["Offset of field: CoordEvent::script"][::core::mem::offset_of!(CoordEvent, script) - 12usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct BgEvent {
    pub x: u16_,
    pub y: u16_,
    pub elevation: u8_,
    pub kind: u8_,
    pub bgUnion: BgEvent__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union BgEvent__bindgen_ty_1 {
    pub script: *const u8_,
    pub hiddenItem: BgEvent__bindgen_ty_1__bindgen_ty_1,
    pub secretBaseId: u32_,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BgEvent__bindgen_ty_1__bindgen_ty_1 {
    pub item: u16_,
    pub hiddenItemId: u16_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BgEvent__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<BgEvent__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of BgEvent__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<BgEvent__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Offset of field: BgEvent__bindgen_ty_1__bindgen_ty_1::item"]
        [::core::mem::offset_of!(BgEvent__bindgen_ty_1__bindgen_ty_1, item) - 0usize];
    ["Offset of field: BgEvent__bindgen_ty_1__bindgen_ty_1::hiddenItemId"]
        [::core::mem::offset_of!(BgEvent__bindgen_ty_1__bindgen_ty_1, hiddenItemId) - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BgEvent__bindgen_ty_1"][::core::mem::size_of::<BgEvent__bindgen_ty_1>() - 4usize];
    ["Alignment of BgEvent__bindgen_ty_1"]
        [::core::mem::align_of::<BgEvent__bindgen_ty_1>() - 4usize];
    ["Offset of field: BgEvent__bindgen_ty_1::script"]
        [::core::mem::offset_of!(BgEvent__bindgen_ty_1, script) - 0usize];
    ["Offset of field: BgEvent__bindgen_ty_1::hiddenItem"]
        [::core::mem::offset_of!(BgEvent__bindgen_ty_1, hiddenItem) - 0usize];
    ["Offset of field: BgEvent__bindgen_ty_1::secretBaseId"]
        [::core::mem::offset_of!(BgEvent__bindgen_ty_1, secretBaseId) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of BgEvent"][::core::mem::size_of::<BgEvent>() - 12usize];
    ["Alignment of BgEvent"][::core::mem::align_of::<BgEvent>() - 4usize];
    ["Offset of field: BgEvent::x"][::core::mem::offset_of!(BgEvent, x) - 0usize];
    ["Offset of field: BgEvent::y"][::core::mem::offset_of!(BgEvent, y) - 2usize];
    ["Offset of field: BgEvent::elevation"][::core::mem::offset_of!(BgEvent, elevation) - 4usize];
    ["Offset of field: BgEvent::kind"][::core::mem::offset_of!(BgEvent, kind) - 5usize];
    ["Offset of field: BgEvent::bgUnion"][::core::mem::offset_of!(BgEvent, bgUnion) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MapEvents {
    pub objectEventCount: u8_,
    pub warpCount: u8_,
    pub coordEventCount: u8_,
    pub bgEventCount: u8_,
    pub objectEvents: *const ObjectEventTemplate,
    pub warps: *const WarpEvent,
    pub coordEvents: *const CoordEvent,
    pub bgEvents: *const BgEvent,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MapEvents"][::core::mem::size_of::<MapEvents>() - 20usize];
    ["Alignment of MapEvents"][::core::mem::align_of::<MapEvents>() - 4usize];
    ["Offset of field: MapEvents::objectEventCount"]
        [::core::mem::offset_of!(MapEvents, objectEventCount) - 0usize];
    ["Offset of field: MapEvents::warpCount"]
        [::core::mem::offset_of!(MapEvents, warpCount) - 1usize];
    ["Offset of field: MapEvents::coordEventCount"]
        [::core::mem::offset_of!(MapEvents, coordEventCount) - 2usize];
    ["Offset of field: MapEvents::bgEventCount"]
        [::core::mem::offset_of!(MapEvents, bgEventCount) - 3usize];
    ["Offset of field: MapEvents::objectEvents"]
        [::core::mem::offset_of!(MapEvents, objectEvents) - 4usize];
    ["Offset of field: MapEvents::warps"][::core::mem::offset_of!(MapEvents, warps) - 8usize];
    ["Offset of field: MapEvents::coordEvents"]
        [::core::mem::offset_of!(MapEvents, coordEvents) - 12usize];
    ["Offset of field: MapEvents::bgEvents"]
        [::core::mem::offset_of!(MapEvents, bgEvents) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MapConnection {
    pub direction: u8_,
    pub offset: s32,
    pub mapGroup: u8_,
    pub mapNum: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MapConnection"][::core::mem::size_of::<MapConnection>() - 12usize];
    ["Alignment of MapConnection"][::core::mem::align_of::<MapConnection>() - 4usize];
    ["Offset of field: MapConnection::direction"]
        [::core::mem::offset_of!(MapConnection, direction) - 0usize];
    ["Offset of field: MapConnection::offset"]
        [::core::mem::offset_of!(MapConnection, offset) - 4usize];
    ["Offset of field: MapConnection::mapGroup"]
        [::core::mem::offset_of!(MapConnection, mapGroup) - 8usize];
    ["Offset of field: MapConnection::mapNum"]
        [::core::mem::offset_of!(MapConnection, mapNum) - 9usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MapConnections {
    pub count: s32,
    pub connections: *const MapConnection,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MapConnections"][::core::mem::size_of::<MapConnections>() - 8usize];
    ["Alignment of MapConnections"][::core::mem::align_of::<MapConnections>() - 4usize];
    ["Offset of field: MapConnections::count"]
        [::core::mem::offset_of!(MapConnections, count) - 0usize];
    ["Offset of field: MapConnections::connections"]
        [::core::mem::offset_of!(MapConnections, connections) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MapHeader {
    pub mapLayout: *const MapLayout,
    pub events: *const MapEvents,
    pub mapScripts: *const u8_,
    pub connections: *const MapConnections,
    pub music: u16_,
    pub mapLayoutId: u16_,
    pub regionMapSectionId: u8_,
    pub cave: u8_,
    pub weather: u8_,
    pub mapType: u8_,
    pub filler_18: [u8_; 2usize],
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub battleType: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of MapHeader"][::core::mem::size_of::<MapHeader>() - 28usize];
    ["Alignment of MapHeader"][::core::mem::align_of::<MapHeader>() - 4usize];
    ["Offset of field: MapHeader::mapLayout"]
        [::core::mem::offset_of!(MapHeader, mapLayout) - 0usize];
    ["Offset of field: MapHeader::events"][::core::mem::offset_of!(MapHeader, events) - 4usize];
    ["Offset of field: MapHeader::mapScripts"]
        [::core::mem::offset_of!(MapHeader, mapScripts) - 8usize];
    ["Offset of field: MapHeader::connections"]
        [::core::mem::offset_of!(MapHeader, connections) - 12usize];
    ["Offset of field: MapHeader::music"][::core::mem::offset_of!(MapHeader, music) - 16usize];
    ["Offset of field: MapHeader::mapLayoutId"]
        [::core::mem::offset_of!(MapHeader, mapLayoutId) - 18usize];
    ["Offset of field: MapHeader::regionMapSectionId"]
        [::core::mem::offset_of!(MapHeader, regionMapSectionId) - 20usize];
    ["Offset of field: MapHeader::cave"][::core::mem::offset_of!(MapHeader, cave) - 21usize];
    ["Offset of field: MapHeader::weather"][::core::mem::offset_of!(MapHeader, weather) - 22usize];
    ["Offset of field: MapHeader::mapType"][::core::mem::offset_of!(MapHeader, mapType) - 23usize];
    ["Offset of field: MapHeader::filler_18"]
        [::core::mem::offset_of!(MapHeader, filler_18) - 24usize];
    ["Offset of field: MapHeader::battleType"]
        [::core::mem::offset_of!(MapHeader, battleType) - 27usize];
};
impl MapHeader {
    #[inline]
    pub fn allowCycling(&self) -> bool8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_allowCycling(&mut self, val: bool8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn allowCycling_raw(this: *const Self) -> bool8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_allowCycling_raw(this: *mut Self, val: bool8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn allowEscaping(&self) -> bool8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_allowEscaping(&mut self, val: bool8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn allowEscaping_raw(this: *const Self) -> bool8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_allowEscaping_raw(this: *mut Self, val: bool8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn allowRunning(&self) -> bool8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_allowRunning(&mut self, val: bool8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn allowRunning_raw(this: *const Self) -> bool8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_allowRunning_raw(this: *mut Self, val: bool8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn showMapName(&self) -> bool8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u8) }
    }
    #[inline]
    pub fn set_showMapName(&mut self, val: bool8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn showMapName_raw(this: *const Self) -> bool8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 1usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                5u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_showMapName_raw(this: *mut Self, val: bool8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 1usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        allowCycling: bool8,
        allowEscaping: bool8,
        allowRunning: bool8,
        showMapName: bool8,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let allowCycling: u8 = unsafe { ::core::mem::transmute(allowCycling) };
            allowCycling as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let allowEscaping: u8 = unsafe { ::core::mem::transmute(allowEscaping) };
            allowEscaping as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let allowRunning: u8 = unsafe { ::core::mem::transmute(allowRunning) };
            allowRunning as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let showMapName: u8 = unsafe { ::core::mem::transmute(showMapName) };
            showMapName as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct ObjectEvent {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
    pub graphicsId: u16_,
    pub movementType: u8_,
    pub trainerType: u8_,
    pub localId: u8_,
    pub mapNum: u8_,
    pub mapGroup: u8_,
    pub _bitfield_align_2: [u8; 0],
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub initialCoords: Coords16,
    pub currentCoords: Coords16,
    pub previousCoords: Coords16,
    pub _bitfield_align_3: [u8; 0],
    pub _bitfield_3: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub fieldEffectSpriteId: u8_,
    pub warpArrowSpriteId: u8_,
    pub movementActionId: u8_,
    pub trainerRange_berryTreeId: u8_,
    pub currentMetatileBehavior: u8_,
    pub previousMetatileBehavior: u8_,
    pub _bitfield_align_4: [u8; 0],
    pub _bitfield_4: __BindgenBitfieldUnit<[u8; 1usize]>,
    pub directionSequenceIndex: u8_,
    pub playerCopyableMovement: u8_,
    pub spriteId: u8_,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ObjectEvent"][::core::mem::size_of::<ObjectEvent>() - 36usize];
    ["Alignment of ObjectEvent"][::core::mem::align_of::<ObjectEvent>() - 4usize];
    ["Offset of field: ObjectEvent::graphicsId"]
        [::core::mem::offset_of!(ObjectEvent, graphicsId) - 4usize];
    ["Offset of field: ObjectEvent::movementType"]
        [::core::mem::offset_of!(ObjectEvent, movementType) - 6usize];
    ["Offset of field: ObjectEvent::trainerType"]
        [::core::mem::offset_of!(ObjectEvent, trainerType) - 7usize];
    ["Offset of field: ObjectEvent::localId"]
        [::core::mem::offset_of!(ObjectEvent, localId) - 8usize];
    ["Offset of field: ObjectEvent::mapNum"][::core::mem::offset_of!(ObjectEvent, mapNum) - 9usize];
    ["Offset of field: ObjectEvent::mapGroup"]
        [::core::mem::offset_of!(ObjectEvent, mapGroup) - 10usize];
    ["Offset of field: ObjectEvent::initialCoords"]
        [::core::mem::offset_of!(ObjectEvent, initialCoords) - 12usize];
    ["Offset of field: ObjectEvent::currentCoords"]
        [::core::mem::offset_of!(ObjectEvent, currentCoords) - 16usize];
    ["Offset of field: ObjectEvent::previousCoords"]
        [::core::mem::offset_of!(ObjectEvent, previousCoords) - 20usize];
    ["Offset of field: ObjectEvent::fieldEffectSpriteId"]
        [::core::mem::offset_of!(ObjectEvent, fieldEffectSpriteId) - 26usize];
    ["Offset of field: ObjectEvent::warpArrowSpriteId"]
        [::core::mem::offset_of!(ObjectEvent, warpArrowSpriteId) - 27usize];
    ["Offset of field: ObjectEvent::movementActionId"]
        [::core::mem::offset_of!(ObjectEvent, movementActionId) - 28usize];
    ["Offset of field: ObjectEvent::trainerRange_berryTreeId"]
        [::core::mem::offset_of!(ObjectEvent, trainerRange_berryTreeId) - 29usize];
    ["Offset of field: ObjectEvent::currentMetatileBehavior"]
        [::core::mem::offset_of!(ObjectEvent, currentMetatileBehavior) - 30usize];
    ["Offset of field: ObjectEvent::previousMetatileBehavior"]
        [::core::mem::offset_of!(ObjectEvent, previousMetatileBehavior) - 31usize];
    ["Offset of field: ObjectEvent::directionSequenceIndex"]
        [::core::mem::offset_of!(ObjectEvent, directionSequenceIndex) - 33usize];
    ["Offset of field: ObjectEvent::playerCopyableMovement"]
        [::core::mem::offset_of!(ObjectEvent, playerCopyableMovement) - 34usize];
    ["Offset of field: ObjectEvent::spriteId"]
        [::core::mem::offset_of!(ObjectEvent, spriteId) - 35usize];
};
impl ObjectEvent {
    #[inline]
    pub fn active(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_active(&mut self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn active_raw(this: *const Self) -> u32_ {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_active_raw(this: *mut Self, val: u32_) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn singleMovementActive(&self) -> u32_ {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
